-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Ronald Munjoma\Documents\chips-analysis\data\chips_analysis.log
  log type:  text
 opened on:  14 Jan 2021, 08:12:55

. 
. clear

. 
. cd "C:\Users\Ronald Munjoma\Documents\chips-analysis\data"
C:\Users\Ronald Munjoma\Documents\chips-analysis\data

. ******************************************************************
. *LOAD LATEST DATA
. use chips_cleaned, clear
(This file contains CHIPS STRIPE HIV data)

. 
. * Data Analysis only for subject with non-missing values *
. keep if m1_total_score~=. & m3_total_score~=. & m4_total_score~=. & m17_total_score~=. & Pm1_total_score~=. & Pm3_total_score~=. & Pm4_total_score~=. & Pm17_total_sc
> ore~=.
(94 observations deleted)

. 
. * Create Tables
. *descriptive statistics
. 
. * check out these commands
. *tab m1_total_score, chi2
. 
. *Clinical Site by Profession Category
. *pre-test - total survey
. tab clinical_site profession_category, row nokey

  Partner or Clinical |               Health Profession Category
                 Site | Laborat..    Medical  Nursing..      Other   Pharmacy |     Total
----------------------+-------------------------------------------------------+----------
      Harare
Hospital |         3          2         12          4          0 |        21 
                      |     14.29       9.52      57.14      19.05       0.00 |    100.00 
----------------------+-------------------------------------------------------+----------
      Howard
Hospital |         0          3          6          1          0 |        10 
                      |      0.00      30.00      60.00      10.00       0.00 |    100.00 
----------------------+-------------------------------------------------------+----------
      Howard
hospital |         0          1          0          0          0 |         1 
                      |      0.00     100.00       0.00       0.00       0.00 |    100.00 
----------------------+-------------------------------------------------------+----------
MSU Gweru
Provincia.. |         1          3          4          1          0 |         9 
                      |     11.11      33.33      44.44      11.11       0.00 |    100.00 
----------------------+-------------------------------------------------------+----------
             Medicine |         0          1          0          0          0 |         1 
                      |      0.00     100.00       0.00       0.00       0.00 |    100.00 
----------------------+-------------------------------------------------------+----------
  NUST Mpilo
Hospital |         0          3          1          1          2 |         7 
                      |      0.00      42.86      14.29      14.29      28.57 |    100.00 
----------------------+-------------------------------------------------------+----------
         Parirenyatwa |         0          1          2          0          0 |         3 
                      |      0.00      33.33      66.67       0.00       0.00 |    100.00 
----------------------+-------------------------------------------------------+----------
Parirenyatwa
Center.. |         0          2          0          0          0 |         2 
                      |      0.00     100.00       0.00       0.00       0.00 |    100.00 
----------------------+-------------------------------------------------------+----------
Parirenyatwa
Hospital |         2         23         29          1          0 |        55 
                      |      3.64      41.82      52.73       1.82       0.00 |    100.00 
----------------------+-------------------------------------------------------+----------
 Parireyatwa
Hospital |         0          1          0          0          0 |         1 
                      |      0.00     100.00       0.00       0.00       0.00 |    100.00 
----------------------+-------------------------------------------------------+----------
              UNKNOWN |         0          1          0          0          1 |         2 
                      |      0.00      50.00       0.00       0.00      50.00 |    100.00 
----------------------+-------------------------------------------------------+----------
                Total |         6         41         54          8          3 |       112 
                      |      5.36      36.61      48.21       7.14       2.68 |    100.00 


. 
. *Clinical Site by Training levels
. *pre-test - total survey
. tab clinical_site training_level, row nokey

  Partner or Clinical |    Training Level
                 Site | Post-gr..  Pre-ser.. |     Total
----------------------+----------------------+----------
      Harare
Hospital |         0         21 |        21 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
      Howard
Hospital |         0         10 |        10 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
      Howard
hospital |         0          1 |         1 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
MSU Gweru
Provincia.. |         0          9 |         9 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
             Medicine |         0          1 |         1 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
  NUST Mpilo
Hospital |         0          7 |         7 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
         Parirenyatwa |         0          3 |         3 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Parirenyatwa
Center.. |         0          2 |         2 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Parirenyatwa
Hospital |         0         55 |        55 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
 Parireyatwa
Hospital |         0          1 |         1 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
              UNKNOWN |         1          1 |         2 
                      |     50.00      50.00 |    100.00 
----------------------+----------------------+----------
                Total |         1        111 |       112 
                      |      0.89      99.11 |    100.00 


. 
. *Trainne characteristics by gender
. *training_level
. tab training_level gender, row nokey

                      |              Gender
       Training Level |    Female       Male      Other |     Total
----------------------+---------------------------------+----------
Post-graduate
(beyo.. |         1          0          0 |         1 
                      |    100.00       0.00       0.00 |    100.00 
----------------------+---------------------------------+----------
  Pre-service
Student |        57         41         13 |       111 
                      |     51.35      36.94      11.71 |    100.00 
----------------------+---------------------------------+----------
                Total |        58         41         13 |       112 
                      |     51.79      36.61      11.61 |    100.00 


. *clinical_site
. tab clinical_site gender, row nokey

  Partner or Clinical |              Gender
                 Site |    Female       Male      Other |     Total
----------------------+---------------------------------+----------
      Harare
Hospital |        14          7          0 |        21 
                      |     66.67      33.33       0.00 |    100.00 
----------------------+---------------------------------+----------
      Howard
Hospital |         7          3          0 |        10 
                      |     70.00      30.00       0.00 |    100.00 
----------------------+---------------------------------+----------
      Howard
hospital |         0          1          0 |         1 
                      |      0.00     100.00       0.00 |    100.00 
----------------------+---------------------------------+----------
MSU Gweru
Provincia.. |         5          4          0 |         9 
                      |     55.56      44.44       0.00 |    100.00 
----------------------+---------------------------------+----------
             Medicine |         1          0          0 |         1 
                      |    100.00       0.00       0.00 |    100.00 
----------------------+---------------------------------+----------
  NUST Mpilo
Hospital |         3          4          0 |         7 
                      |     42.86      57.14       0.00 |    100.00 
----------------------+---------------------------------+----------
         Parirenyatwa |         2          1          0 |         3 
                      |     66.67      33.33       0.00 |    100.00 
----------------------+---------------------------------+----------
Parirenyatwa
Center.. |         1          0          1 |         2 
                      |     50.00       0.00      50.00 |    100.00 
----------------------+---------------------------------+----------
Parirenyatwa
Hospital |        22         21         12 |        55 
                      |     40.00      38.18      21.82 |    100.00 
----------------------+---------------------------------+----------
 Parireyatwa
Hospital |         1          0          0 |         1 
                      |    100.00       0.00       0.00 |    100.00 
----------------------+---------------------------------+----------
              UNKNOWN |         2          0          0 |         2 
                      |    100.00       0.00       0.00 |    100.00 
----------------------+---------------------------------+----------
                Total |        58         41         13 |       112 
                      |     51.79      36.61      11.61 |    100.00 


. *Profession_categoty
. tab profession_category gender, row nokey

Health Profession |              Gender
         Category |    Female       Male      Other |     Total
------------------+---------------------------------+----------
       Laboratory |         3          3          0 |         6 
                  |     50.00      50.00       0.00 |    100.00 
------------------+---------------------------------+----------
          Medical |        12         21          8 |        41 
                  |     29.27      51.22      19.51 |    100.00 
------------------+---------------------------------+----------
Nursing/midwifery |        38         11          5 |        54 
                  |     70.37      20.37       9.26 |    100.00 
------------------+---------------------------------+----------
            Other |         3          5          0 |         8 
                  |     37.50      62.50       0.00 |    100.00 
------------------+---------------------------------+----------
         Pharmacy |         2          1          0 |         3 
                  |     66.67      33.33       0.00 |    100.00 
------------------+---------------------------------+----------
            Total |        58         41         13 |       112 
                  |     51.79      36.61      11.61 |    100.00 


. 
. 
. *dependent ttest pre post multiple questions
. *Module 1 ttest
. ttest Pm1_total_score=m1_total_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm1_to~e |     112      96.875    .7847613    8.305132    95.31994    98.43006
m1_tot~e |     112    91.74107    1.322252     13.9934    89.12094     94.3612
---------+--------------------------------------------------------------------
    diff |     112    5.133929    1.387194    14.68068    2.385111    7.882746
------------------------------------------------------------------------------
     mean(diff) = mean(Pm1_total_score - m1_total_score)          t =   3.7009
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.9998         Pr(|T| > |t|) = 0.0003          Pr(T > t) = 0.0002

. 
. *Module 3 ttest
. ttest Pm3_total_score=m3_total_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm3_to~e |     112    77.92411    1.668844    17.66138    74.61718    81.23103
m3_tot~e |     112    59.21875      2.2576    23.89219    54.74516    63.69234
---------+--------------------------------------------------------------------
    diff |     112    18.70536    2.173634    23.00358    14.39816    23.01256
------------------------------------------------------------------------------
     mean(diff) = mean(Pm3_total_score - m3_total_score)          t =   8.6056
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. 
. *Module 4 ttest
. ttest Pm4_total_score=m4_total_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm4_to~e |     112        87.5     1.22809    12.99688    85.06646    89.93354
m4_tot~e |     112    79.91071    1.481848    15.68241    76.97433     82.8471
---------+--------------------------------------------------------------------
    diff |     112    7.589286    1.580353    16.72488    4.457711    10.72086
------------------------------------------------------------------------------
     mean(diff) = mean(Pm4_total_score - m4_total_score)          t =   4.8023
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. 
. *Module 17 ttest
. ttest Pm17_total_score=m17_total_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm17_t~e |     112    65.84821    2.242075    23.72789    61.40539    70.29104
m17_to~e |     112    39.28571    2.167252    22.93604    34.99116    43.58027
---------+--------------------------------------------------------------------
    diff |     112     26.5625    2.378846    25.17534    21.84866    31.27634
------------------------------------------------------------------------------
     mean(diff) = mean(Pm17_total_score - m17_total_score)        t =  11.1661
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. 
. *Learner evaluation of facilitator
. *post test module 1 Learner evaluation of facilitator
. tab Pm1_3_1 gender, row nokey

post-test, module 1, |
  Learner evaluation |
      of facilitator |              Gender
         question #1 |    Female       Male      Other |     Total
---------------------+---------------------------------+----------
      very effective |        31         25          7 |        63 
                     |     49.21      39.68      11.11 |    100.00 
---------------------+---------------------------------+----------
 extremely effective |        23         13          6 |        42 
                     |     54.76      30.95      14.29 |    100.00 
---------------------+---------------------------------+----------
                   6 |         4          3          0 |         7 
                     |     57.14      42.86       0.00 |    100.00 
---------------------+---------------------------------+----------
               Total |        58         41         13 |       112 
                     |     51.79      36.61      11.61 |    100.00 


. tab Pm1_3_2 gender, row nokey

 post-test, module 1, |
Learner evaluation of |
 facilitator question |              Gender
                   #2 |    Female       Male      Other |     Total
----------------------+---------------------------------+----------
moderately knowledgea |         1          0          0 |         1 
                      |    100.00       0.00       0.00 |    100.00 
----------------------+---------------------------------+----------
   very knowledgeable |        25         18          5 |        48 
                      |     52.08      37.50      10.42 |    100.00 
----------------------+---------------------------------+----------
extremely knowledgeab |        28         19          8 |        55 
                      |     50.91      34.55      14.55 |    100.00 
----------------------+---------------------------------+----------
                    6 |         4          4          0 |         8 
                      |     50.00      50.00       0.00 |    100.00 
----------------------+---------------------------------+----------
                Total |        58         41         13 |       112 
                      |     51.79      36.61      11.61 |    100.00 


. tab Pm1_3_3 gender, row nokey

post-test, |
 module 1, |
   Learner |
evaluation |
        of |
facilitato |
r question |              Gender
        #3 |    Female       Male      Other |     Total
-----------+---------------------------------+----------
       Yes |        55         38         13 |       106 
           |     51.89      35.85      12.26 |    100.00 
-----------+---------------------------------+----------
         3 |         3          3          0 |         6 
           |     50.00      50.00       0.00 |    100.00 
-----------+---------------------------------+----------
     Total |        58         41         13 |       112 
           |     51.79      36.61      11.61 |    100.00 


. tab Pm1_3_4 gender, row nokey

post-test, |
 module 1, |
   Learner |
evaluation |
        of |
facilitato |
r question |              Gender
        #4 |    Female       Male      Other |     Total
-----------+---------------------------------+----------
       Yes |        55         38         13 |       106 
           |     51.89      35.85      12.26 |    100.00 
-----------+---------------------------------+----------
         3 |         3          3          0 |         6 
           |     50.00      50.00       0.00 |    100.00 
-----------+---------------------------------+----------
     Total |        58         41         13 |       112 
           |     51.79      36.61      11.61 |    100.00 


. 
. *post test module 3 Learner evaluation of facilitator
. tab Pm3_3_1

post-test, module 3, |
  Learner evaluation |
      of facilitator |
         question #1 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
moderately effective |          5        4.46        4.46
      very effective |         56       50.00       54.46
 extremely effective |         46       41.07       95.54
                   6 |          5        4.46      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm3_3_2

    post-test, module 3, |
   Learner evaluation of |
 facilitator question #2 |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
not knowledgeable at all |          1        0.89        0.89
moderately knowledgeable |          5        4.46        5.36
      very knowledgeable |         47       41.96       47.32
 extremely knowledgeable |         54       48.21       95.54
                       6 |          5        4.46      100.00
-------------------------+-----------------------------------
                   Total |        112      100.00

. tab Pm3_3_3

 post-test, |
  module 3, |
    Learner |
 evaluation |
         of |
facilitator |
question #3 |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        106       94.64       94.64
          2 |          1        0.89       95.54
          3 |          5        4.46      100.00
------------+-----------------------------------
      Total |        112      100.00

. tab Pm3_3_4

 post-test, |
  module 3, |
    Learner |
 evaluation |
         of |
facilitator |
question #4 |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        106       94.64       94.64
          2 |          1        0.89       95.54
          3 |          5        4.46      100.00
------------+-----------------------------------
      Total |        112      100.00

. 
. *post test module 4 Learner evaluation of facilitator
. tab Pm4_3_1

post-test, module 4, |
  Learner evaluation |
      of facilitator |
         question #1 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
moderately effective |          1        0.89        0.89
      very effective |         56       50.00       50.89
 extremely effective |         45       40.18       91.07
                   6 |         10        8.93      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm4_3_2

    post-test, module 4, |
   Learner evaluation of |
 facilitator question #2 |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
moderately knowledgeable |          1        0.89        0.89
      very knowledgeable |         47       41.96       42.86
 extremely knowledgeable |         54       48.21       91.07
                       6 |         10        8.93      100.00
-------------------------+-----------------------------------
                   Total |        112      100.00

. tab Pm4_3_3

 post-test, |
  module 4, |
    Learner |
 evaluation |
         of |
facilitator |
question #3 |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        101       90.18       90.18
          2 |          1        0.89       91.07
          3 |         10        8.93      100.00
------------+-----------------------------------
      Total |        112      100.00

. tab Pm4_3_4

 post-test, |
  module 4, |
    Learner |
 evaluation |
         of |
facilitator |
question #4 |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        102       91.07       91.07
          3 |         10        8.93      100.00
------------+-----------------------------------
      Total |        112      100.00

. 
. *post test module 17 Learner evaluation of facilitator
. tab Pm17_3_1

   post-test, module |
         17, Learner |
       evaluation of |
facilitator question |
                  #1 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
moderately effective |          2        1.79        1.79
      very effective |         56       50.00       51.79
 extremely effective |         49       43.75       95.54
                   6 |          5        4.46      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm17_3_2

   post-test, module 17, |
   Learner evaluation of |
 facilitator question #2 |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
moderately knowledgeable |          2        1.79        1.79
      very knowledgeable |         49       43.75       45.54
 extremely knowledgeable |         57       50.89       96.43
                       6 |          4        3.57      100.00
-------------------------+-----------------------------------
                   Total |        112      100.00

. tab Pm17_3_3

 post-test, |
 module 17, |
    Learner |
 evaluation |
         of |
facilitator |
question #3 |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        107       95.54       95.54
          2 |          1        0.89       96.43
          3 |          4        3.57      100.00
------------+-----------------------------------
      Total |        112      100.00

. tab Pm17_3_4

 post-test, |
 module 17, |
    Learner |
 evaluation |
         of |
facilitator |
question #4 |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        108       96.43       96.43
          3 |          4        3.57      100.00
------------+-----------------------------------
      Total |        112      100.00

. 
. *Learner evaluation of module
. *post test module 1 Learner evaluation of module
. tab Pm1_4_1

  post-test, module 1, |
 Learner evaluation of |
    module question #1 |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Extremely dissatisfied |          2        1.79        1.79
    Slightly satisfied |         10        8.93       10.71
   Extremely satisfied |         92       82.14       92.86
                     6 |          8        7.14      100.00
-----------------------+-----------------------------------
                 Total |        112      100.00

. tab Pm1_4_2

post-test, module 1, |
  Learner evaluation |
  of module question |
                  #2 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
moderately effective |          1        0.89        0.89
      very effective |         52       46.43       47.32
 extremely effective |         52       46.43       93.75
                   6 |          7        6.25      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm1_4_3

post-test, module 1, |
  Learner evaluation |
  of module question |
                  #3 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
  slightly effective |          2        1.79        1.79
moderately effective |         10        8.93       10.71
      very effective |         60       53.57       64.29
 extremely effective |         32       28.57       92.86
                   6 |          8        7.14      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm1_4_4

post-test, module 1, |
  Learner evaluation |
  of module question |
                  #4 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
  slightly effective |          2        1.79        1.79
moderately effective |          8        7.14        8.93
      very effective |         60       53.57       62.50
 extremely effective |         32       28.57       91.07
                   6 |         10        8.93      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. 
. *post test module 3 Learner evaluation of module
. tab Pm3_4_1

  post-test, module 3, |
 Learner evaluation of |
    module question #1 |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
    Slightly satisfied |         16       14.29       14.29
   Extremely satisfied |         91       81.25       95.54
                     6 |          5        4.46      100.00
-----------------------+-----------------------------------
                 Total |        112      100.00

. tab Pm3_4_2

post-test, module 3, |
  Learner evaluation |
  of module question |
                  #2 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
moderately effective |          2        1.79        1.79
      very effective |         52       46.43       48.21
 extremely effective |         53       47.32       95.54
                   6 |          5        4.46      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm3_4_3

post-test, module 3, |
  Learner evaluation |
  of module question |
                  #3 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
  slightly effective |          1        0.89        0.89
moderately effective |         10        8.93        9.82
      very effective |         56       50.00       59.82
 extremely effective |         39       34.82       94.64
                   6 |          6        5.36      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm3_4_4

post-test, module 3, |
  Learner evaluation |
  of module question |
                  #4 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
  slightly effective |          2        1.79        1.79
moderately effective |         12       10.71       12.50
      very effective |         53       47.32       59.82
 extremely effective |         36       32.14       91.96
                   6 |          9        8.04      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. 
. *post test module 4 Learner evaluation of module
. tab Pm4_4_1

  post-test, module 4, |
 Learner evaluation of |
    module question #1 |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
    Slightly satisfied |         16       14.29       14.29
   Extremely satisfied |         86       76.79       91.07
                     6 |         10        8.93      100.00
-----------------------+-----------------------------------
                 Total |        112      100.00

. tab Pm4_4_2

post-test, module 4, |
  Learner evaluation |
  of module question |
                  #2 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
moderately effective |          2        1.79        1.79
      very effective |         43       38.39       40.18
 extremely effective |         57       50.89       91.07
                   6 |         10        8.93      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm4_4_3

post-test, module 4, |
  Learner evaluation |
  of module question |
                  #3 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
moderately effective |          5        4.46        4.46
      very effective |         52       46.43       50.89
 extremely effective |         44       39.29       90.18
                   6 |         11        9.82      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm4_4_4

post-test, module 4, |
  Learner evaluation |
  of module question |
                  #4 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
  slightly effective |          2        1.79        1.79
moderately effective |          9        8.04        9.82
      very effective |         49       43.75       53.57
 extremely effective |         38       33.93       87.50
                   6 |         14       12.50      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. 
. *post test module 17 Learner evaluation of module
. tab Pm17_4_1

 post-test, module 17, |
 Learner evaluation of |
    module question #1 |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
    Slightly satisfied |         20       17.86       17.86
   Extremely satisfied |         88       78.57       96.43
                     6 |          4        3.57      100.00
-----------------------+-----------------------------------
                 Total |        112      100.00

. tab Pm17_4_2

   post-test, module |
         17, Learner |
evaluation of module |
         question #2 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
moderately effective |          1        0.89        0.89
      very effective |         53       47.32       48.21
 extremely effective |         54       48.21       96.43
                   6 |          4        3.57      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm17_4_3

   post-test, module |
         17, Learner |
evaluation of module |
         question #3 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
  slightly effective |          1        0.89        0.89
moderately effective |          6        5.36        6.25
      very effective |         54       48.21       54.46
 extremely effective |         45       40.18       94.64
                   6 |          6        5.36      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm17_4_4

   post-test, module |
         17, Learner |
evaluation of module |
         question #4 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
  slightly effective |          1        0.89        0.89
moderately effective |          9        8.04        8.93
      very effective |         45       40.18       49.11
 extremely effective |         44       39.29       88.39
                   6 |         13       11.61      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. 
end of do-file

. summarize

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
          id |       112    1809.536    1087.285         17       3681
   form_date |       112    1.90e+12    4.23e+09   1.89e+12   1.90e+12
    facility |         0
training_l~l |         0
clinical_s~e |         0
-------------+--------------------------------------------------------
profession~y |         0
      gender |         0
     country |         0
      m1_1_1 |         0
      m1_1_2 |         0
-------------+--------------------------------------------------------
      m1_1_3 |         0
      m1_1_4 |         0
m1_1_1_score |       112    .8482143    .3604257          0          1
m1_1_3_score |       112    .9107143    .2864373          0          1
m1_1_2_score |       112    .9821429    .1330273          0          1
-------------+--------------------------------------------------------
m1_1_4_score |       112    .9285714    .2586969          0          1
m1_total_s~e |       112    91.74107     13.9934         50        100
      m1_2_1 |       112           3     .967955          1          5
      m1_2_2 |       112    3.169643    .9288993          1          5
      m1_2_3 |       112    3.142857     .868437          1          5
-------------+--------------------------------------------------------
      m1_2_4 |       112    3.044643    .8635605          1          5
      m1_2_5 |       112    2.910714    1.035875          1          5
      m1_2_6 |       112    3.642857    1.072651          1          5
      m1_2_7 |       111     4.18018     1.04619          2          5
      m3_1_1 |         0
-------------+--------------------------------------------------------
      m3_1_2 |         0
      m3_1_3 |         0
    m3_1_4_1 |       112       3.125    1.194017          1          5
    m3_1_4_2 |       112    2.303571    1.681051          1          5
    m3_1_4_3 |       112    3.857143    .9850883          1          5
-------------+--------------------------------------------------------
    m3_1_4_4 |       112    2.785714    1.318124          1          5
      m3_1_5 |         0
m3_1_1_score |       112    .7767857    .4182723          0          1
m3_1_2_score |       112    .8928571    .3106849          0          1
m3_1_3_score |       112    .3839286    .4885267          0          1
-------------+--------------------------------------------------------
m3_1_4_1_s~e |       112    .1272321    .1500583          0          1
m3_1_4_2_s~e |       112    .1495536    .1480345          0          1
m3_1_4_3_s~e |       112    .1517857    .1476434          0          1
m3_1_4_4_s~e |       112    .1540179    .1472172          0          1
m3_1_5_score |       112    .3482143    .4785455          0          1
-------------+--------------------------------------------------------
m3_total_s~e |       112    59.21875    23.89219          5        100
      m3_2_1 |       112    2.705357    .9457195          1          5
      m3_2_2 |       112    2.607143    .9139277          1          5
      m3_2_3 |       112    2.732143    .9770533          1          5
      m3_2_4 |       112    2.910714    .8959727          1          5
-------------+--------------------------------------------------------
      m3_2_5 |       111    3.585586     1.17139          1          5
      m4_1_1 |         0
      m4_1_2 |         0
      m4_1_3 |         0
      m4_1_4 |         0
-------------+--------------------------------------------------------
m4_1_1_score |       112    .8392857    .3689179          0          1
m4_1_2_score |       112    .9732143    .1621823          0          1
m4_1_3_score |       112    .9553571    .2074466          0          1
m4_1_4_score |       112    .4285714    .4970958          0          1
m4_total_s~e |       112    79.91071    15.68241         25        100
-------------+--------------------------------------------------------
      m4_2_1 |       112    2.946429    .9476313          1          5
      m4_2_2 |       112    2.946429     .984925          1          5
      m4_2_3 |       112    2.821429     1.03292          1          5
      m4_2_4 |       112    3.285714    .7760906          1          5
      m4_2_5 |       112    2.151786    1.274913          1          5
-------------+--------------------------------------------------------
      m4_2_6 |       111    3.621622    1.128588          1          5
     m17_1_1 |         0
     m17_1_2 |         0
     m17_1_3 |         0
     m17_1_4 |         0
-------------+--------------------------------------------------------
m17_1_1_sc~e |       112    .4464286    .4993561          0          1
m17_1_2_sc~e |       112    .2232143    .4182723          0          1
m17_1_3_sc~e |       112    .0535714     .226182          0          1
m17_1_4_sc~e |       112    .8482143    .3604257          0          1
m17_total_~e |       112    39.28571    22.93604          0        100
-------------+--------------------------------------------------------
     m17_2_2 |       112    2.696429    1.011994          1          5
     m17_2_3 |       112    2.580357    1.136126          1          5
     m17_2_4 |       112           3     1.09873          1          5
     m17_2_5 |       112    3.026786     .999638          1          5
completed_~e |       112           1           0          1          1
-------------+--------------------------------------------------------
     Pm1_1_1 |         0
     Pm1_1_2 |         0
     Pm1_1_3 |         0
     Pm1_1_4 |         0
Pm1_1_1_sc~e |       112    .9821429    .1330273          0          1
-------------+--------------------------------------------------------
Pm1_1_3_sc~e |       112    .9464286     .226182          0          1
Pm1_1_2_sc~e |       112    .9642857    .1864109          0          1
Pm1_1_4_sc~e |       112    .9821429    .1330273          0          1
Pm1_total_~e |       112      96.875    8.305132         75        100
     Pm1_2_1 |       112    3.580357    .6796713          1          5
-------------+--------------------------------------------------------
     Pm1_2_2 |       112       3.625    .6860909          1          5
     Pm1_2_3 |       112    3.616071    .7382172          1          5
     Pm1_2_4 |       112    3.598214    .6638656          1          5
     Pm1_2_5 |       112         3.5    .8274568          1          5
     Pm1_2_6 |       112    3.892857    .8939954          1          5
-------------+--------------------------------------------------------
     Pm1_2_7 |       111    4.333333    .8668997          3          5
     Pm1_3_1 |       112         4.5    .6151247          4          6
     Pm1_3_2 |       112       4.625    .6313863          3          6
     Pm1_3_3 |       112    1.107143     .452364          1          3
     Pm1_3_4 |       112    1.107143     .452364          1          3
-------------+--------------------------------------------------------
     Pm1_3_5 |         0
     Pm1_4_1 |       112    4.910714    .6651366          1          6
     Pm1_4_2 |       112    4.580357    .6244045          3          6
     Pm1_4_3 |       112    4.303571    .8035875          2          6
     Pm1_4_4 |       112    4.357143    .8149188          2          6
-------------+--------------------------------------------------------
     Pm1_4_5 |         0
     Pm3_1_1 |         0
     Pm3_1_2 |         0
     Pm3_1_3 |         0
   Pm3_1_4_1 |       112    3.169643    .7697946          1          5
-------------+--------------------------------------------------------
   Pm3_1_4_2 |       112    1.508929    1.259168          1          5
   Pm3_1_4_3 |       112    4.053571    .4419304          2          5
   Pm3_1_4_4 |       112    2.294643     .876504          1          5
     Pm3_1_5 |         0
Pm3_1_1_sc~e |       112    .9017857    .2989417          0          1
-------------+--------------------------------------------------------
Pm3_1_2_sc~e |       112    .9732143    .1621823          0          1
Pm3_1_3_sc~e |       112    .6428571     .481311          0          1
Pm3_1_4_1_~e |       112     .203125    .1279219          0          1
Pm3_1_4_2_~e |       112      .21875    .1168515          0          1
Pm3_1_4_3_~e |       112    .2209821    .1150085          0          1
-------------+--------------------------------------------------------
Pm3_1_4_4_~e |       112    .2232143     .113091          0          1
Pm3_1_5_sc~e |       112    .5357143    .5009643          0          1
Pm3_total_~e |       112    77.92411    17.66138         35        100
     Pm3_2_1 |       112         3.5    .7352146          1          5
     Pm3_2_2 |       112    3.517857    .7100583          1          5
-------------+--------------------------------------------------------
     Pm3_2_3 |       112      3.5625    .7447262          1          5
     Pm3_2_4 |       112    3.580357    .6796713          1          5
     Pm3_2_5 |       111    3.828829    .9032655          1          5
     Pm3_3_1 |       112    4.455357    .6560652          3          6
     Pm3_3_2 |       112         4.5    .7352146          1          6
-------------+--------------------------------------------------------
     Pm3_3_3 |       112    1.098214    .4236228          1          3
     Pm3_3_4 |       112    1.098214    .4236228          1          3
     Pm3_3_5 |         0
     Pm3_4_1 |       112    4.901786    .4236228          4          6
     Pm3_4_2 |       112    4.544643    .6134879          3          6
-------------+--------------------------------------------------------
     Pm3_4_3 |       112    4.348214    .7558757          2          6
     Pm3_4_4 |       112    4.339286     .844202          2          6
     Pm3_4_5 |         0
     Pm4_1_1 |         0
     Pm4_1_2 |         0
-------------+--------------------------------------------------------
     Pm4_1_3 |         0
     Pm4_1_4 |         0
Pm4_1_1_sc~e |       112    .9821429    .1330273          0          1
Pm4_1_2_sc~e |       112    .9910714    .0944911          0          1
Pm4_1_3_sc~e |       112    .9642857    .1864109          0          1
-------------+--------------------------------------------------------
Pm4_1_4_sc~e |       112       .5625    .4983079          0          1
Pm4_total_~e |       112        87.5    12.99688         50        100
     Pm4_2_1 |       112    3.678571    .6605251          1          5
     Pm4_2_2 |       112    3.598214    .6501534          1          5
     Pm4_2_3 |       112    3.598214    .6638656          1          5
-------------+--------------------------------------------------------
     Pm4_2_4 |       112    3.705357    .6244045          1          5
     Pm4_2_5 |       112    3.526786     .709775          1          5
     Pm4_2_6 |       111    3.855856    .8511687          2          5
     Pm4_3_1 |       112    4.571429    .6673099          3          6
     Pm4_3_2 |       112    4.651786    .6536084          3          6
-------------+--------------------------------------------------------
     Pm4_3_3 |       112      1.1875    .5778377          1          3
     Pm4_3_4 |       112    1.178571    .5728746          1          3
     Pm4_3_5 |         0
     Pm4_4_1 |       112    4.946429    .4809766          4          6
     Pm4_4_2 |       112    4.669643    .6628955          3          6
-------------+--------------------------------------------------------
     Pm4_4_3 |       112    4.544643    .7338458          3          6
     Pm4_4_4 |       112    4.473214    .8798016          2          6
     Pm4_4_5 |         0
    Pm17_1_1 |         0
    Pm17_1_2 |         0
-------------+--------------------------------------------------------
    Pm17_1_3 |         0
    Pm17_1_4 |         0
Pm17_1_1_s~e |       112    .8482143    .3604257          0          1
Pm17_1_2_s~e |       112    .5446429    .5002413          0          1
Pm17_1_3_s~e |       112    .3839286    .4885267          0          1
-------------+--------------------------------------------------------
Pm17_1_4_s~e |       112    .8571429    .3514998          0          1
Pm17_total~e |       112    65.84821    23.72789          0        100
    Pm17_2_2 |       112      3.5625    .7447262          1          5
    Pm17_2_3 |       112      3.4375    .8359194          1          5
    Pm17_2_4 |       112    3.535714    .7818731          1          5
-------------+--------------------------------------------------------
    Pm17_2_5 |       112    3.660714    .6514512          1          5
    Pm17_3_1 |       112    4.508929    .6150593          3          6
    Pm17_3_2 |       112      4.5625    .5970083          3          6
    Pm17_3_3 |       112    1.080357     .382933          1          3
    Pm17_3_4 |       112    1.071429    .3728219          1          3
-------------+--------------------------------------------------------
    Pm17_3_5 |         0
    Pm17_4_1 |       112    4.857143    .4422942          4          6
    Pm17_4_2 |       112    4.544643    .5833793          3          6
    Pm17_4_3 |       112      4.4375    .7201257          2          6
    Pm17_4_4 |       112    4.526786    .8378417          2          6
-------------+--------------------------------------------------------
    Pm17_4_5 |         0
FINAL_REFL~1 |         0
FINAL_REFL~2 |         0
FINAL_REFL~3 |         0
completed_~t |       112           1           0          1          1

