-------------------------------------------------------------------------

. 
. 
. *Learner evaluation of facilitator
. *post test module 1 Learner evaluation of facilitator
. tab Pm1_3_1

post-test, module 1, |
  Learner evaluation |
      of facilitator |
         question #1 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      very effective |         63       56.25       56.25
 extremely effective |         42       37.50       93.75
                   6 |          7        6.25      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm1_3_2

    post-test, module 1, |
   Learner evaluation of |
 facilitator question #2 |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
moderately knowledgeable |          1        0.89        0.89
      very knowledgeable |         48       42.86       43.75
 extremely knowledgeable |         55       49.11       92.86
                       6 |          8        7.14      100.00
-------------------------+-----------------------------------
                   Total |        112      100.00

. tab Pm1_3_3

 post-test, |
  module 1, |
    Learner |
 evaluation |
         of |
facilitator |
question #3 |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        106       94.64       94.64
          3 |          6        5.36      100.00
------------+-----------------------------------
      Total |        112      100.00








. tab Pm1_3_4

 post-test, |
  module 1, |
    Learner |
 evaluation |
         of |
facilitator |
question #4 |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        106       94.64       94.64
          3 |          6        5.36      100.00
------------+-----------------------------------
      Total |        112      100.00

. 
. *post test module 3 Learner evaluation of facilitator
. tab Pm3_3_1

post-test, module 3, |
  Learner evaluation |
      of facilitator |
         question #1 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
moderately effective |          5        4.46        4.46
      very effective |         56       50.00       54.46
 extremely effective |         46       41.07       95.54
                   6 |          5        4.46      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm3_3_2

    post-test, module 3, |
   Learner evaluation of |
 facilitator question #2 |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
not knowledgeable at all |          1        0.89        0.89
moderately knowledgeable |          5        4.46        5.36
      very knowledgeable |         47       41.96       47.32
 extremely knowledgeable |         54       48.21       95.54
                       6 |          5        4.46      100.00
-------------------------+-----------------------------------
                   Total |        112      100.00

. tab Pm3_3_3

 post-test, |
  module 3, |
    Learner |
 evaluation |
         of |
facilitator |
question #3 |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        106       94.64       94.64
          2 |          1        0.89       95.54
          3 |          5        4.46      100.00
------------+-----------------------------------
      Total |        112      100.00

. tab Pm3_3_4

 post-test, |
  module 3, |
    Learner |
 evaluation |
         of |
facilitator |
question #4 |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        106       94.64       94.64
          2 |          1        0.89       95.54
          3 |          5        4.46      100.00
------------+-----------------------------------
      Total |        112      100.00

. 
. *post test module 4 Learner evaluation of facilitator
. tab Pm4_3_1

post-test, module 4, |
  Learner evaluation |
      of facilitator |
         question #1 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
moderately effective |          1        0.89        0.89
      very effective |         56       50.00       50.89
 extremely effective |         45       40.18       91.07
                   6 |         10        8.93      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm4_3_2

    post-test, module 4, |
   Learner evaluation of |
 facilitator question #2 |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
moderately knowledgeable |          1        0.89        0.89
      very knowledgeable |         47       41.96       42.86
 extremely knowledgeable |         54       48.21       91.07
                       6 |         10        8.93      100.00
-------------------------+-----------------------------------
                   Total |        112      100.00

. tab Pm4_3_3

 post-test, |
  module 4, |
    Learner |
 evaluation |
         of |
facilitator |
question #3 |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        101       90.18       90.18
          2 |          1        0.89       91.07
          3 |         10        8.93      100.00
------------+-----------------------------------
      Total |        112      100.00

. tab Pm4_3_4

 post-test, |
  module 4, |
    Learner |
 evaluation |
         of |
facilitator |
question #4 |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        102       91.07       91.07
          3 |         10        8.93      100.00
------------+-----------------------------------
      Total |        112      100.00

. 
. *post test module 17 Learner evaluation of facilitator
. tab Pm17_3_1

   post-test, module |
         17, Learner |
       evaluation of |
facilitator question |
                  #1 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
moderately effective |          2        1.79        1.79
      very effective |         56       50.00       51.79
 extremely effective |         49       43.75       95.54
                   6 |          5        4.46      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm17_3_2

   post-test, module 17, |
   Learner evaluation of |
 facilitator question #2 |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
moderately knowledgeable |          2        1.79        1.79
      very knowledgeable |         49       43.75       45.54
 extremely knowledgeable |         57       50.89       96.43
                       6 |          4        3.57      100.00
-------------------------+-----------------------------------
                   Total |        112      100.00

. tab Pm17_3_3

 post-test, |
 module 17, |
    Learner |
 evaluation |
         of |
facilitator |
question #3 |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        107       95.54       95.54
          2 |          1        0.89       96.43
          3 |          4        3.57      100.00
------------+-----------------------------------
      Total |        112      100.00

. tab Pm17_3_4

 post-test, |
 module 17, |
    Learner |
 evaluation |
         of |
facilitator |
question #4 |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        108       96.43       96.43
          3 |          4        3.57      100.00
------------+-----------------------------------
      Total |        112      100.00

. 
. *Learner evaluation of module
. *post test module 1 Learner evaluation of module
. tab Pm1_4_1

  post-test, module 1, |
 Learner evaluation of |
    module question #1 |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Extremely dissatisfied |          2        1.79        1.79
    Slightly satisfied |         10        8.93       10.71
   Extremely satisfied |         92       82.14       92.86
                     6 |          8        7.14      100.00
-----------------------+-----------------------------------
                 Total |        112      100.00

. tab Pm1_4_2

post-test, module 1, |
  Learner evaluation |
  of module question |
                  #2 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
moderately effective |          1        0.89        0.89
      very effective |         52       46.43       47.32
 extremely effective |         52       46.43       93.75
                   6 |          7        6.25      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm1_4_3

post-test, module 1, |
  Learner evaluation |
  of module question |
                  #3 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
  slightly effective |          2        1.79        1.79
moderately effective |         10        8.93       10.71
      very effective |         60       53.57       64.29
 extremely effective |         32       28.57       92.86
                   6 |          8        7.14      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm1_4_4

post-test, module 1, |
  Learner evaluation |
  of module question |
                  #4 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
  slightly effective |          2        1.79        1.79
moderately effective |          8        7.14        8.93
      very effective |         60       53.57       62.50
 extremely effective |         32       28.57       91.07
                   6 |         10        8.93      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. 
. *post test module 3 Learner evaluation of module
. tab Pm3_4_1

  post-test, module 3, |
 Learner evaluation of |
    module question #1 |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
    Slightly satisfied |         16       14.29       14.29
   Extremely satisfied |         91       81.25       95.54
                     6 |          5        4.46      100.00
-----------------------+-----------------------------------
                 Total |        112      100.00

. tab Pm3_4_2

post-test, module 3, |
  Learner evaluation |
  of module question |
                  #2 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
moderately effective |          2        1.79        1.79
      very effective |         52       46.43       48.21
 extremely effective |         53       47.32       95.54
                   6 |          5        4.46      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm3_4_3

post-test, module 3, |
  Learner evaluation |
  of module question |
                  #3 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
  slightly effective |          1        0.89        0.89
moderately effective |         10        8.93        9.82
      very effective |         56       50.00       59.82
 extremely effective |         39       34.82       94.64
                   6 |          6        5.36      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm3_4_4

post-test, module 3, |
  Learner evaluation |
  of module question |
                  #4 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
  slightly effective |          2        1.79        1.79
moderately effective |         12       10.71       12.50
      very effective |         53       47.32       59.82
 extremely effective |         36       32.14       91.96
                   6 |          9        8.04      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. 
. *post test module 4 Learner evaluation of module
. tab Pm4_4_1

  post-test, module 4, |
 Learner evaluation of |
    module question #1 |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
    Slightly satisfied |         16       14.29       14.29
   Extremely satisfied |         86       76.79       91.07
                     6 |         10        8.93      100.00
-----------------------+-----------------------------------
                 Total |        112      100.00

. tab Pm4_4_2

post-test, module 4, |
  Learner evaluation |
  of module question |
                  #2 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
moderately effective |          2        1.79        1.79
      very effective |         43       38.39       40.18
 extremely effective |         57       50.89       91.07
                   6 |         10        8.93      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm4_4_3

post-test, module 4, |
  Learner evaluation |
  of module question |
                  #3 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
moderately effective |          5        4.46        4.46
      very effective |         52       46.43       50.89
 extremely effective |         44       39.29       90.18
                   6 |         11        9.82      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm4_4_4

post-test, module 4, |
  Learner evaluation |
  of module question |
                  #4 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
  slightly effective |          2        1.79        1.79
moderately effective |          9        8.04        9.82
      very effective |         49       43.75       53.57
 extremely effective |         38       33.93       87.50
                   6 |         14       12.50      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. 
. *post test module 17 Learner evaluation of module
. tab Pm17_4_1

 post-test, module 17, |
 Learner evaluation of |
    module question #1 |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
    Slightly satisfied |         20       17.86       17.86
   Extremely satisfied |         88       78.57       96.43
                     6 |          4        3.57      100.00
-----------------------+-----------------------------------
                 Total |        112      100.00

. tab Pm17_4_2

   post-test, module |
         17, Learner |
evaluation of module |
         question #2 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
moderately effective |          1        0.89        0.89
      very effective |         53       47.32       48.21
 extremely effective |         54       48.21       96.43
                   6 |          4        3.57      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm17_4_3

   post-test, module |
         17, Learner |
evaluation of module |
         question #3 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
  slightly effective |          1        0.89        0.89
moderately effective |          6        5.36        6.25
      very effective |         54       48.21       54.46
 extremely effective |         45       40.18       94.64
                   6 |          6        5.36      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm17_4_4

   post-test, module |
         17, Learner |
evaluation of module |
         question #4 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
  slightly effective |          1        0.89        0.89
moderately effective |          9        8.04        8.93
      very effective |         45       40.18       49.11
 extremely effective |         44       39.29       88.39
                   6 |         13       11.61      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. 
. log close
      name:  <unnamed>
       log:  C:\Users\ronald\Documents\GitHub\chips-analysis\data\chips_toclean.log
  log type:  text
 closed on:  26 Jan 2021, 22:43:26
----------------------------------------------------------------------------------------------------------------------
