----------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\ronald\Documents\GitHub\chips-analysis\data\chips_analysis.log
  log type:  text
 opened on:  25 Jan 2021, 22:24:54

. 
. clear

. 
. cd "C:\Users\ronald\Documents\GitHub\chips-analysis\data"
C:\Users\ronald\Documents\GitHub\chips-analysis\data

. ******************************************************************
. *LOAD LATEST DATA
. use chips_cleaned, clear
(This file contains CHIPS STRIPE HIV data)

. 
. * Data Analysis only for subject with non-missing values *
. keep if m1_total_score~=. & m3_total_score~=. & m4_total_score~=. & m17_total_score~=. & Pm1_total_score~=. & Pm3_to
> tal_score~=. & Pm4_total_score~=. & Pm17_total_score~=.
(94 observations deleted)

. 
. * Create Tables
. *descriptive statistics
. 
. * check out these commands
. *tab m1_total_score, chi2
. 
. *Clinical Site by Profession Category
. *pre-test - total survey
. tab clinical_site profession_category, row nokey

  Partner or Clinical |               Health Profession Category
                 Site | Laborat..    Medical  Nursing..      Other   Pharmacy |     Total
----------------------+-------------------------------------------------------+----------
       Gweru Hospital |         1          3          4          1          0 |         9 
                      |     11.11      33.33      44.44      11.11       0.00 |    100.00 
----------------------+-------------------------------------------------------+----------
      Harare Hospital |         3          2         12          4          0 |        21 
                      |     14.29       9.52      57.14      19.05       0.00 |    100.00 
----------------------+-------------------------------------------------------+----------
      Howard Hospital |         0          4          6          1          0 |        11 
                      |      0.00      36.36      54.55       9.09       0.00 |    100.00 
----------------------+-------------------------------------------------------+----------
       Mpilo Hospital |         0          3          1          1          2 |         7 
                      |      0.00      42.86      14.29      14.29      28.57 |    100.00 
----------------------+-------------------------------------------------------+----------
Parirenyatwa Hospital |         2         28         31          1          0 |        62 
                      |      3.23      45.16      50.00       1.61       0.00 |    100.00 
----------------------+-------------------------------------------------------+----------
              UNKNOWN |         0          1          0          0          1 |         2 
                      |      0.00      50.00       0.00       0.00      50.00 |    100.00 
----------------------+-------------------------------------------------------+----------
                Total |         6         41         54          8          3 |       112 
                      |      5.36      36.61      48.21       7.14       2.68 |    100.00 


. 
. *Clinical Site by Training levels
. *pre-test - total survey
. tab clinical_site training_level, row nokey

  Partner or Clinical |    Training Level
                 Site | Post-gr..  Pre-ser.. |     Total
----------------------+----------------------+----------
       Gweru Hospital |         0          9 |         9 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
      Harare Hospital |         0         21 |        21 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
      Howard Hospital |         0         11 |        11 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
       Mpilo Hospital |         0          7 |         7 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Parirenyatwa Hospital |         0         62 |        62 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
              UNKNOWN |         1          1 |         2 
                      |     50.00      50.00 |    100.00 
----------------------+----------------------+----------
                Total |         1        111 |       112 
                      |      0.89      99.11 |    100.00 


. 
. *Trainne characteristics by gender
. *training_level
. tab training_level gender, row nokey

                      |              Gender
       Training Level |    Female       Male      Other |     Total
----------------------+---------------------------------+----------
Post-graduate
(beyo.. |         1          0          0 |         1 
                      |    100.00       0.00       0.00 |    100.00 
----------------------+---------------------------------+----------
  Pre-service
Student |        57         41         13 |       111 
                      |     51.35      36.94      11.71 |    100.00 
----------------------+---------------------------------+----------
                Total |        58         41         13 |       112 
                      |     51.79      36.61      11.61 |    100.00 


. *clinical_site
. tab clinical_site gender, row nokey

  Partner or Clinical |              Gender
                 Site |    Female       Male      Other |     Total
----------------------+---------------------------------+----------
       Gweru Hospital |         5          4          0 |         9 
                      |     55.56      44.44       0.00 |    100.00 
----------------------+---------------------------------+----------
      Harare Hospital |        14          7          0 |        21 
                      |     66.67      33.33       0.00 |    100.00 
----------------------+---------------------------------+----------
      Howard Hospital |         7          4          0 |        11 
                      |     63.64      36.36       0.00 |    100.00 
----------------------+---------------------------------+----------
       Mpilo Hospital |         3          4          0 |         7 
                      |     42.86      57.14       0.00 |    100.00 
----------------------+---------------------------------+----------
Parirenyatwa Hospital |        27         22         13 |        62 
                      |     43.55      35.48      20.97 |    100.00 
----------------------+---------------------------------+----------
              UNKNOWN |         2          0          0 |         2 
                      |    100.00       0.00       0.00 |    100.00 
----------------------+---------------------------------+----------
                Total |        58         41         13 |       112 
                      |     51.79      36.61      11.61 |    100.00 


. *Profession_categoty
. tab profession_category gender, row nokey

Health Profession |              Gender
         Category |    Female       Male      Other |     Total
------------------+---------------------------------+----------
       Laboratory |         3          3          0 |         6 
                  |     50.00      50.00       0.00 |    100.00 
------------------+---------------------------------+----------
          Medical |        12         21          8 |        41 
                  |     29.27      51.22      19.51 |    100.00 
------------------+---------------------------------+----------
Nursing/midwifery |        38         11          5 |        54 
                  |     70.37      20.37       9.26 |    100.00 
------------------+---------------------------------+----------
            Other |         3          5          0 |         8 
                  |     37.50      62.50       0.00 |    100.00 
------------------+---------------------------------+----------
         Pharmacy |         2          1          0 |         3 
                  |     66.67      33.33       0.00 |    100.00 
------------------+---------------------------------+----------
            Total |        58         41         13 |       112 
                  |     51.79      36.61      11.61 |    100.00 


. 
. 
. *dependent ttest pre post multiple questions
. *Module 1 ttest
. ttest Pm1_total_score=m1_total_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm1_to~e |     112      96.875    .7847613    8.305132    95.31994    98.43006
m1_tot~e |     112    91.74107    1.322252     13.9934    89.12094     94.3612
---------+--------------------------------------------------------------------
    diff |     112    5.133929    1.387194    14.68068    2.385111    7.882746
------------------------------------------------------------------------------
     mean(diff) = mean(Pm1_total_score - m1_total_score)          t =   3.7009
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.9998         Pr(|T| > |t|) = 0.0003          Pr(T > t) = 0.0002

. 
. *Module 3 ttest
. ttest Pm3_total_score=m3_total_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm3_to~e |     112    77.92411    1.668844    17.66138    74.61718    81.23103
m3_tot~e |     112    59.21875      2.2576    23.89219    54.74516    63.69234
---------+--------------------------------------------------------------------
    diff |     112    18.70536    2.173634    23.00358    14.39816    23.01256
------------------------------------------------------------------------------
     mean(diff) = mean(Pm3_total_score - m3_total_score)          t =   8.6056
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. 
. *Module 4 ttest
. ttest Pm4_total_score=m4_total_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm4_to~e |     112        87.5     1.22809    12.99688    85.06646    89.93354
m4_tot~e |     112    79.91071    1.481848    15.68241    76.97433     82.8471
---------+--------------------------------------------------------------------
    diff |     112    7.589286    1.580353    16.72488    4.457711    10.72086
------------------------------------------------------------------------------
     mean(diff) = mean(Pm4_total_score - m4_total_score)          t =   4.8023
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. 
. *Module 17 ttest
. ttest Pm17_total_score=m17_total_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm17_t~e |     112    65.84821    2.242075    23.72789    61.40539    70.29104
m17_to~e |     112    39.28571    2.167252    22.93604    34.99116    43.58027
---------+--------------------------------------------------------------------
    diff |     112     26.5625    2.378846    25.17534    21.84866    31.27634
------------------------------------------------------------------------------
     mean(diff) = mean(Pm17_total_score - m17_total_score)        t =  11.1661
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. 
. *Individual question ttest
. *Module 1 ttest
. ttest Pm1_1_1_score=m1_1_1_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm1_1_.. |     112    .9821429    .0125699    .1330273    .9572348    1.007051
m1_1_1~e |     112    .8482143     .034057    .3604257     .780728    .9157006
---------+--------------------------------------------------------------------
    diff |     112    .1339286    .0347253    .3674979    .0651181     .202739
------------------------------------------------------------------------------
     mean(diff) = mean(Pm1_1_1_score - m1_1_1_score)              t =   3.8568
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.9999         Pr(|T| > |t|) = 0.0002          Pr(T > t) = 0.0001

. ttest Pm1_1_2_score=m1_1_2_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm1_1_.. |     112    .9642857    .0176142    .1864109     .929382    .9991894
m1_1_2~e |     112    .9821429    .0125699    .1330273    .9572348    1.007051
---------+--------------------------------------------------------------------
    diff |     112   -.0178571    .0178571    .1889822   -.0532423     .017528
------------------------------------------------------------------------------
     mean(diff) = mean(Pm1_1_2_score - m1_1_2_score)              t =  -1.0000
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.1597         Pr(|T| > |t|) = 0.3195          Pr(T > t) = 0.8403

. ttest Pm1_1_3_score=m1_1_3_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm1_1_.. |     112    .9464286    .0213722     .226182    .9040781     .988779
m1_1_3~e |     112    .9107143    .0270658    .2864373    .8570816    .9643469
---------+--------------------------------------------------------------------
    diff |     112    .0357143    .0281582    .2979985   -.0200831    .0915117
------------------------------------------------------------------------------
     mean(diff) = mean(Pm1_1_3_score - m1_1_3_score)              t =   1.2683
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.8963         Pr(|T| > |t|) = 0.2073          Pr(T > t) = 0.1037

. ttest Pm1_1_4_score=m1_1_4_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm1_1_.. |     112    .9821429    .0125699    .1330273    .9572348    1.007051
m1_1_4~e |     112    .9285714    .0244446    .2586969    .8801329    .9770099
---------+--------------------------------------------------------------------
    diff |     112    .0535714     .027902    .2952869   -.0017182    .1088611
------------------------------------------------------------------------------
     mean(diff) = mean(Pm1_1_4_score - m1_1_4_score)              t =   1.9200
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.9713         Pr(|T| > |t|) = 0.0574          Pr(T > t) = 0.0287

. 
. *Module 3 ttest
. ttest Pm3_1_1_score=m3_1_1_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm3_1_.. |     112    .9017857    .0282473    .2989417    .8458117    .9577597
m3_1_1~e |     112    .7767857     .039523    .4182723    .6984682    .8551032
---------+--------------------------------------------------------------------
    diff |     112        .125     .036154    .3826178    .0533585    .1966415
------------------------------------------------------------------------------
     mean(diff) = mean(Pm3_1_1_score - m3_1_1_score)              t =   3.4574
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.9996         Pr(|T| > |t|) = 0.0008          Pr(T > t) = 0.0004

. ttest Pm3_1_2_score=m3_1_2_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm3_1_.. |     112    .9732143    .0153248    .1621823    .9428472    1.003581
m3_1_2~e |     112    .8928571     .029357    .3106849    .8346844    .9510299
---------+--------------------------------------------------------------------
    diff |     112    .0803571    .0338879    .3586359     .013206    .1475083
------------------------------------------------------------------------------
     mean(diff) = mean(Pm3_1_2_score - m3_1_2_score)              t =   2.3713
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.9903         Pr(|T| > |t|) = 0.0195          Pr(T > t) = 0.0097

. ttest Pm3_1_3_score=m3_1_3_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm3_1_.. |     112    .6428571    .0454796     .481311    .5527363     .732978
m3_1_3~e |     112    .3839286    .0461614    .4885267    .2924566    .4754005
---------+--------------------------------------------------------------------
    diff |     112    .2589286    .0604913    .6401793    .1390611     .378796
------------------------------------------------------------------------------
     mean(diff) = mean(Pm3_1_3_score - m3_1_3_score)              t =   4.2804
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm3_1_4_1_score=m3_1_4_1_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm3_1_.. |     112     .203125    .0120875    .1279219    .1791728    .2270772
m3_1_4.. |     112    .1272321    .0141792    .1500583    .0991352    .1553291
---------+--------------------------------------------------------------------
    diff |     112    .0758929    .0133929    .1417367     .049354    .1024317
------------------------------------------------------------------------------
     mean(diff) = mean(Pm3_1_4_1_score - m3_1_4_1_score)          t =   5.6667
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm3_1_4_2_score=m3_1_4_2_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm3_1_.. |     112      .21875    .0110414    .1168515    .1968707    .2406293
m3_1_4.. |     112    .1495536    .0139879    .1480345    .1218355    .1772716
---------+--------------------------------------------------------------------
    diff |     112    .0691964    .0127666    .1351085    .0438987    .0944942
------------------------------------------------------------------------------
     mean(diff) = mean(Pm3_1_4_2_score - m3_1_4_2_score)          t =   5.4201
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm3_1_4_3_score=m3_1_4_3_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm3_1_.. |     112    .2209821    .0108673    .1150085    .1994479    .2425164
m3_1_4.. |     112    .1517857     .013951    .1476434    .1241409    .1794305
---------+--------------------------------------------------------------------
    diff |     112    .0691964    .0123665    .1308747    .0446914    .0937015
------------------------------------------------------------------------------
     mean(diff) = mean(Pm3_1_4_3_score - m3_1_4_3_score)          t =   5.5955
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm3_1_4_4_score=m3_1_4_4_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm3_1_.. |     112    .2232143    .0106861     .113091    .2020391    .2443895
m3_1_4.. |     112    .1540179    .0139107    .1472172    .1264528    .1815829
---------+--------------------------------------------------------------------
    diff |     112    .0691964    .0115248    .1219669    .0463593    .0920336
------------------------------------------------------------------------------
     mean(diff) = mean(Pm3_1_4_4_score - m3_1_4_4_score)          t =   6.0041
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm3_1_5_score=m3_1_5_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm3_1_.. |     112    .5357143    .0473367    .5009643    .4419135    .6295151
m3_1_5~e |     112    .3482143    .0452183    .4785455    .2586112    .4378174
---------+--------------------------------------------------------------------
    diff |     112       .1875    .0466566    .4937675    .0950468    .2799532
------------------------------------------------------------------------------
     mean(diff) = mean(Pm3_1_5_score - m3_1_5_score)              t =   4.0187
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.9999         Pr(|T| > |t|) = 0.0001          Pr(T > t) = 0.0001

. 
. *Module 4 ttest
. ttest Pm4_1_1_score=m4_1_1_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm4_1_.. |     112    .9821429    .0125699    .1330273    .9572348    1.007051
m4_1_1~e |     112    .8392857    .0348595    .3689179    .7702094    .9083621
---------+--------------------------------------------------------------------
    diff |     112    .1428571    .0377478    .3994849    .0680574    .2176569
------------------------------------------------------------------------------
     mean(diff) = mean(Pm4_1_1_score - m4_1_1_score)              t =   3.7845
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.9999         Pr(|T| > |t|) = 0.0003          Pr(T > t) = 0.0001

. ttest Pm4_1_2_score=m4_1_2_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm4_1_.. |     112    .9910714    .0089286    .0944911    .9733789    1.008764
m4_1_2~e |     112    .9732143    .0153248    .1621823    .9428472    1.003581
---------+--------------------------------------------------------------------
    diff |     112    .0178571    .0178571    .1889822    -.017528    .0532423
------------------------------------------------------------------------------
     mean(diff) = mean(Pm4_1_2_score - m4_1_2_score)              t =   1.0000
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.8403         Pr(|T| > |t|) = 0.3195          Pr(T > t) = 0.1597

. ttest Pm4_1_3_score=m4_1_3_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm4_1_.. |     112    .9642857    .0176142    .1864109     .929382    .9991894
m4_1_3~e |     112    .9553571    .0196019    .2074466    .9165147    .9941995
---------+--------------------------------------------------------------------
    diff |     112    .0089286    .0200367    .2120486   -.0307755    .0486326
------------------------------------------------------------------------------
     mean(diff) = mean(Pm4_1_3_score - m4_1_3_score)              t =   0.4456
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.6716         Pr(|T| > |t|) = 0.6567          Pr(T > t) = 0.3284

. ttest Pm4_1_4_score=m4_1_4_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm4_1_.. |     112       .5625    .0470857    .4983079    .4691966    .6558034
m4_1_4~e |     112    .4285714    .0469711    .4970958     .335495    .5216479
---------+--------------------------------------------------------------------
    diff |     112    .1339286    .0499284    .5283927    .0349921    .2328651
------------------------------------------------------------------------------
     mean(diff) = mean(Pm4_1_4_score - m4_1_4_score)              t =   2.6824
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.9958         Pr(|T| > |t|) = 0.0084          Pr(T > t) = 0.0042

. 
. *Module 17 ttest
. ttest Pm17_1_1_score=m17_1_1_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm17_1.. |     112    .8482143     .034057    .3604257     .780728    .9157006
m17_1_.. |     112    .4464286    .0471847    .4993561    .3529289    .5399282
---------+--------------------------------------------------------------------
    diff |     112    .4017857    .0544952     .576723    .2937998    .5097716
------------------------------------------------------------------------------
     mean(diff) = mean(Pm17_1_1_score - m17_1_1_score)            t =   7.3729
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm17_1_2_score=m17_1_2_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm17_1.. |     112    .5446429    .0472684    .5002413    .4509775    .6383083
m17_1_.. |     112    .2232143     .039523    .4182723    .1448968    .3015318
---------+--------------------------------------------------------------------
    diff |     112    .3214286    .0510732    .5405084    .2202235    .4226336
------------------------------------------------------------------------------
     mean(diff) = mean(Pm17_1_2_score - m17_1_2_score)            t =   6.2935
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm17_1_3_score=m17_1_3_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm17_1.. |     112    .3839286    .0461614    .4885267    .2924566    .4754005
m17_1_.. |     112    .0535714    .0213722     .226182     .011221    .0959219
---------+--------------------------------------------------------------------
    diff |     112    .3303571    .0481117    .5091663    .2350206    .4256937
------------------------------------------------------------------------------
     mean(diff) = mean(Pm17_1_3_score - m17_1_3_score)            t =   6.8665
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm17_1_4_score=m17_1_4_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm17_1.. |     112    .8571429    .0332136    .3514998    .7913279    .9229578
m17_1_.. |     112    .8482143     .034057    .3604257     .780728    .9157006
---------+--------------------------------------------------------------------
    diff |     112    .0089286    .0390845    .4136312   -.0685199    .0863771
------------------------------------------------------------------------------
     mean(diff) = mean(Pm17_1_4_score - m17_1_4_score)            t =   0.2284
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.5901         Pr(|T| > |t|) = 0.8197          Pr(T > t) = 0.4099

. 
. *Learner evaluation of facilitator
. *post test module 1 Learner evaluation of facilitator
. tab Pm1_3_1 gender, row nokey

post-test, module 1, |
  Learner evaluation |
      of facilitator |              Gender
         question #1 |    Female       Male      Other |     Total
---------------------+---------------------------------+----------
      very effective |        31         25          7 |        63 
                     |     49.21      39.68      11.11 |    100.00 
---------------------+---------------------------------+----------
 extremely effective |        23         13          6 |        42 
                     |     54.76      30.95      14.29 |    100.00 
---------------------+---------------------------------+----------
                   6 |         4          3          0 |         7 
                     |     57.14      42.86       0.00 |    100.00 
---------------------+---------------------------------+----------
               Total |        58         41         13 |       112 
                     |     51.79      36.61      11.61 |    100.00 


. tab Pm1_3_2 gender, row nokey

 post-test, module 1, |
Learner evaluation of |
 facilitator question |              Gender
                   #2 |    Female       Male      Other |     Total
----------------------+---------------------------------+----------
moderately knowledgea |         1          0          0 |         1 
                      |    100.00       0.00       0.00 |    100.00 
----------------------+---------------------------------+----------
   very knowledgeable |        25         18          5 |        48 
                      |     52.08      37.50      10.42 |    100.00 
----------------------+---------------------------------+----------
extremely knowledgeab |        28         19          8 |        55 
                      |     50.91      34.55      14.55 |    100.00 
----------------------+---------------------------------+----------
                    6 |         4          4          0 |         8 
                      |     50.00      50.00       0.00 |    100.00 
----------------------+---------------------------------+----------
                Total |        58         41         13 |       112 
                      |     51.79      36.61      11.61 |    100.00 


. tab Pm1_3_3 gender, row nokey

post-test, |
 module 1, |
   Learner |
evaluation |
        of |
facilitato |
r question |              Gender
        #3 |    Female       Male      Other |     Total
-----------+---------------------------------+----------
       Yes |        55         38         13 |       106 
           |     51.89      35.85      12.26 |    100.00 
-----------+---------------------------------+----------
         3 |         3          3          0 |         6 
           |     50.00      50.00       0.00 |    100.00 
-----------+---------------------------------+----------
     Total |        58         41         13 |       112 
           |     51.79      36.61      11.61 |    100.00 


. tab Pm1_3_4 gender, row nokey

post-test, |
 module 1, |
   Learner |
evaluation |
        of |
facilitato |
r question |              Gender
        #4 |    Female       Male      Other |     Total
-----------+---------------------------------+----------
       Yes |        55         38         13 |       106 
           |     51.89      35.85      12.26 |    100.00 
-----------+---------------------------------+----------
         3 |         3          3          0 |         6 
           |     50.00      50.00       0.00 |    100.00 
-----------+---------------------------------+----------
     Total |        58         41         13 |       112 
           |     51.79      36.61      11.61 |    100.00 


. 
. *post test module 3 Learner evaluation of facilitator
. tab Pm3_3_1

post-test, module 3, |
  Learner evaluation |
      of facilitator |
         question #1 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
moderately effective |          5        4.46        4.46
      very effective |         56       50.00       54.46
 extremely effective |         46       41.07       95.54
                   6 |          5        4.46      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm3_3_2

    post-test, module 3, |
   Learner evaluation of |
 facilitator question #2 |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
not knowledgeable at all |          1        0.89        0.89
moderately knowledgeable |          5        4.46        5.36
      very knowledgeable |         47       41.96       47.32
 extremely knowledgeable |         54       48.21       95.54
                       6 |          5        4.46      100.00
-------------------------+-----------------------------------
                   Total |        112      100.00

. tab Pm3_3_3

 post-test, |
  module 3, |
    Learner |
 evaluation |
         of |
facilitator |
question #3 |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        106       94.64       94.64
          2 |          1        0.89       95.54
          3 |          5        4.46      100.00
------------+-----------------------------------
      Total |        112      100.00

. tab Pm3_3_4

 post-test, |
  module 3, |
    Learner |
 evaluation |
         of |
facilitator |
question #4 |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        106       94.64       94.64
          2 |          1        0.89       95.54
          3 |          5        4.46      100.00
------------+-----------------------------------
      Total |        112      100.00

. 
. *post test module 4 Learner evaluation of facilitator
. tab Pm4_3_1

post-test, module 4, |
  Learner evaluation |
      of facilitator |
         question #1 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
moderately effective |          1        0.89        0.89
      very effective |         56       50.00       50.89
 extremely effective |         45       40.18       91.07
                   6 |         10        8.93      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm4_3_2

    post-test, module 4, |
   Learner evaluation of |
 facilitator question #2 |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
moderately knowledgeable |          1        0.89        0.89
      very knowledgeable |         47       41.96       42.86
 extremely knowledgeable |         54       48.21       91.07
                       6 |         10        8.93      100.00
-------------------------+-----------------------------------
                   Total |        112      100.00

. tab Pm4_3_3

 post-test, |
  module 4, |
    Learner |
 evaluation |
         of |
facilitator |
question #3 |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        101       90.18       90.18
          2 |          1        0.89       91.07
          3 |         10        8.93      100.00
------------+-----------------------------------
      Total |        112      100.00

. tab Pm4_3_4

 post-test, |
  module 4, |
    Learner |
 evaluation |
         of |
facilitator |
question #4 |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        102       91.07       91.07
          3 |         10        8.93      100.00
------------+-----------------------------------
      Total |        112      100.00

. 
. *post test module 17 Learner evaluation of facilitator
. tab Pm17_3_1

   post-test, module |
         17, Learner |
       evaluation of |
facilitator question |
                  #1 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
moderately effective |          2        1.79        1.79
      very effective |         56       50.00       51.79
 extremely effective |         49       43.75       95.54
                   6 |          5        4.46      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm17_3_2

   post-test, module 17, |
   Learner evaluation of |
 facilitator question #2 |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
moderately knowledgeable |          2        1.79        1.79
      very knowledgeable |         49       43.75       45.54
 extremely knowledgeable |         57       50.89       96.43
                       6 |          4        3.57      100.00
-------------------------+-----------------------------------
                   Total |        112      100.00

. tab Pm17_3_3

 post-test, |
 module 17, |
    Learner |
 evaluation |
         of |
facilitator |
question #3 |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        107       95.54       95.54
          2 |          1        0.89       96.43
          3 |          4        3.57      100.00
------------+-----------------------------------
      Total |        112      100.00

. tab Pm17_3_4

 post-test, |
 module 17, |
    Learner |
 evaluation |
         of |
facilitator |
question #4 |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        108       96.43       96.43
          3 |          4        3.57      100.00
------------+-----------------------------------
      Total |        112      100.00

. 
. *Learner evaluation of module
. *post test module 1 Learner evaluation of module
. tab Pm1_4_1

  post-test, module 1, |
 Learner evaluation of |
    module question #1 |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Extremely dissatisfied |          2        1.79        1.79
    Slightly satisfied |         10        8.93       10.71
   Extremely satisfied |         92       82.14       92.86
                     6 |          8        7.14      100.00
-----------------------+-----------------------------------
                 Total |        112      100.00

. tab Pm1_4_2

post-test, module 1, |
  Learner evaluation |
  of module question |
                  #2 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
moderately effective |          1        0.89        0.89
      very effective |         52       46.43       47.32
 extremely effective |         52       46.43       93.75
                   6 |          7        6.25      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm1_4_3

post-test, module 1, |
  Learner evaluation |
  of module question |
                  #3 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
  slightly effective |          2        1.79        1.79
moderately effective |         10        8.93       10.71
      very effective |         60       53.57       64.29
 extremely effective |         32       28.57       92.86
                   6 |          8        7.14      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm1_4_4

post-test, module 1, |
  Learner evaluation |
  of module question |
                  #4 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
  slightly effective |          2        1.79        1.79
moderately effective |          8        7.14        8.93
      very effective |         60       53.57       62.50
 extremely effective |         32       28.57       91.07
                   6 |         10        8.93      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. 
. *post test module 3 Learner evaluation of module
. tab Pm3_4_1

  post-test, module 3, |
 Learner evaluation of |
    module question #1 |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
    Slightly satisfied |         16       14.29       14.29
   Extremely satisfied |         91       81.25       95.54
                     6 |          5        4.46      100.00
-----------------------+-----------------------------------
                 Total |        112      100.00

. tab Pm3_4_2

post-test, module 3, |
  Learner evaluation |
  of module question |
                  #2 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
moderately effective |          2        1.79        1.79
      very effective |         52       46.43       48.21
 extremely effective |         53       47.32       95.54
                   6 |          5        4.46      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm3_4_3

post-test, module 3, |
  Learner evaluation |
  of module question |
                  #3 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
  slightly effective |          1        0.89        0.89
moderately effective |         10        8.93        9.82
      very effective |         56       50.00       59.82
 extremely effective |         39       34.82       94.64
                   6 |          6        5.36      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm3_4_4

post-test, module 3, |
  Learner evaluation |
  of module question |
                  #4 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
  slightly effective |          2        1.79        1.79
moderately effective |         12       10.71       12.50
      very effective |         53       47.32       59.82
 extremely effective |         36       32.14       91.96
                   6 |          9        8.04      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. 
. *post test module 4 Learner evaluation of module
. tab Pm4_4_1

  post-test, module 4, |
 Learner evaluation of |
    module question #1 |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
    Slightly satisfied |         16       14.29       14.29
   Extremely satisfied |         86       76.79       91.07
                     6 |         10        8.93      100.00
-----------------------+-----------------------------------
                 Total |        112      100.00

. tab Pm4_4_2

post-test, module 4, |
  Learner evaluation |
  of module question |
                  #2 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
moderately effective |          2        1.79        1.79
      very effective |         43       38.39       40.18
 extremely effective |         57       50.89       91.07
                   6 |         10        8.93      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm4_4_3

post-test, module 4, |
  Learner evaluation |
  of module question |
                  #3 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
moderately effective |          5        4.46        4.46
      very effective |         52       46.43       50.89
 extremely effective |         44       39.29       90.18
                   6 |         11        9.82      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm4_4_4

post-test, module 4, |
  Learner evaluation |
  of module question |
                  #4 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
  slightly effective |          2        1.79        1.79
moderately effective |          9        8.04        9.82
      very effective |         49       43.75       53.57
 extremely effective |         38       33.93       87.50
                   6 |         14       12.50      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. 
. *post test module 17 Learner evaluation of module
. tab Pm17_4_1

 post-test, module 17, |
 Learner evaluation of |
    module question #1 |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
    Slightly satisfied |         20       17.86       17.86
   Extremely satisfied |         88       78.57       96.43
                     6 |          4        3.57      100.00
-----------------------+-----------------------------------
                 Total |        112      100.00

. tab Pm17_4_2

   post-test, module |
         17, Learner |
evaluation of module |
         question #2 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
moderately effective |          1        0.89        0.89
      very effective |         53       47.32       48.21
 extremely effective |         54       48.21       96.43
                   6 |          4        3.57      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm17_4_3

   post-test, module |
         17, Learner |
evaluation of module |
         question #3 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
  slightly effective |          1        0.89        0.89
moderately effective |          6        5.36        6.25
      very effective |         54       48.21       54.46
 extremely effective |         45       40.18       94.64
                   6 |          6        5.36      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm17_4_4

   post-test, module |
         17, Learner |
evaluation of module |
         question #4 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
  slightly effective |          1        0.89        0.89
moderately effective |          9        8.04        8.93
      very effective |         45       40.18       49.11
 extremely effective |         44       39.29       88.39
                   6 |         13       11.61      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. 
. *Wilcoxon signed ranks tests pre post multiple questions
. *Module 1 Wilcoxon signed ranks tests
. signrank Pm1_total_score=m1_total_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       27        2589      1623.5
    negative |        7         658      1623.5
        zero |       78        3081        3081
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties     -620.50
adjustment for zeros  -40309.75
                     ----------
adjusted variance      77719.75

Ho: Pm1_total_score = m1_total_score
             z =   3.463
    Prob > |z| =   0.0005

. 
. *Module 3 Wilcoxon signed ranks tests
. signrank Pm3_total_score=m3_total_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       74        5365      3001.5
    negative |       13         638      3001.5
        zero |       25         325         325
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties     -229.13
adjustment for zeros   -1381.25
                     ----------
adjusted variance     117039.63

Ho: Pm3_total_score = m3_total_score
             z =   6.909
    Prob > |z| =   0.0000

. 
. *Module 4 Wilcoxon signed ranks tests
. signrank Pm4_total_score=m4_total_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       41        3582      2218.5
    negative |       10         855      2218.5
        zero |       61        1891        1891
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -2303.50
adjustment for zeros  -19382.75
                     ----------
adjusted variance      96963.75

Ho: Pm4_total_score = m4_total_score
             z =   4.379
    Prob > |z| =   0.0000

. 
. *Module 17 Wilcoxon signed ranks tests
. signrank Pm17_total_score=m17_total_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       79        5619        2975
    negative |        6         331        2975
        zero |       27         378         378
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -2687.50
adjustment for zeros   -1732.50
                     ----------
adjusted variance     114230.00

Ho: Pm17_total_score = m17_total_score
             z =   7.823
    Prob > |z| =   0.0000

. 
. *Individual question Wilcoxon signed ranks tests
. *Module 1 Wilcoxon signed ranks tests
. signrank Pm1_1_1_score=m1_1_1_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       16        1664         884
    negative |        1         104         884
        zero |       95        4560        4560
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties     -102.00
adjustment for zeros  -72580.00
                     ----------
adjusted variance      45968.00

Ho: Pm1_1_1_score = m1_1_1_score
             z =   3.638
    Prob > |z| =   0.0003

. signrank Pm1_1_2_score=m1_1_2_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |        1       110.5         221
    negative |        3       331.5         221
        zero |      108        5886        5886
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties       -1.25
adjustment for zeros -106438.50
                     ----------
adjusted variance      12210.25

Ho: Pm1_1_2_score = m1_1_2_score
             z =  -1.000
    Prob > |z| =   0.3173

. signrank Pm1_1_3_score=m1_1_3_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |        7       752.5       537.5
    negative |        3       322.5       537.5
        zero |      102        5253        5253
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties      -20.63
adjustment for zeros  -89738.75
                     ----------
adjusted variance      28890.63

Ho: Pm1_1_3_score = m1_1_3_score
             z =   1.265
    Prob > |z| =   0.2059

. signrank Pm1_1_4_score=m1_1_4_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |        8         860       537.5
    negative |        2         215       537.5
        zero |      102        5253        5253
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties      -20.63
adjustment for zeros  -89738.75
                     ----------
adjusted variance      28890.63

Ho: Pm1_1_4_score = m1_1_4_score
             z =   1.897
    Prob > |z| =   0.0578

. 
. *Module 3 Wilcoxon signed ranks tests
. signrank Pm3_1_1_score=m3_1_1_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       16        1656       931.5
    negative |        2         207       931.5
        zero |       94        4465        4465
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties     -121.13
adjustment for zeros  -70323.75
                     ----------
adjusted variance      48205.13

Ho: Pm3_1_1_score = m3_1_1_score
             z =   3.300
    Prob > |z| =   0.0010

. signrank Pm3_1_2_score=m3_1_2_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       12        1260       787.5
    negative |        3         315       787.5
        zero |       97        4753        4753
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties      -70.00
adjustment for zeros  -77236.25
                     ----------
adjusted variance      41343.75

Ho: Pm3_1_2_score = m3_1_2_score
             z =   2.324
    Prob > |z| =   0.0201

. signrank Pm3_1_3_score=m3_1_3_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       41        3526        2279
    negative |       12        1032        2279
        zero |       59        1770        1770
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -3100.50
adjustment for zeros  -17552.50
                     ----------
adjusted variance      97997.00

Ho: Pm3_1_3_score = m3_1_3_score
             z =   3.983
    Prob > |z| =   0.0001

. signrank Pm3_1_4_1_score=m3_1_4_1_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       40        3580      2058.5
    negative |        6         537      2058.5
        zero |       66        2211        2211
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -2026.88
adjustment for zeros  -24505.25
                     ----------
adjusted variance      92117.88

Ho: Pm3_1_4_1_score = m3_1_4_1_score
             z =   5.013
    Prob > |z| =   0.0000

. signrank Pm3_1_4_2_score=m3_1_4_2_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       36        3312        1886
    negative |        5         460        1886
        zero |       71        2556        2556
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -1435.00
adjustment for zeros  -30459.00
                     ----------
adjusted variance      86756.00

Ho: Pm3_1_4_2_score = m3_1_4_2_score
             z =   4.841
    Prob > |z| =   0.0000

. signrank Pm3_1_4_3_score=m3_1_4_3_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       35        3255      1813.5
    negative |        4         372      1813.5
        zero |       73        2701        2701
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -1235.00
adjustment for zeros  -33087.25
                     ----------
adjusted variance      84327.75

Ho: Pm3_1_4_3_score = m3_1_4_3_score
             z =   4.964
    Prob > |z| =   0.0000

. signrank Pm3_1_4_4_score=m3_1_4_4_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       33        3135      1662.5
    negative |        2         190      1662.5
        zero |       77        3003        3003
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties     -892.50
adjustment for zeros  -38788.75
                     ----------
adjusted variance      78968.75

Ho: Pm3_1_4_4_score = m3_1_4_4_score
             z =   5.240
    Prob > |z| =   0.0000

. signrank Pm3_1_5_score=m3_1_5_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       26        2522      1503.5
    negative |        5         485      1503.5
        zero |       81        3321        3321
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties     -620.00
adjustment for zeros  -45110.25
                     ----------
adjusted variance      72919.75

Ho: Pm3_1_5_score = m3_1_5_score
             z =   3.772
    Prob > |z| =   0.0002

. 
. *Module 4 Wilcoxon signed ranks tests
. signrank Pm4_1_1_score=m4_1_1_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       18        1845        1025
    negative |        2         205        1025
        zero |       92        4278        4278
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties     -166.25
adjustment for zeros  -65952.50
                     ----------
adjusted variance      52531.25

Ho: Pm4_1_1_score = m4_1_1_score
             z =   3.578
    Prob > |z| =   0.0003

. signrank Pm4_1_2_score=m4_1_2_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |        3       331.5         221
    negative |        1       110.5         221
        zero |      108        5886        5886
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties       -1.25
adjustment for zeros -106438.50
                     ----------
adjusted variance      12210.25

Ho: Pm4_1_2_score = m4_1_2_score
             z =   1.000
    Prob > |z| =   0.3173

. signrank Pm4_1_3_score=m4_1_3_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |        3         330         275
    negative |        2         220         275
        zero |      107        5778        5778
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties       -2.50
adjustment for zeros -103522.50
                     ----------
adjusted variance      15125.00

Ho: Pm4_1_3_score = m4_1_3_score
             z =   0.447
    Prob > |z| =   0.6547

. signrank Pm4_1_4_score=m4_1_4_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       24        2304        1584
    negative |        9         864        1584
        zero |       79        3160        3160
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties     -748.00
adjustment for zeros  -41870.00
                     ----------
adjusted variance      76032.00

Ho: Pm4_1_4_score = m4_1_4_score
             z =   2.611
    Prob > |z| =   0.0090

. 
. *Module 17 Wilcoxon signed ranks tests
. signrank Pm17_1_1_score=m17_1_1_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       50        4250      2337.5
    negative |        5         425      2337.5
        zero |       57        1653        1653
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -3465.00
adjustment for zeros  -15841.25
                     ----------
adjusted variance      99343.75

Ho: Pm17_1_1_score = m17_1_1_score
             z =   6.068
    Prob > |z| =   0.0000

. signrank Pm17_1_2_score=m17_1_2_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       40        3620        1991
    negative |        4         362        1991
        zero |       68        2346        2346
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -1773.75
adjustment for zeros  -26783.50
                     ----------
adjusted variance      90092.75

Ho: Pm17_1_2_score = m17_1_2_score
             z =   5.427
    Prob > |z| =   0.0000

. signrank Pm17_1_3_score=m17_1_3_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       39        3588        1886
    negative |        2         184        1886
        zero |       71        2556        2556
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -1435.00
adjustment for zeros  -30459.00
                     ----------
adjusted variance      86756.00

Ho: Pm17_1_3_score = m17_1_3_score
             z =   5.778
    Prob > |z| =   0.0000

. signrank Pm17_1_4_score=m17_1_4_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       10        1030       978.5
    negative |        9         927       978.5
        zero |       93        4371        4371
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties     -142.50
adjustment for zeros  -68114.75
                     ----------
adjusted variance      50392.75

Ho: Pm17_1_4_score = m17_1_4_score
             z =   0.229
    Prob > |z| =   0.8185

. 
. * Learner self conceived competency
. * Module 1 pretest Learner self conceived competency
. tab m1_2_1

 pre-test, module 1, |
  Likert question #1 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          8        7.14        7.14
Somewhat comfortable |         22       19.64       26.79
         Comfortable |         50       44.64       71.43
    Very Comfortable |         26       23.21       94.64
      Not Applicable |          6        5.36      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m1_2_2

 pre-test, module 1, |
  Likert question #2 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          5        4.46        4.46
Somewhat comfortable |         20       17.86       22.32
         Comfortable |         43       38.39       60.71
    Very Comfortable |         39       34.82       95.54
      Not Applicable |          5        4.46      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m1_2_3

 pre-test, module 1, |
  Likert question #3 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          1        0.89        0.89
Somewhat comfortable |         29       25.89       26.79
         Comfortable |         38       33.93       60.71
    Very Comfortable |         41       36.61       97.32
      Not Applicable |          3        2.68      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m1_2_4

 pre-test, module 1, |
  Likert question #4 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          6        5.36        5.36
Somewhat comfortable |         17       15.18       20.54
         Comfortable |         59       52.68       73.21
    Very Comfortable |         26       23.21       96.43
      Not Applicable |          4        3.57      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m1_2_5

 pre-test, module 1, |
  Likert question #5 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |         10        8.93        8.93
Somewhat comfortable |         29       25.89       34.82
         Comfortable |         40       35.71       70.54
    Very Comfortable |         27       24.11       94.64
      Not Applicable |          6        5.36      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m1_2_6

 pre-test, module 1, |
  Likert question #6 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          1        0.89        0.89
Somewhat comfortable |         17       15.18       16.07
         Comfortable |         34       30.36       46.43
    Very Comfortable |         29       25.89       72.32
      Not Applicable |         31       27.68      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m1_2_7

 pre-test, module 1, |
  Likert question #7 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
Somewhat comfortable |          8        7.21        7.21
         Comfortable |         28       25.23       32.43
    Very Comfortable |         11        9.91       42.34
      Not Applicable |         64       57.66      100.00
---------------------+-----------------------------------
               Total |        111      100.00

. 
. * Module 3 pretest Learner self conceived competency
. tab m3_2_1

 pre-test, module 3, |
  Likert question #1 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |         13       11.61       11.61
Somewhat comfortable |         30       26.79       38.39
         Comfortable |         48       42.86       81.25
    Very Comfortable |         19       16.96       98.21
      Not Applicable |          2        1.79      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m3_2_2

 pre-test, module 3, |
  Likert question #2 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |         14       12.50       12.50
Somewhat comfortable |         33       29.46       41.96
         Comfortable |         50       44.64       86.61
    Very Comfortable |         13       11.61       98.21
      Not Applicable |          2        1.79      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m3_2_3

 pre-test, module 3, |
  Likert question #3 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |         12       10.71       10.71
Somewhat comfortable |         32       28.57       39.29
         Comfortable |         46       41.07       80.36
    Very Comfortable |         18       16.07       96.43
      Not Applicable |          4        3.57      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m3_2_4

 pre-test, module 3, |
  Likert question #4 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          7        6.25        6.25
Somewhat comfortable |         28       25.00       31.25
         Comfortable |         46       41.07       72.32
    Very Comfortable |         30       26.79       99.11
      Not Applicable |          1        0.89      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m3_2_5

 pre-test, module 3, |
  Likert question #5 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          2        1.80        1.80
Somewhat comfortable |         20       18.02       19.82
         Comfortable |         36       32.43       52.25
    Very Comfortable |         17       15.32       67.57
      Not Applicable |         36       32.43      100.00
---------------------+-----------------------------------
               Total |        111      100.00

. 
. * Module 4 pretest Learner self conceived competency
. tab m4_2_1

 pre-test, module 4, |
  Likert question #1 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          7        6.25        6.25
Somewhat comfortable |         28       25.00       31.25
         Comfortable |         45       40.18       71.43
    Very Comfortable |         28       25.00       96.43
      Not Applicable |          4        3.57      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m4_2_2

 pre-test, module 4, |
  Likert question #2 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          9        8.04        8.04
Somewhat comfortable |         26       23.21       31.25
         Comfortable |         43       38.39       69.64
    Very Comfortable |         30       26.79       96.43
      Not Applicable |          4        3.57      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m4_2_3

 pre-test, module 4, |
  Likert question #3 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |         13       11.61       11.61
Somewhat comfortable |         29       25.89       37.50
         Comfortable |         38       33.93       71.43
    Very Comfortable |         29       25.89       97.32
      Not Applicable |          3        2.68      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m4_2_4

 pre-test, module 4, |
  Likert question #4 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          2        1.79        1.79
Somewhat comfortable |         14       12.50       14.29
         Comfortable |         48       42.86       57.14
    Very Comfortable |         46       41.07       98.21
      Not Applicable |          2        1.79      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m4_2_5

 pre-test, module 4, |
  Likert question #5 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |         49       43.75       43.75
Somewhat comfortable |         24       21.43       65.18
         Comfortable |         19       16.96       82.14
    Very Comfortable |         13       11.61       93.75
      Not Applicable |          7        6.25      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m4_2_6

 pre-test, module 4, |
  Likert question #6 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          2        1.80        1.80
Somewhat comfortable |         15       13.51       15.32
         Comfortable |         42       37.84       53.15
    Very Comfortable |         16       14.41       67.57
      Not Applicable |         36       32.43      100.00
---------------------+-----------------------------------
               Total |        111      100.00

. 
. * Module 17 pretest Learner self conceived competency
. tab m17_2_2

pre-test, module 17, |
  Likert question #2 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |         13       11.61       11.61
Somewhat comfortable |         36       32.14       43.75
         Comfortable |         39       34.82       78.57
    Very Comfortable |         20       17.86       96.43
      Not Applicable |          4        3.57      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m17_2_3

pre-test, module 17, |
  Likert question #3 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |         20       17.86       17.86
Somewhat comfortable |         38       33.93       51.79
         Comfortable |         30       26.79       78.57
    Very Comfortable |         17       15.18       93.75
      Not Applicable |          7        6.25      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m17_2_4

pre-test, module 17, |
  Likert question #4 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |         11        9.82        9.82
Somewhat comfortable |         25       22.32       32.14
         Comfortable |         38       33.93       66.07
    Very Comfortable |         29       25.89       91.96
      Not Applicable |          9        8.04      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m17_2_5

pre-test, module 17, |
  Likert question #5 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          8        7.14        7.14
Somewhat comfortable |         24       21.43       28.57
         Comfortable |         43       38.39       66.96
    Very Comfortable |         31       27.68       94.64
      Not Applicable |          6        5.36      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. 
. * Module 1 posttest Learner self conceived competency
. tab Pm1_2_1

post-test, module 1, |
  Likert question #1 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          1        0.89        0.89
Somewhat comfortable |          7        6.25        7.14
         Comfortable |         32       28.57       35.71
    Very Comfortable |         70       62.50       98.21
      Not Applicable |          2        1.79      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm1_2_2

post-test, module 1, |
  Likert question #2 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          2        1.79        1.79
Somewhat comfortable |          3        2.68        4.46
         Comfortable |         34       30.36       34.82
    Very Comfortable |         69       61.61       96.43
      Not Applicable |          4        3.57      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm1_2_3

post-test, module 1, |
  Likert question #3 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          3        2.68        2.68
Somewhat comfortable |          4        3.57        6.25
         Comfortable |         30       26.79       33.04
    Very Comfortable |         71       63.39       96.43
      Not Applicable |          4        3.57      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm1_2_4

post-test, module 1, |
  Likert question #4 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          1        0.89        0.89
Somewhat comfortable |          6        5.36        6.25
         Comfortable |         32       28.57       34.82
    Very Comfortable |         71       63.39       98.21
      Not Applicable |          2        1.79      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm1_2_5

post-test, module 1, |
  Likert question #5 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          4        3.57        3.57
Somewhat comfortable |          9        8.04       11.61
         Comfortable |         29       25.89       37.50
    Very Comfortable |         67       59.82       97.32
      Not Applicable |          3        2.68      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm1_2_6

post-test, module 1, |
  Likert question #6 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          3        2.68        2.68
Somewhat comfortable |          3        2.68        5.36
         Comfortable |         24       21.43       26.79
    Very Comfortable |         55       49.11       75.89
      Not Applicable |         27       24.11      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm1_2_7

post-test, module 1, |
  Likert question #7 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
         Comfortable |         29       26.13       26.13
    Very Comfortable |         16       14.41       40.54
      Not Applicable |         66       59.46      100.00
---------------------+-----------------------------------
               Total |        111      100.00

. 
. * Module 3 posttest Learner self conceived competency
. tab Pm3_2_1

post-test, module 3, |
  Likert question #1 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          3        2.68        2.68
Somewhat comfortable |          5        4.46        7.14
         Comfortable |         39       34.82       41.96
    Very Comfortable |         63       56.25       98.21
      Not Applicable |          2        1.79      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm3_2_2

post-test, module 3, |
  Likert question #2 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          1        0.89        0.89
Somewhat comfortable |          9        8.04        8.93
         Comfortable |         35       31.25       40.18
    Very Comfortable |         65       58.04       98.21
      Not Applicable |          2        1.79      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm3_2_3

post-test, module 3, |
  Likert question #3 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          2        1.79        1.79
Somewhat comfortable |          9        8.04        9.82
         Comfortable |         27       24.11       33.93
    Very Comfortable |         72       64.29       98.21
      Not Applicable |          2        1.79      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm3_2_4

post-test, module 3, |
  Likert question #4 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          1        0.89        0.89
Somewhat comfortable |          6        5.36        6.25
         Comfortable |         35       31.25       37.50
    Very Comfortable |         67       59.82       97.32
      Not Applicable |          3        2.68      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm3_2_5

post-test, module 3, |
  Likert question #5 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          2        1.80        1.80
Somewhat comfortable |          1        0.90        2.70
         Comfortable |         41       36.94       39.64
    Very Comfortable |         37       33.33       72.97
      Not Applicable |         30       27.03      100.00
---------------------+-----------------------------------
               Total |        111      100.00

. 
. * Module 4 posttest Learner self conceived competency
. tab Pm4_2_1

post-test, module 4, |
  Likert question #1 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          3        2.68        2.68
Somewhat comfortable |          2        1.79        4.46
         Comfortable |         24       21.43       25.89
    Very Comfortable |         82       73.21       99.11
      Not Applicable |          1        0.89      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm4_2_2

post-test, module 4, |
  Likert question #2 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          1        0.89        0.89
Somewhat comfortable |          6        5.36        6.25
         Comfortable |         31       27.68       33.93
    Very Comfortable |         73       65.18       99.11
      Not Applicable |          1        0.89      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm4_2_3

post-test, module 4, |
  Likert question #3 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          1        0.89        0.89
Somewhat comfortable |          7        6.25        7.14
         Comfortable |         29       25.89       33.04
    Very Comfortable |         74       66.07       99.11
      Not Applicable |          1        0.89      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm4_2_4

post-test, module 4, |
  Likert question #4 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          2        1.79        1.79
Somewhat comfortable |          3        2.68        4.46
         Comfortable |         22       19.64       24.11
    Very Comfortable |         84       75.00       99.11
      Not Applicable |          1        0.89      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm4_2_5

post-test, module 4, |
  Likert question #5 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          1        0.89        0.89
Somewhat comfortable |         10        8.93        9.82
         Comfortable |         31       27.68       37.50
    Very Comfortable |         69       61.61       99.11
      Not Applicable |          1        0.89      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm4_2_6

post-test, module 4, |
  Likert question #6 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
Somewhat comfortable |          2        1.80        1.80
         Comfortable |         43       38.74       40.54
    Very Comfortable |         35       31.53       72.07
      Not Applicable |         31       27.93      100.00
---------------------+-----------------------------------
               Total |        111      100.00

. 
. * Module 17 posttest Learner self conceived competency
. tab Pm17_2_2

   post-test, module |
 17, Likert question |
                  #2 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          2        1.79        1.79
Somewhat comfortable |          8        7.14        8.93
         Comfortable |         30       26.79       35.71
    Very Comfortable |         69       61.61       97.32
      Not Applicable |          3        2.68      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm17_2_3

   post-test, module |
 17, Likert question |
                  #3 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          2        1.79        1.79
Somewhat comfortable |         13       11.61       13.39
         Comfortable |         37       33.04       46.43
    Very Comfortable |         54       48.21       94.64
      Not Applicable |          6        5.36      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm17_2_4

   post-test, module |
 17, Likert question |
                  #4 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          2        1.79        1.79
Somewhat comfortable |         10        8.93       10.71
         Comfortable |         30       26.79       37.50
    Very Comfortable |         66       58.93       96.43
      Not Applicable |          4        3.57      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm17_2_5

   post-test, module |
 17, Likert question |
                  #5 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          2        1.79        1.79
Somewhat comfortable |          2        1.79        3.57
         Comfortable |         31       27.68       31.25
    Very Comfortable |         74       66.07       97.32
      Not Applicable |          3        2.68      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. 
. * Wilcoxon signed ranks tests Learner self conceived competency
. 
. * Wilcoxon signed ranks tests Module 1 posttest Learner self conceived competency
. signrank Pm1_2_1=m1_2_1

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       60        4586        2831
    negative |       16        1076        2831
        zero |       36         666         666
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -3928.25
adjustment for zeros   -4051.50
                     ----------
adjusted variance     110670.25

Ho: Pm1_2_1 = m1_2_1
             z =   5.275
    Prob > |z| =   0.0000

. signrank Pm1_2_2=m17_2_2

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       72        5328        2916
    negative |        9         504        2916
        zero |       31         496         496
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -2744.50
adjustment for zeros   -2604.00
                     ----------
adjusted variance     113301.50

Ho: Pm1_2_2 = m17_2_2
             z =   7.166
    Prob > |z| =   0.0000

. signrank Pm1_2_3=m1_2_3

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       52        4213        2576
    negative |       12         939        2576
        zero |       48        1176        1176
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -2349.00
adjustment for zeros   -9506.00
                     ----------
adjusted variance     106795.00

Ho: Pm1_2_3 = m1_2_3
             z =   5.009
    Prob > |z| =   0.0000

. signrank Pm1_2_4=m1_2_4

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       60      4601.5      2712.5
    negative |       10       823.5      2712.5
        zero |       42         903         903
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -2848.00
adjustment for zeros   -6396.25
                     ----------
adjusted variance     109405.75

Ho: Pm1_2_4 = m1_2_4
             z =   5.711
    Prob > |z| =   0.0000

. signrank Pm1_2_5=m1_2_5

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       58        4499        2754
    negative |       14        1009        2754
        zero |       40         820         820
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -2330.75
adjustment for zeros   -5535.00
                     ----------
adjusted variance     110784.25

Ho: Pm1_2_5 = m1_2_5
             z =   5.243
    Prob > |z| =   0.0000

. signrank Pm1_2_6=m1_2_6

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       39      3295.5        2249
    negative |       13      1202.5        2249
        zero |       60        1830        1830
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -1056.25
adjustment for zeros  -18452.50
                     ----------
adjusted variance      99141.25

Ho: Pm1_2_6 = m1_2_6
             z =   3.324
    Prob > |z| =   0.0009

. signrank Pm1_2_7=m1_2_7

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       19        1854        1323
    negative |        8         792        1323
        zero |       84        3570        3570
-------------+---------------------------------
         all |      111        6216        6216

unadjusted variance   115514.00
adjustment for ties      -78.00
adjustment for zeros  -50277.50
                     ----------
adjusted variance      65158.50

Ho: Pm1_2_7 = m1_2_7
             z =   2.080
    Prob > |z| =   0.0375

. 
. * Wilcoxon signed ranks tests Module 3 posttest Learner self conceived competency
. signrank Pm3_2_1=m3_2_1

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       68        5191        2774
    negative |        5         357        2774
        zero |       39         780         780
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -2746.13
adjustment for zeros   -5135.00
                     ----------
adjusted variance     110768.88

Ho: Pm3_2_1 = m3_2_1
             z =   7.262
    Prob > |z| =   0.0000

. signrank Pm3_2_2=m3_2_2

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       79        5602        2975
    negative |        6         348        2975
        zero |       27         378         378
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -4894.25
adjustment for zeros   -1732.50
                     ----------
adjusted variance     112023.25

Ho: Pm3_2_2 = m3_2_2
             z =   7.849
    Prob > |z| =   0.0000

. signrank Pm3_2_3=m3_2_3

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       72      5274.5        2900
    negative |        8       525.5        2900
        zero |       32         528         528
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -3448.13
adjustment for zeros   -2860.00
                     ----------
adjusted variance     112341.88

Ho: Pm3_2_3 = m3_2_3
             z =   7.084
    Prob > |z| =   0.0000

. signrank Pm3_2_4=m3_2_4

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       61        4792      2646.5
    negative |        6         501      2646.5
        zero |       45        1035        1035
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -1940.50
adjustment for zeros   -7848.75
                     ----------
adjusted variance     108860.75

Ho: Pm3_2_4 = m3_2_4
             z =   6.503
    Prob > |z| =   0.0000

. signrank Pm3_2_5=m3_2_5

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       34        2975      2002.5
    negative |       11        1030      2002.5
        zero |       66        2211        2211
-------------+---------------------------------
         all |      111        6216        6216

unadjusted variance   115514.00
adjustment for ties     -598.12
adjustment for zeros  -24505.25
                     ----------
adjusted variance      90410.63

Ho: Pm3_2_5 = m3_2_5
             z =   3.234
    Prob > |z| =   0.0012

. 
. * Wilcoxon signed ranks tests Module 4 posttest Learner self conceived competency
. signrank Pm4_2_1=m4_2_1

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       63        4887        2754
    negative |        9         621        2754
        zero |       40         820         820
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -2290.13
adjustment for zeros   -5535.00
                     ----------
adjusted variance     110824.88

Ho: Pm4_2_1 = m4_2_1
             z =   6.407
    Prob > |z| =   0.0000

. signrank Pm4_2_2=m4_2_2

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       62        4804      2733.5
    negative |        9         663      2733.5
        zero |       41         861         861
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -2616.38
adjustment for zeros   -5955.25
                     ----------
adjusted variance     110078.38

Ho: Pm4_2_2 = m4_2_2
             z =   6.241
    Prob > |z| =   0.0000

. signrank Pm4_2_3=m4_2_3

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       66        4996        2831
    negative |       10         666        2831
        zero |       36         666         666
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -2354.38
adjustment for zeros   -4051.50
                     ----------
adjusted variance     112244.13

Ho: Pm4_2_3 = m4_2_3
             z =   6.462
    Prob > |z| =   0.0000

. signrank Pm4_2_4=m4_2_4

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       54      4252.5        2600
    negative |       11       947.5        2600
        zero |       47        1128        1128
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -3300.00
adjustment for zeros   -8930.00
                     ----------
adjusted variance     106420.00

Ho: Pm4_2_4 = m4_2_4
             z =   5.066
    Prob > |z| =   0.0000

. signrank Pm4_2_5=m4_2_5

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       81        5663      3048.5
    negative |       10         434      3048.5
        zero |       21         231         231
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -1777.50
adjustment for zeros    -827.75
                     ----------
adjusted variance     116044.75

Ho: Pm4_2_5 = m4_2_5
             z =   7.675
    Prob > |z| =   0.0000

. signrank Pm4_2_6=m4_2_6

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       29        2638        1830
    negative |       11        1022        1830
        zero |       71        2556        2556
-------------+---------------------------------
         all |      111        6216        6216

unadjusted variance   115514.00
adjustment for ties     -393.25
adjustment for zeros  -30459.00
                     ----------
adjusted variance      84661.75

Ho: Pm4_2_6 = m4_2_6
             z =   2.777
    Prob > |z| =   0.0055

. 
. * Wilcoxon signed ranks tests Module 17 posttest Learner self conceived competency
. signrank Pm17_2_2=m17_2_2

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       71        5225        2916
    negative |       10         607        2916
        zero |       31         496         496
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -3019.88
adjustment for zeros   -2604.00
                     ----------
adjusted variance     113026.13

Ho: Pm17_2_2 = m17_2_2
             z =   6.868
    Prob > |z| =   0.0000

. signrank Pm17_2_3=m17_2_3

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       69        5047      2883.5
    negative |       10         720      2883.5
        zero |       33         561         561
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -2057.63
adjustment for zeros   -3132.25
                     ----------
adjusted variance     113460.13

Ho: Pm17_2_3 = m17_2_3
             z =   6.423
    Prob > |z| =   0.0000

. signrank Pm17_2_4=m17_2_4

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       60        4398        2916
    negative |       21        1434        2916
        zero |       31         496         496
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -5238.13
adjustment for zeros   -2604.00
                     ----------
adjusted variance     110807.88

Ho: Pm17_2_4 = m17_2_4
             z =   4.452
    Prob > |z| =   0.0000

. signrank Pm17_2_5=m17_2_5

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       57      4517.5      2733.5
    negative |       14       949.5      2733.5
        zero |       41         861         861
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -2407.50
adjustment for zeros   -5955.25
                     ----------
adjusted variance     110287.25

Ho: Pm17_2_5 = m17_2_5
             z =   5.372
    Prob > |z| =   0.0000

. 
. * Ttest tests Learner self conceived competency
. 
. * Ttest tests Module 1 posttest Learner self conceived competency
. ttest Pm1_2_1=m1_2_1

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm1_2_1 |     112    3.580357    .0642229    .6796713    3.453095    3.707619
  m1_2_1 |     112           3    .0914632     .967955     2.81876     3.18124
---------+--------------------------------------------------------------------
    diff |     112    .5803571    .0962943    1.019083    .3895436    .7711707
------------------------------------------------------------------------------
     mean(diff) = mean(Pm1_2_1 - m1_2_1)                          t =   6.0269
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm1_2_2=m17_2_2

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm1_2_2 |     112       3.625    .0648295    .6860909    3.496536    3.753464
 m17_2_2 |     112    2.696429    .0956244    1.011994    2.506942    2.885915
---------+--------------------------------------------------------------------
    diff |     112    .9285714    .1012425     1.07145    .7279526     1.12919
------------------------------------------------------------------------------
     mean(diff) = mean(Pm1_2_2 - m17_2_2)                         t =   9.1718
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm1_2_3=m1_2_3

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm1_2_3 |     112    3.616071     .069755    .7382172    3.477847    3.754296
  m1_2_3 |     112    3.142857    .0820596     .868437    2.980251    3.305464
---------+--------------------------------------------------------------------
    diff |     112    .4732143    .0905437    .9582249    .2937958    .6526328
------------------------------------------------------------------------------
     mean(diff) = mean(Pm1_2_3 - m1_2_3)                          t =   5.2264
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm1_2_4=m1_2_4

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm1_2_4 |     112    3.598214    .0627294    .6638656    3.473912    3.722517
  m1_2_4 |     112    3.044643    .0815988    .8635605    2.882949    3.206336
---------+--------------------------------------------------------------------
    diff |     112    .5535714    .0930667     .984925    .3691536    .7379892
------------------------------------------------------------------------------
     mean(diff) = mean(Pm1_2_4 - m1_2_4)                          t =   5.9481
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm1_2_5=m1_2_5

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm1_2_5 |     112         3.5    .0781873    .8274568    3.345067    3.654933
  m1_2_5 |     112    2.910714     .097881    1.035875    2.716757    3.104672
---------+--------------------------------------------------------------------
    diff |     112    .5892857    .1034737    1.095063    .3842456    .7943259
------------------------------------------------------------------------------
     mean(diff) = mean(Pm1_2_5 - m1_2_5)                          t =   5.6950
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm1_2_6=m1_2_6

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm1_2_6 |     112    3.892857    .0844746    .8939954    3.725465    4.060249
  m1_2_6 |     112    3.642857    .1013559    1.072651    3.442014    3.843701
---------+--------------------------------------------------------------------
    diff |     112         .25     .086491    .9153348    .0786123    .4213877
------------------------------------------------------------------------------
     mean(diff) = mean(Pm1_2_6 - m1_2_6)                          t =   2.8905
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.9977         Pr(|T| > |t|) = 0.0046          Pr(T > t) = 0.0023

. ttest Pm1_2_7=m1_2_7

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm1_2_7 |     111    4.333333    .0822825    .8668997    4.170269    4.496398
  m1_2_7 |     111     4.18018    .0992999     1.04619    3.983391    4.376969
---------+--------------------------------------------------------------------
    diff |     111    .1531532    .0801291    .8442124   -.0056439    .3119502
------------------------------------------------------------------------------
     mean(diff) = mean(Pm1_2_7 - m1_2_7)                          t =   1.9113
 Ho: mean(diff) = 0                              degrees of freedom =      110

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.9707         Pr(|T| > |t|) = 0.0586          Pr(T > t) = 0.0293

. 
. * Ttest tests Module 3 posttest Learner self conceived competency
. ttest Pm3_2_1=m3_2_1

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm3_2_1 |     112         3.5    .0694713    .7352146    3.362338    3.637662
  m3_2_1 |     112    2.705357    .0893621    .9457195     2.52828    2.882434
---------+--------------------------------------------------------------------
    diff |     112    .7946429    .0889109    .9409444      .61846    .9708257
------------------------------------------------------------------------------
     mean(diff) = mean(Pm3_2_1 - m3_2_1)                          t =   8.9375
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm3_2_2=m3_2_2

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm3_2_2 |     112    3.517857    .0670942    .7100583    3.384906    3.650809
  m3_2_2 |     112    2.607143    .0863581    .9139277    2.436019    2.778267
---------+--------------------------------------------------------------------
    diff |     112    .9107143    .0856063    .9059719    .7410797    1.080349
------------------------------------------------------------------------------
     mean(diff) = mean(Pm3_2_2 - m3_2_2)                          t =  10.6384
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm3_2_3=m3_2_3

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm3_2_3 |     112      3.5625      .07037    .7447262    3.423057    3.701943
  m3_2_3 |     112    2.732143    .0923229    .9770533    2.549199    2.915087
---------+--------------------------------------------------------------------
    diff |     112    .8303571    .0973328    1.030074    .6374856    1.023229
------------------------------------------------------------------------------
     mean(diff) = mean(Pm3_2_3 - m3_2_3)                          t =   8.5311
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm3_2_4=m3_2_4

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm3_2_4 |     112    3.580357    .0642229    .6796713    3.453095    3.707619
  m3_2_4 |     112    2.910714    .0846615    .8959727    2.742952    3.078477
---------+--------------------------------------------------------------------
    diff |     112    .6696429    .0900347    .9528373    .4912332    .8480526
------------------------------------------------------------------------------
     mean(diff) = mean(Pm3_2_4 - m3_2_4)                          t =   7.4376
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm3_2_5=m3_2_5

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm3_2_5 |     111    3.828829    .0857342    .9032655    3.658924    3.998734
  m3_2_5 |     111    3.585586    .1111834     1.17139    3.365246    3.805925
---------+--------------------------------------------------------------------
    diff |     111    .2432432    .0897865      .94596    .0653074    .4211791
------------------------------------------------------------------------------
     mean(diff) = mean(Pm3_2_5 - m3_2_5)                          t =   2.7091
 Ho: mean(diff) = 0                              degrees of freedom =      110

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.9961         Pr(|T| > |t|) = 0.0078          Pr(T > t) = 0.0039

. 
. * Ttest tests Module 4 posttest Learner self conceived competency
. ttest Pm4_2_1=m4_2_1

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm4_2_1 |     112    3.678571    .0624138    .6605251    3.554894    3.802248
  m4_2_1 |     112    2.946429    .0895427    .9476313    2.768994    3.123863
---------+--------------------------------------------------------------------
    diff |     112    .7321429     .099048    1.048226    .5358726    .9284131
------------------------------------------------------------------------------
     mean(diff) = mean(Pm4_2_1 - m4_2_1)                          t =   7.3918
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm4_2_2=m4_2_2

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm4_2_2 |     112    3.598214    .0614337    .6501534    3.476479    3.719949
  m4_2_2 |     112    2.946429    .0930667     .984925    2.762011    3.130846
---------+--------------------------------------------------------------------
    diff |     112    .6517857    .0894264    .9463997    .4745814      .82899
------------------------------------------------------------------------------
     mean(diff) = mean(Pm4_2_2 - m4_2_2)                          t =   7.2885
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm4_2_3=m4_2_3

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm4_2_3 |     112    3.598214    .0627294    .6638656    3.473912    3.722517
  m4_2_3 |     112    2.821429    .0976018     1.03292    2.628024    3.014833
---------+--------------------------------------------------------------------
    diff |     112    .7767857    .0996372    1.054461    .5793479    .9742235
------------------------------------------------------------------------------
     mean(diff) = mean(Pm4_2_3 - m4_2_3)                          t =   7.7961
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm4_2_4=m4_2_4

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm4_2_4 |     112    3.705357    .0590007    .6244045    3.588443    3.822271
  m4_2_4 |     112    3.285714    .0733337    .7760906    3.140399     3.43103
---------+--------------------------------------------------------------------
    diff |     112    .4196429    .0818449    .8661647    .2574618    .5818239
------------------------------------------------------------------------------
     mean(diff) = mean(Pm4_2_4 - m4_2_4)                          t =   5.1273
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm4_2_5=m4_2_5

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm4_2_5 |     112    3.526786    .0670674     .709775    3.393887    3.659684
  m4_2_5 |     112    2.151786    .1204679    1.274913     1.91307    2.390501
---------+--------------------------------------------------------------------
    diff |     112       1.375        .125    1.322876    1.127304    1.622696
------------------------------------------------------------------------------
     mean(diff) = mean(Pm4_2_5 - m4_2_5)                          t =  11.0000
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm4_2_6=m4_2_6

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm4_2_6 |     111    3.855856    .0807894    .8511687     3.69575    4.015961
  m4_2_6 |     111    3.621622    .1071208    1.128588    3.409333     3.83391
---------+--------------------------------------------------------------------
    diff |     111    .2342342    .0895479    .9434459    .0567713    .4116972
------------------------------------------------------------------------------
     mean(diff) = mean(Pm4_2_6 - m4_2_6)                          t =   2.6157
 Ho: mean(diff) = 0                              degrees of freedom =      110

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.9949         Pr(|T| > |t|) = 0.0102          Pr(T > t) = 0.0051

. 
. * Ttest tests Module 17 posttest Learner self conceived competency
. ttest Pm17_2_2=m17_2_2

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm17_2_2 |     112      3.5625      .07037    .7447262    3.423057    3.701943
 m17_2_2 |     112    2.696429    .0956244    1.011994    2.506942    2.885915
---------+--------------------------------------------------------------------
    diff |     112    .8660714    .1018613    1.077999    .6642264    1.067916
------------------------------------------------------------------------------
     mean(diff) = mean(Pm17_2_2 - m17_2_2)                        t =   8.5025
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm17_2_3=m17_2_3

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm17_2_3 |     112      3.4375     .078987    .8359194    3.280982    3.594018
 m17_2_3 |     112    2.580357    .1073538    1.136126    2.367628    2.793086
---------+--------------------------------------------------------------------
    diff |     112    .8571429    .1133447    1.199528    .6325427    1.081743
------------------------------------------------------------------------------
     mean(diff) = mean(Pm17_2_3 - m17_2_3)                        t =   7.5623
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm17_2_4=m17_2_4

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm17_2_4 |     112    3.535714    .0738801    .7818731    3.389316    3.682113
 m17_2_4 |     112           3    .1038202     1.09873    2.794273    3.205727
---------+--------------------------------------------------------------------
    diff |     112    .5357143    .1105216    1.169651    .3167084    .7547202
------------------------------------------------------------------------------
     mean(diff) = mean(Pm17_2_4 - m17_2_4)                        t =   4.8471
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm17_2_5=m17_2_5

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm17_2_5 |     112    3.660714    .0615564    .6514512    3.538736    3.782692
 m17_2_5 |     112    3.026786    .0944569     .999638    2.839613    3.213958
---------+--------------------------------------------------------------------
    diff |     112    .6339286     .103039    1.090463    .4297498    .8381073
------------------------------------------------------------------------------
     mean(diff) = mean(Pm17_2_5 - m17_2_5)                        t =   6.1523
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. 
end of do-file

. ttest m1_total_score == Pm1_total_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
m1_tot~e |     112    91.74107    1.322252     13.9934    89.12094     94.3612
Pm1_to~e |     112      96.875    .7847613    8.305132    95.31994    98.43006
---------+--------------------------------------------------------------------
    diff |     112   -5.133929    1.387194    14.68068   -7.882746   -2.385111
------------------------------------------------------------------------------
     mean(diff) = mean(m1_total_score - Pm1_total_score)          t =  -3.7009
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.0002         Pr(|T| > |t|) = 0.0003          Pr(T > t) = 0.9998

. ttest Pm1_total_score == m1_total_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm1_to~e |     112      96.875    .7847613    8.305132    95.31994    98.43006
m1_tot~e |     112    91.74107    1.322252     13.9934    89.12094     94.3612
---------+--------------------------------------------------------------------
    diff |     112    5.133929    1.387194    14.68068    2.385111    7.882746
------------------------------------------------------------------------------
     mean(diff) = mean(Pm1_total_score - m1_total_score)          t =   3.7009
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.9998         Pr(|T| > |t|) = 0.0003          Pr(T > t) = 0.0002

. esize unpaired Pm1_total_score == m1_total_score, all

Effect size based on mean comparison

                                   Number of obs =    224
---------------------------------------------------------
        Effect Size |   Estimate     [95% Conf. Interval]
--------------------+------------------------------------
          Cohen's d |   .4461837     .1805178    .7108685
         Hedges's g |   .4446743     .1799071    .7084637
    Glass's Delta 1 |   .6181634     .3426723    .8911055
    Glass's Delta 2 |   .3668822     .0997719    .6323932
   Point-Biserial r |   .2186711     .0902942    .3362436
---------------------------------------------------------

. esize unpaired m1_total_score == Pm1_total_score, all

Effect size based on mean comparison

                                   Number of obs =    224
---------------------------------------------------------
        Effect Size |   Estimate     [95% Conf. Interval]
--------------------+------------------------------------
          Cohen's d |  -.4461837    -.7108685   -.1805178
         Hedges's g |  -.4446743    -.7084637   -.1799071
    Glass's Delta 1 |  -.3668822    -.6323932   -.0997719
    Glass's Delta 2 |  -.6181634    -.8911055   -.3426723
   Point-Biserial r |  -.2186711    -.3362436   -.0902942
---------------------------------------------------------

. spearman
(facility ignored because string variable)
(training_level ignored because string variable)
(clinical_site ignored because string variable)
(profession_category ignored because string variable)
(gender ignored because string variable)
(country ignored because string variable)
(m1_1_1 ignored because string variable)
(m1_1_2 ignored because string variable)
(m1_1_3 ignored because string variable)
(m1_1_4 ignored because string variable)
(m3_1_1 ignored because string variable)
(m3_1_2 ignored because string variable)
(m3_1_3 ignored because string variable)
(m3_1_5 ignored because string variable)
(m4_1_1 ignored because string variable)
(m4_1_2 ignored because string variable)
(m4_1_3 ignored because string variable)
(m4_1_4 ignored because string variable)
(m17_1_1 ignored because string variable)
(m17_1_2 ignored because string variable)
(m17_1_3 ignored because string variable)
(m17_1_4 ignored because string variable)
(Pm1_1_1 ignored because string variable)
(Pm1_1_2 ignored because string variable)
(Pm1_1_3 ignored because string variable)
(Pm1_1_4 ignored because string variable)
(Pm1_3_5 ignored because string variable)
(Pm1_4_5 ignored because string variable)
(Pm3_1_1 ignored because string variable)
(Pm3_1_2 ignored because string variable)
(Pm3_1_3 ignored because string variable)
(Pm3_1_5 ignored because string variable)
(Pm3_3_5 ignored because string variable)
(Pm3_4_5 ignored because string variable)
(Pm4_1_1 ignored because string variable)
(Pm4_1_2 ignored because string variable)
(Pm4_1_3 ignored because string variable)
(Pm4_1_4 ignored because string variable)
(Pm4_3_5 ignored because string variable)
(Pm4_4_5 ignored because string variable)
(Pm17_1_1 ignored because string variable)
(Pm17_1_2 ignored because string variable)
(Pm17_1_3 ignored because string variable)
(Pm17_1_4 ignored because string variable)
(Pm17_3_5 ignored because string variable)
(Pm17_4_5 ignored because string variable)
(FINAL_REFLECTIONS_REFLECTION_1 ignored because string variable)
(FINAL_REFLECTIONS_REFLECTION_2 ignored because string variable)
(FINAL_REFLECTIONS_REFLECTION_3 ignored because string variable)
(obs=111)

             |       id form_d~e m1_1_1~e m1_1_3~e m1_1_2~e m1_1_4~e m1_tot~e   m1_2_1   m1_2_2   m1_2_3   m1_2_4
-------------+---------------------------------------------------------------------------------------------------
          id |   1.0000 
   form_date |  -0.0693   1.0000 
m1_1_1_score |   0.1491  -0.0601   1.0000 
m1_1_3_score |   0.0079  -0.0579  -0.0464   1.0000 
m1_1_2_score |  -0.0676  -0.0993  -0.0576  -0.0426   1.0000 
m1_1_4_score |  -0.0272  -0.0761   0.0749   0.1557  -0.0378   1.0000 
m1_total_s~e |   0.0729  -0.1147   0.6685   0.5192   0.1978   0.4951   1.0000 
      m1_2_1 |   0.0362   0.1016  -0.0591   0.0956  -0.0794  -0.1841  -0.0785   1.0000 
      m1_2_2 |   0.0869   0.0755   0.0400   0.0981   0.1106  -0.0919   0.0582   0.5113   1.0000 
      m1_2_3 |   0.0002   0.0230   0.0041   0.0446  -0.0581  -0.1568  -0.0805   0.4277   0.5241   1.0000 
      m1_2_4 |  -0.0280  -0.0396  -0.1222  -0.0621   0.0058  -0.0261  -0.1308   0.3361   0.4395   0.4944   1.0000 
      m1_2_5 |   0.1172  -0.0932   0.0594   0.2235  -0.0881   0.0759   0.1558   0.1861   0.4566   0.3996   0.5033 
      m1_2_6 |  -0.1117   0.1810  -0.3294   0.0102  -0.1096  -0.0575  -0.3071   0.3972   0.2675   0.3909   0.3811 
      m1_2_7 |  -0.2157   0.7804  -0.2177  -0.1137  -0.1117  -0.0905  -0.2843   0.1443   0.1522   0.1302   0.1555 
    m3_1_4_1 |  -0.0894   0.2252  -0.0617  -0.0419  -0.0970  -0.0081  -0.1008   0.2038   0.0130   0.1870   0.1033 
    m3_1_4_2 |  -0.2412   0.3632  -0.1891  -0.0350  -0.0459  -0.2101  -0.2673   0.1563   0.1876   0.1192   0.0837 
    m3_1_4_3 |  -0.1852   0.1736  -0.0883   0.2574  -0.1018   0.0907   0.0822   0.2177   0.0260   0.1305   0.0119 
    m3_1_4_4 |  -0.0882   0.1861  -0.1064  -0.0509  -0.0655  -0.1592  -0.2245   0.2579   0.2042   0.3661   0.1127 
m3_1_1_score |  -0.1138  -0.1084   0.1300  -0.0190   0.0891  -0.0669   0.0792  -0.0623  -0.1024  -0.0437   0.1112 
m3_1_2_score |   0.0978   0.0172   0.0936  -0.0082  -0.0472   0.2395   0.1203  -0.0168   0.1282   0.1923   0.0025 
m3_1_3_score |   0.1867  -0.2638   0.2286   0.0509   0.1057   0.0738   0.2479  -0.0080  -0.0453   0.1186   0.0101 
m3_1_4_1_s~e |   0.1255  -0.1993   0.2062  -0.0142  -0.0061   0.1269   0.2300  -0.1856  -0.2798  -0.2046  -0.1710 
m3_1_4_2_s~e |   0.2054  -0.3258   0.1337   0.0429   0.0185   0.2490   0.2441  -0.1198  -0.1850  -0.0582  -0.0452 
m3_1_4_3_s~e |   0.1303  -0.3158   0.2431   0.1761   0.0210   0.2547   0.4088  -0.1033  -0.2152  -0.1997  -0.2011 
m3_1_4_4_s~e |   0.0040  -0.2100   0.2008   0.1185   0.0235   0.2606   0.3451  -0.2624  -0.2457  -0.2916  -0.0744 
m3_1_5_score |   0.1072  -0.1302   0.0510   0.0998  -0.0422  -0.0868   0.0737  -0.0848  -0.2078  -0.0473  -0.1050 
m3_total_s~e |   0.1774  -0.3158   0.2770   0.0833   0.0405   0.1443   0.3345  -0.1544  -0.2150  -0.0326  -0.0620 
      m3_2_1 |   0.0772   0.0761   0.0355  -0.0483  -0.1252  -0.0673  -0.0917   0.1955   0.5208   0.3952   0.3246 
      m3_2_2 |   0.0879   0.0042   0.0129  -0.0466  -0.0744  -0.1015  -0.0758   0.1317   0.3593   0.3533   0.2398 
      m3_2_3 |  -0.0289   0.0968  -0.0842  -0.0708   0.0367   0.0206  -0.0773   0.1291   0.2839   0.4538   0.3419 
      m3_2_4 |  -0.0144   0.1413  -0.0677  -0.0638  -0.0950  -0.0902  -0.1426   0.2544   0.3460   0.4247   0.2756 
      m3_2_5 |  -0.1738   0.1813  -0.3674  -0.0266  -0.0484  -0.0679  -0.3315   0.2299   0.2885   0.3748   0.4201 
m4_1_1_score |  -0.0481   0.1358  -0.0514   0.0323   0.1242  -0.0281  -0.0068  -0.1546  -0.1370  -0.0709  -0.0137 
m4_1_2_score |  -0.0104  -0.0780   0.0834  -0.0524  -0.0226   0.3832   0.1623  -0.0670  -0.0989  -0.1072   0.0331 
m4_1_3_score |  -0.1586  -0.0976  -0.0924   0.0834  -0.0294  -0.0605  -0.0463  -0.0552  -0.1712  -0.0731  -0.0651 
m4_1_4_score |  -0.0040  -0.0284   0.1187   0.0206   0.1182  -0.1083   0.1249  -0.0339   0.0696   0.0195  -0.1015 
m4_total_s~e |  -0.0788   0.0333   0.0748   0.0462   0.1479  -0.0100   0.1398  -0.1456  -0.0981  -0.0894  -0.1166 
      m4_2_1 |  -0.0542  -0.0985   0.2013   0.0202  -0.0078  -0.0378   0.1062   0.1766   0.3635   0.3463   0.2753 
      m4_2_2 |   0.0112   0.0114   0.0810   0.0036  -0.0044  -0.0125   0.0431   0.2281   0.3621   0.3774   0.2775 
      m4_2_3 |  -0.0258   0.0174   0.0463  -0.1042  -0.0967  -0.0995  -0.0968   0.2246   0.3269   0.2569   0.2311 
      m4_2_4 |  -0.1119   0.0226  -0.1905   0.0905   0.0711  -0.0914  -0.1259   0.1725   0.3484   0.2911   0.2784 
      m4_2_5 |  -0.0692   0.0233  -0.0095  -0.0627  -0.0257  -0.0166  -0.0871   0.2598   0.3199   0.2315   0.1714 
      m4_2_6 |  -0.1505   0.1755  -0.2694   0.0413  -0.0444  -0.0919  -0.2304   0.2079   0.3197   0.3052   0.3223 
m17_1_1_sc~e |   0.0328  -0.1288   0.0833   0.1584  -0.1496   0.0423   0.1058   0.0517   0.0075   0.1744  -0.0333 
m17_1_2_sc~e |   0.1838  -0.1138   0.1694   0.0190   0.0730  -0.0165   0.1464  -0.1585  -0.1689  -0.0911  -0.1780 
m17_1_3_sc~e |   0.1940  -0.1679   0.1017  -0.2031   0.0324  -0.0874  -0.0409  -0.1013   0.0059  -0.1393   0.0285 
m17_1_4_sc~e |   0.1460  -0.1210  -0.0419  -0.0464  -0.0576   0.0749  -0.0069  -0.1305  -0.1477  -0.0590  -0.0937 
m17_total_~e |   0.1993  -0.2153   0.1405   0.0283  -0.0903   0.0302   0.1147  -0.0933  -0.0989   0.0218  -0.1073 
     m17_2_2 |   0.1299  -0.0874   0.2115   0.0477   0.0287  -0.0698   0.1283   0.3793   0.4773   0.3206   0.2264 
     m17_2_3 |  -0.0352   0.1825   0.1426  -0.0813  -0.0722  -0.1226  -0.0275   0.3822   0.3803   0.3863   0.4337 
     m17_2_4 |  -0.0292   0.0211   0.0401  -0.0692  -0.0701  -0.1093  -0.0980   0.2416   0.3472   0.3125   0.3122 
     m17_2_5 |  -0.0043   0.0941  -0.1977   0.1516  -0.0697  -0.1126  -0.1776   0.3192   0.4352   0.4622   0.3566 
completed_~e |        .        .        .        .        .        .        .        .        .        .        . 
Pm1_1_1_sc~e |   0.0782  -0.1628   0.1305  -0.0426  -0.0183  -0.0378   0.0561   0.0839   0.0402   0.1039   0.1026 
Pm1_1_3_sc~e |  -0.0236  -0.1604  -0.1017   0.3422   0.2671   0.2415   0.2328   0.0987   0.0591  -0.0145   0.0319 
Pm1_1_2_sc~e |  -0.0513  -0.0920   0.0520  -0.0608   0.3372  -0.0539   0.0801  -0.0583   0.0430  -0.0207   0.0156 
Pm1_1_4_sc~e |  -0.0254  -0.0169  -0.0576  -0.0426  -0.0183  -0.0378  -0.0856  -0.1991  -0.1887  -0.1452  -0.1153 
Pm1_total_~e |  -0.0237  -0.2329  -0.0109   0.1648   0.3566   0.1040   0.1917  -0.0117   0.0049  -0.0380   0.0254 
     Pm1_2_1 |  -0.0001  -0.1459   0.0375  -0.0967  -0.0917  -0.1058  -0.0749   0.2627   0.3420   0.2862   0.1734 
     Pm1_2_2 |  -0.0595  -0.2161  -0.1501  -0.0451   0.1645  -0.0057  -0.0628   0.1077   0.3643   0.2569   0.3219 
     Pm1_2_3 |   0.0351  -0.1657  -0.0430   0.0977  -0.0817  -0.1044  -0.0374   0.1925   0.2365   0.3063   0.2827 
     Pm1_2_4 |  -0.0466  -0.1598  -0.1278   0.0493  -0.0899  -0.0539  -0.1020   0.1391   0.1815   0.1126   0.2264 
     Pm1_2_5 |   0.0336  -0.2153  -0.1307   0.1431  -0.0939   0.1287   0.0081   0.1401   0.2135   0.2469   0.2372 
     Pm1_2_6 |  -0.1265  -0.0976  -0.2626   0.0778  -0.0103  -0.2057  -0.2435   0.2607   0.1907   0.3483   0.4119 
     Pm1_2_7 |  -0.0451   0.6485  -0.0779  -0.1349  -0.1085  -0.0657  -0.1823   0.1363   0.0103   0.0197   0.0169 
     Pm1_3_1 |   0.0685   0.1853  -0.0431   0.0140  -0.0072  -0.1096  -0.0940  -0.0993   0.1747   0.0642   0.1936 
     Pm1_3_2 |   0.0524   0.0256   0.0044   0.1639  -0.0944  -0.0467   0.0256  -0.1356   0.0553   0.1600   0.1430 
     Pm1_3_3 |  -0.0423   0.1020  -0.1196  -0.0639   0.0324  -0.0874  -0.1824   0.0493   0.1570   0.2615   0.2400 
     Pm1_3_4 |  -0.0423   0.1020  -0.1196  -0.0639   0.0324  -0.0874  -0.1824   0.0493   0.1570   0.2615   0.2400 
     Pm1_4_1 |  -0.0108   0.0519  -0.1540  -0.1746   0.1469  -0.1064  -0.2008  -0.0571   0.0581   0.1924   0.1144 
     Pm1_4_2 |  -0.0071   0.0917  -0.1672   0.0549   0.1347  -0.0085  -0.0783  -0.0910   0.1806   0.0467   0.1894 
     Pm1_4_3 |   0.0225   0.1068  -0.1587  -0.0228   0.1448  -0.1670  -0.1726   0.0983   0.3158   0.2339   0.3282 
     Pm1_4_4 |  -0.1028   0.1633  -0.1005  -0.1009  -0.0339  -0.0943  -0.1905   0.0888   0.3474   0.2027   0.3103 
   Pm3_1_4_1 |  -0.1471   0.2598  -0.0326  -0.0690   0.0294  -0.0219  -0.0527   0.1890   0.1601   0.2812   0.0916 
   Pm3_1_4_2 |  -0.1510   0.1946  -0.1054   0.0408   0.0574  -0.0669  -0.0643   0.1275   0.0624   0.2477   0.1919 
   Pm3_1_4_3 |  -0.0656   0.2296  -0.1248  -0.0266   0.0277  -0.0383  -0.0644   0.0675   0.0118   0.1389   0.0266 
   Pm3_1_4_4 |  -0.1618   0.1945  -0.1453  -0.0695   0.0463   0.0797  -0.0782   0.0215   0.0570   0.1954   0.1342 
Pm3_1_1_sc~e |   0.1092  -0.0969   0.1101  -0.1044  -0.0449  -0.0924  -0.0202  -0.1011  -0.0716   0.0641   0.0257 
Pm3_1_2_sc~e |  -0.0832  -0.0624   0.0834  -0.0524  -0.0226  -0.0464   0.0110  -0.0963  -0.1383  -0.1787   0.1125 
Pm3_1_3_sc~e |   0.0428  -0.0357  -0.1108   0.0915   0.0394   0.1536   0.0326  -0.0443  -0.1479  -0.2166  -0.1354 
Pm3_1_4_1_~e |   0.1851  -0.0949   0.1412  -0.0124  -0.0711  -0.0618   0.0484  -0.0492  -0.0714  -0.2043  -0.1803 
Pm3_1_4_2_~e |   0.1483  -0.1803   0.0970  -0.0464  -0.0576   0.0749   0.0612  -0.1285  -0.0594  -0.2475  -0.1941 
Pm3_1_4_3_~e |   0.1369  -0.2906   0.1816   0.1396  -0.0556  -0.0152   0.1488  -0.0411   0.0372  -0.1751  -0.0829 
Pm3_1_4_4_~e |   0.0962  -0.1834   0.1246   0.0597  -0.0535   0.0936   0.1529  -0.0740  -0.0382  -0.2486  -0.1283 
Pm3_1_5_sc~e |   0.0513  -0.2640   0.1099   0.0256   0.0110   0.0227   0.0949  -0.1591  -0.2387  -0.1070  -0.1929 
Pm3_total_~e |   0.1360  -0.2818   0.1252   0.0451  -0.0131   0.0740   0.1239  -0.1940  -0.2883  -0.2593  -0.2083 
     Pm3_2_1 |   0.0186  -0.1794  -0.0821   0.1110  -0.1075  -0.0744  -0.0453   0.2407   0.2801   0.3421   0.4203 
     Pm3_2_2 |   0.0350  -0.2118  -0.0704   0.0240  -0.1031   0.0592  -0.0417   0.1258   0.2402   0.2394   0.3124 
     Pm3_2_3 |  -0.1080  -0.1407  -0.0730  -0.0237  -0.0895   0.0038  -0.1195   0.1460   0.1803   0.2313   0.2968 
     Pm3_2_4 |   0.0210  -0.1105  -0.1739   0.0152  -0.0947   0.0200  -0.1488   0.0129   0.2635   0.2829   0.2854 
     Pm3_2_5 |  -0.1158   0.1587  -0.1863   0.0416  -0.1063  -0.0598  -0.1907   0.2045   0.1846   0.3337   0.3598 
     Pm3_3_1 |  -0.2258   0.2045  -0.0952   0.0858  -0.0106  -0.0526  -0.0350   0.0325   0.1400  -0.0249   0.1540 
     Pm3_3_2 |  -0.0703   0.0826  -0.0030   0.1252   0.0070   0.0392   0.0583  -0.0477   0.1176  -0.0311   0.0930 
     Pm3_3_3 |  -0.1421   0.0032  -0.0100   0.0752   0.0324  -0.0888  -0.0172   0.1852   0.1263   0.1210   0.2055 
     Pm3_3_4 |  -0.1421   0.0032  -0.0100   0.0752   0.0324  -0.0888  -0.0172   0.1852   0.1263   0.1210   0.2055 
     Pm3_4_1 |  -0.0971   0.1018   0.0814   0.0735  -0.0341  -0.0615   0.0153   0.0351   0.2065   0.1708   0.3028 
     Pm3_4_2 |   0.1133   0.0410   0.0438   0.0463   0.0071  -0.1470  -0.0207  -0.0146   0.0311   0.0346   0.1836 
     Pm3_4_3 |   0.0978   0.1461   0.0484  -0.0754   0.0441  -0.0930  -0.0416   0.0311   0.1968   0.0807   0.2497 
     Pm3_4_4 |   0.0480   0.1817  -0.0641  -0.0323  -0.1826  -0.0915  -0.1427   0.1981   0.1084  -0.0811   0.1436 
Pm4_1_1_sc~e |   0.1163   0.1120   0.1305  -0.0426  -0.0183  -0.0378   0.0561   0.1969   0.0402   0.1039  -0.0807 
Pm4_1_2_sc~e |  -0.0595   0.0089  -0.0405  -0.0300  -0.0129  -0.0266  -0.0602  -0.1149  -0.0990  -0.1022   0.0114 
Pm4_1_3_sc~e |  -0.1991  -0.0060  -0.0822   0.2768  -0.0262   0.1330   0.1813   0.0239  -0.0717  -0.0917  -0.0345 
Pm4_1_4_sc~e |   0.0589  -0.3760   0.1761  -0.0896   0.1524  -0.1074   0.0953  -0.0632  -0.0485  -0.2445  -0.1633 
Pm4_total_~e |   0.0158  -0.3382   0.1728  -0.0310   0.1337  -0.0688   0.1505  -0.0122  -0.0726  -0.2555  -0.1802 
     Pm4_2_1 |  -0.1296  -0.1717  -0.1223   0.0222  -0.0763  -0.0098  -0.1240   0.0917   0.1214   0.1999   0.1695 
     Pm4_2_2 |  -0.0170  -0.1766  -0.1348   0.0246  -0.0931  -0.0583  -0.1494   0.1117   0.2415   0.2803   0.2767 
     Pm4_2_3 |  -0.0125  -0.1939  -0.1776   0.0106   0.0380  -0.0312  -0.1235   0.0444   0.1962   0.2626   0.2497 
     Pm4_2_4 |  -0.1204  -0.1909  -0.1087   0.1037  -0.0725   0.0014  -0.0609   0.1053   0.1735   0.2001   0.2473 
     Pm4_2_5 |   0.0326  -0.1310  -0.1485   0.0153   0.0208   0.0063  -0.0919   0.1066   0.1951   0.2471   0.1935 
     Pm4_2_6 |  -0.0975   0.1733  -0.2103  -0.0135  -0.1054  -0.0819  -0.2302   0.1994   0.1258   0.3360   0.3502 
     Pm4_3_1 |  -0.1443   0.2586  -0.1071  -0.1472   0.0094  -0.1950  -0.2193   0.0841   0.0894   0.0799   0.1374 
     Pm4_3_2 |   0.0618   0.1484  -0.0524  -0.1078   0.0305  -0.0681  -0.1131   0.0080   0.1305   0.1219   0.2133 
     Pm4_3_3 |  -0.0889   0.0680  -0.1885  -0.1081   0.0449  -0.1312  -0.2470   0.1074   0.0671   0.2139   0.2679 
     Pm4_3_4 |  -0.1070   0.0854  -0.1283  -0.1208   0.0426  -0.0340  -0.1963   0.0769   0.0399   0.1910   0.2806 
     Pm4_4_1 |  -0.0710   0.1083  -0.0976  -0.1659   0.1271  -0.0309  -0.1740   0.0492   0.0815   0.1580   0.1933 
     Pm4_4_2 |  -0.0832   0.1341  -0.0433  -0.1008   0.0340  -0.0892  -0.1145  -0.0481   0.0669   0.0811   0.1891 
     Pm4_4_3 |  -0.0299   0.1186   0.0107  -0.0499   0.1131  -0.0249  -0.0162   0.0328   0.1321   0.0703   0.2953 
     Pm4_4_4 |  -0.0918   0.2268  -0.1002  -0.1145   0.0588  -0.0436  -0.1386   0.0566   0.1094   0.0022   0.1248 
Pm17_1_1_s~e |   0.0156  -0.1460   0.0970   0.3030  -0.0576  -0.0218   0.2182  -0.0863  -0.0474  -0.2352  -0.1843 
Pm17_1_2_s~e |   0.1676  -0.2522   0.1601   0.0887   0.1469   0.2324   0.2954  -0.0272  -0.0826  -0.0116  -0.1261 
Pm17_1_3_s~e |  -0.0808  -0.1760  -0.0726  -0.0727  -0.0313  -0.0644  -0.1402   0.0718  -0.1409   0.0271   0.0500 
Pm17_1_4_s~e |   0.0232  -0.1513   0.0391   0.0500  -0.0556   0.0840   0.0790  -0.0894   0.0258  -0.1091   0.0035 
Pm17_total~e |   0.0648  -0.3452   0.0907   0.1234   0.0267   0.1258   0.2007  -0.0296  -0.1394  -0.1278  -0.1076 
    Pm17_2_2 |  -0.0106  -0.2111  -0.0712   0.0331   0.0319  -0.0581  -0.0602   0.0367   0.1175   0.2591   0.2985 
    Pm17_2_3 |   0.0888  -0.0389  -0.0919  -0.1599  -0.1032  -0.0885  -0.2182   0.1171   0.1438   0.3460   0.3874 
    Pm17_2_4 |   0.0263  -0.1946  -0.0836  -0.0161   0.0228  -0.0542  -0.0796   0.0341   0.1661   0.2553   0.3363 
    Pm17_2_5 |  -0.0027  -0.1345  -0.1443  -0.0495  -0.0812  -0.0313  -0.1642   0.0869   0.2179   0.3761   0.2819 
    Pm17_3_1 |  -0.0731   0.1371  -0.1614  -0.0596   0.0000   0.0000  -0.1453   0.1825   0.1402   0.1266   0.1430 
    Pm17_3_2 |   0.0541  -0.0739  -0.0282  -0.0560   0.0155   0.0319  -0.0529  -0.0511   0.0843   0.0701   0.1830 
    Pm17_3_3 |  -0.1599   0.0646  -0.1510  -0.0847   0.0294   0.0605  -0.1379   0.0711  -0.0258   0.1577   0.2657 
    Pm17_3_4 |  -0.2067   0.0468  -0.1862  -0.1080   0.0262   0.0539  -0.1813  -0.0016  -0.1092   0.0917   0.2089 
    Pm17_4_1 |  -0.1046   0.0507  -0.1308  -0.1721   0.1107  -0.0972  -0.2005   0.0407   0.0556   0.0779   0.1162 
    Pm17_4_2 |  -0.1065   0.1383  -0.0980  -0.0738   0.0072   0.0148  -0.0993  -0.1784  -0.1074   0.0702   0.1071 
    Pm17_4_3 |   0.0435   0.1044   0.0443  -0.0065   0.1702   0.0887   0.0984  -0.0848   0.0506   0.0049   0.1175 
    Pm17_4_4 |  -0.0932   0.1266  -0.0852  -0.0200  -0.1583   0.0908  -0.1261   0.1165   0.1097   0.0479   0.2235 
completed_~t |        .        .        .        .        .        .        .        .        .        .        . 

             |   m1_2_5   m1_2_6   m1_2_7 m3_1_4_1 m3_1_4_2 m3_1_4_3 m3_1_4_4 m3_1_1~e m3_1_2~e m3_1_3~e m3_1_4..
-------------+---------------------------------------------------------------------------------------------------
      m1_2_5 |   1.0000 
      m1_2_6 |   0.2700   1.0000 
      m1_2_7 |  -0.0502   0.4905   1.0000 
    m3_1_4_1 |   0.0869   0.2956   0.2784   1.0000 
    m3_1_4_2 |  -0.0547   0.2662   0.4428   0.4296   1.0000 
    m3_1_4_3 |   0.0935   0.2509   0.2102   0.4895   0.3775   1.0000 
    m3_1_4_4 |   0.0528   0.3286   0.3127   0.4373   0.5560   0.5527   1.0000 
m3_1_1_score |   0.1017  -0.0035  -0.0723  -0.1207  -0.2819  -0.1557  -0.2797   1.0000 
m3_1_2_score |   0.0887  -0.0526   0.0611  -0.0377  -0.2764   0.0188  -0.0546  -0.0488   1.0000 
m3_1_3_score |   0.1954  -0.1142  -0.2914   0.0613  -0.4194  -0.0695  -0.2135   0.1094   0.0922   1.0000 
m3_1_4_1_s~e |  -0.0302  -0.3548  -0.3111  -0.0318  -0.6311  -0.1977  -0.5510   0.2132   0.2747   0.5186   1.0000 
m3_1_4_2_s~e |   0.1168  -0.1959  -0.3695  -0.2678  -0.9558  -0.1892  -0.4133   0.2694   0.3403   0.4185   0.6160 
m3_1_4_3_s~e |  -0.0640  -0.2991  -0.4524  -0.4034  -0.7723  -0.0204  -0.5265   0.1927   0.1714   0.3678   0.6002 
m3_1_4_4_s~e |   0.0369  -0.3793  -0.3404  -0.1840  -0.5579  -0.3462  -0.6686   0.3345   0.0605   0.3924   0.6211 
m3_1_5_score |   0.0896  -0.0885  -0.2712  -0.0327  -0.1463  -0.0729  -0.0905  -0.0549  -0.0476   0.0873   0.1276 
m3_total_s~e |   0.1483  -0.2431  -0.4052  -0.1488  -0.7434  -0.2205  -0.4963   0.4481   0.3405   0.6876   0.7213 
      m3_2_1 |   0.4485   0.2833   0.1319   0.0452   0.0403   0.0149   0.0387   0.1388   0.1743   0.1067  -0.0905 
      m3_2_2 |   0.4288   0.2304   0.0461  -0.0724  -0.1043  -0.0208  -0.0017   0.1364   0.1048   0.1595  -0.0102 
      m3_2_3 |   0.3987   0.3214   0.1336   0.0309   0.0699   0.1049   0.0669   0.1911  -0.0338   0.0598  -0.1738 
      m3_2_4 |   0.4050   0.2293   0.1098  -0.0512   0.0499  -0.0685   0.0123   0.1615  -0.0302  -0.0919  -0.1476 
      m3_2_5 |   0.1343   0.7421   0.5665   0.1983   0.2770   0.0926   0.3293   0.0333  -0.0495  -0.1470  -0.3804 
m4_1_1_score |  -0.0802  -0.1028   0.0090   0.0391   0.0654  -0.0333  -0.0318  -0.0032  -0.0745   0.0409   0.0291 
m4_1_2_score |   0.0461  -0.0521  -0.0263  -0.0130  -0.0898   0.0185  -0.1074  -0.0899   0.2998   0.1300   0.0481 
m4_1_3_score |   0.0522   0.0225  -0.0053  -0.1606  -0.2303   0.0691  -0.2168   0.2988   0.0643   0.0799   0.2076 
m4_1_4_score |  -0.0680  -0.0124  -0.1005  -0.0406   0.1305   0.0130  -0.1470  -0.0953  -0.1060  -0.0436  -0.0699 
m4_total_s~e |  -0.0956  -0.0743  -0.0664  -0.0677   0.0375   0.0138  -0.2540   0.0012  -0.0249   0.0273   0.0536 
      m4_2_1 |   0.3751   0.0782   0.0191   0.0475  -0.0186   0.0433   0.0776   0.1612   0.2545   0.0812  -0.0687 
      m4_2_2 |   0.3961   0.2110   0.1060   0.0695  -0.0757   0.0878   0.1094   0.1111   0.2154   0.2178   0.0147 
      m4_2_3 |   0.2618   0.1205   0.0517  -0.0045  -0.0174  -0.0530   0.0364   0.1474   0.1045   0.0666  -0.1095 
      m4_2_4 |   0.3126   0.2683   0.1186  -0.0763  -0.0453  -0.0233   0.0370   0.0792  -0.0457   0.0779  -0.1279 
      m4_2_5 |   0.2628   0.2565   0.0900  -0.1007   0.1299  -0.0296   0.0325   0.1492   0.0162  -0.1368  -0.3001 
      m4_2_6 |   0.1741   0.6582   0.5511   0.0694   0.1525   0.0479   0.2227   0.0969   0.0504  -0.1282  -0.2611 
m17_1_1_sc~e |   0.1168  -0.0240  -0.0816   0.0953  -0.1523  -0.0187   0.0213  -0.0320   0.1986   0.3390   0.2583 
m17_1_2_sc~e |   0.0277  -0.1702  -0.1548   0.0546  -0.2523  -0.0852  -0.1528  -0.0191   0.1183   0.3798   0.3481 
m17_1_3_sc~e |   0.0233  -0.1547  -0.2013  -0.0544  -0.0803  -0.1414  -0.0735  -0.0619   0.0832  -0.1044   0.1703 
m17_1_4_sc~e |  -0.0354  -0.1902  -0.2006  -0.0825  -0.1083  -0.2165  -0.1970  -0.1095  -0.0675   0.0739   0.0559 
m17_total_~e |   0.0837  -0.1972  -0.2384   0.0266  -0.2773  -0.1891  -0.1544  -0.0715   0.1804   0.3805   0.3692 
     m17_2_2 |   0.4332   0.1580  -0.0959  -0.0178  -0.0817   0.0751   0.0717   0.1233   0.1725   0.0965  -0.0320 
     m17_2_3 |   0.3137   0.2691   0.2502   0.1751   0.1138   0.1313   0.1857   0.0989   0.0103   0.0276  -0.1704 
     m17_2_4 |   0.4011   0.3597   0.0913   0.1420   0.1133   0.1237   0.1808   0.1852  -0.1389   0.0556  -0.2132 
     m17_2_5 |   0.4320   0.3929   0.1806   0.0932   0.1736   0.0890   0.2581   0.0028   0.0303  -0.1265  -0.3310 
completed_~e |        .        .        .        .        .        .        .        .        .        .        . 
Pm1_1_1_sc~e |   0.0605  -0.0416  -0.1117   0.0045  -0.0071   0.1125   0.1619  -0.0730  -0.0472  -0.0340  -0.1417 
Pm1_1_3_sc~e |   0.0874   0.1147  -0.1174  -0.1712  -0.2708   0.0299  -0.1260   0.1572   0.0451   0.0222  -0.0108 
Pm1_1_2_sc~e |   0.0959  -0.1079  -0.0628  -0.1868  -0.1243  -0.1453  -0.0935   0.1272   0.0884   0.0512   0.0881 
Pm1_1_4_sc~e |  -0.1233  -0.1753  -0.1117  -0.1986  -0.2048  -0.2060  -0.2071   0.0891  -0.0472   0.1057   0.1295 
Pm1_total_~e |   0.0882  -0.0694  -0.2047  -0.2993  -0.3391  -0.0987  -0.1564   0.1849   0.0425   0.0726   0.0372 
     Pm1_2_1 |   0.2276   0.0939  -0.0474  -0.1097  -0.0339   0.0617   0.1127   0.0253   0.0526   0.0591  -0.1000 
     Pm1_2_2 |   0.3339   0.1474  -0.0943  -0.1259  -0.1071   0.0366   0.0420   0.0993   0.0289   0.0970  -0.0961 
     Pm1_2_3 |   0.2824   0.2036  -0.0269  -0.1423  -0.0815  -0.0431   0.0355   0.1147  -0.0191   0.1948   0.0534 
     Pm1_2_4 |   0.2549   0.1404  -0.0168  -0.0946  -0.0060  -0.0080   0.0331   0.0771  -0.1064   0.1682  -0.0010 
     Pm1_2_5 |   0.3713   0.0911  -0.1622  -0.0509  -0.1994   0.1287   0.0536   0.0322   0.0562   0.2205   0.0551 
     Pm1_2_6 |   0.2188   0.6227   0.1850   0.1631   0.1321   0.2007   0.2307   0.0555  -0.1215  -0.0019  -0.2330 
     Pm1_2_7 |  -0.0503   0.2794   0.6881   0.3835   0.3847   0.2480   0.2725  -0.1738   0.1146  -0.1378  -0.0947 
     Pm1_3_1 |   0.0941   0.2391   0.2991  -0.0127   0.0926   0.0861   0.0465  -0.0276   0.1959   0.0215  -0.1500 
     Pm1_3_2 |   0.1545   0.1789   0.1134   0.0475   0.0128   0.0789  -0.0288  -0.0162   0.0667   0.0641  -0.0314 
     Pm1_3_3 |   0.1949   0.3093   0.1971   0.1646   0.1517   0.0738   0.0651   0.0335   0.0832   0.0599  -0.1487 
     Pm1_3_4 |   0.1949   0.3093   0.1971   0.1646   0.1517   0.0738   0.0651   0.0335   0.0832   0.0599  -0.1487 
     Pm1_4_1 |   0.0651   0.2340   0.1001   0.1964   0.1163   0.0821   0.1114  -0.0493   0.0359  -0.0277  -0.1775 
     Pm1_4_2 |   0.1804   0.2804   0.1767  -0.0566   0.1210   0.0422   0.0284   0.0493   0.1377   0.0149  -0.1064 
     Pm1_4_3 |   0.3029   0.2592   0.1767  -0.0099   0.0831   0.0428   0.0470  -0.0420  -0.0700  -0.0426  -0.1797 
     Pm1_4_4 |   0.2387   0.2834   0.3557   0.0796   0.2507   0.1071   0.1255   0.0022   0.0040  -0.0612  -0.2363 
   Pm3_1_4_1 |   0.0339   0.1063   0.2679   0.2075   0.2791   0.2022   0.1786  -0.1301   0.1259   0.0439  -0.1241 
   Pm3_1_4_2 |  -0.0342   0.0911   0.2897   0.3498   0.3385   0.3905   0.3823  -0.0177  -0.0130  -0.0810  -0.1677 
   Pm3_1_4_3 |  -0.0986   0.0003   0.2154   0.1584   0.2452   0.3001   0.2557  -0.0132   0.0639  -0.1540  -0.0942 
   Pm3_1_4_4 |   0.0761   0.0396   0.1871   0.2138   0.2991   0.3396   0.3169  -0.0096   0.0320  -0.1538  -0.2252 
Pm3_1_1_sc~e |  -0.0010  -0.1034  -0.1338   0.0301  -0.0702  -0.0933   0.1367   0.4708  -0.0184   0.0723   0.0756 
Pm3_1_2_sc~e |   0.1409  -0.1078  -0.0263  -0.0703  -0.1893  -0.0942  -0.2236   0.3091  -0.0580  -0.0991   0.1593 
Pm3_1_3_sc~e |  -0.0747  -0.0631  -0.0194   0.1038  -0.0496   0.1545   0.0073  -0.0453   0.1013   0.1213   0.1164 
Pm3_1_4_1_~e |  -0.0438  -0.1720  -0.1417  -0.1918  -0.2435  -0.2720  -0.2873  -0.0212   0.0286   0.0939   0.2392 
Pm3_1_4_2_~e |   0.0394  -0.0963  -0.2849  -0.3450  -0.3213  -0.3704  -0.3680   0.0103   0.0131   0.0739   0.1561 
Pm3_1_4_3_~e |   0.0279  -0.0697  -0.2871  -0.3546  -0.3197  -0.3928  -0.3593   0.0243   0.0223   0.1086   0.1869 
Pm3_1_4_4_~e |   0.0009  -0.1057  -0.2206  -0.2511  -0.3055  -0.2322  -0.3404  -0.0239  -0.0528   0.0911   0.2723 
Pm3_1_5_sc~e |  -0.0905  -0.2024  -0.3283  -0.0030  -0.1980  -0.1640  -0.1789  -0.0211   0.0283   0.1975   0.2661 
Pm3_total_~e |  -0.0711  -0.2445  -0.3191  -0.0385  -0.3097  -0.1714  -0.2299   0.1756   0.0780   0.2470   0.3521 
     Pm3_2_1 |   0.4583   0.1867  -0.0480  -0.0806  -0.0697   0.0478   0.0245   0.1419  -0.0241   0.1229   0.0073 
     Pm3_2_2 |   0.3834   0.2414   0.0070  -0.0855  -0.1381  -0.0134   0.0194   0.1860  -0.0504   0.1454   0.0217 
     Pm3_2_3 |   0.3989   0.2096  -0.0587  -0.0810  -0.0127   0.0031   0.0142   0.2093  -0.1975   0.1271  -0.1128 
     Pm3_2_4 |   0.3654   0.2554   0.0858  -0.0889  -0.0150   0.0687   0.0941   0.0734  -0.0691   0.0533  -0.1328 
     Pm3_2_5 |   0.1982   0.6211   0.4642   0.3105   0.2868   0.1678   0.3618  -0.0534   0.0153  -0.0620  -0.1796 
     Pm3_3_1 |   0.1134   0.1281   0.3151   0.1106   0.2607   0.1598   0.1270  -0.0423  -0.0479  -0.0458  -0.1557 
     Pm3_3_2 |   0.1307   0.1211   0.1486   0.1178   0.2207   0.1902   0.1686  -0.0500  -0.0567  -0.0084  -0.1619 
     Pm3_3_3 |   0.1699   0.2724   0.1210   0.2933   0.2722   0.3050   0.2859   0.0326   0.0832  -0.0252  -0.1523 
     Pm3_3_4 |   0.1699   0.2724   0.1210   0.2933   0.2722   0.3050   0.2859   0.0326   0.0832  -0.0252  -0.1523 
     Pm3_4_1 |   0.2707   0.2189   0.2275   0.3216   0.2844   0.1170   0.1053   0.0267  -0.0173   0.0115  -0.1095 
     Pm3_4_2 |   0.2537   0.0731   0.1525   0.1203   0.0642   0.0687   0.0258  -0.0128   0.1768   0.2143   0.1134 
     Pm3_4_3 |   0.2208   0.1513   0.2169   0.1273   0.0813   0.1074  -0.0068   0.0351   0.1416   0.0871   0.0052 
     Pm3_4_4 |   0.1086   0.2370   0.2511   0.2307   0.1663   0.2530   0.1662   0.0076   0.0142  -0.0867   0.0070 
Pm4_1_1_sc~e |  -0.0473   0.0241   0.1129   0.0835   0.1130   0.0924   0.0762  -0.0730   0.1710   0.1057  -0.0061 
Pm4_1_2_sc~e |  -0.0108  -0.1234  -0.0786  -0.1398  -0.1442  -0.1450  -0.1458   0.1768  -0.0332   0.0744   0.0911 
Pm4_1_3_sc~e |   0.0888   0.0407   0.0339  -0.0016  -0.0966   0.3127  -0.1402   0.1272   0.2440   0.1508   0.1848 
Pm4_1_4_sc~e |  -0.1091  -0.2095  -0.4199  -0.0278  -0.0050  -0.0679  -0.1091  -0.0450  -0.1927   0.0576   0.0144 
Pm4_total_~e |  -0.0782  -0.1956  -0.3767  -0.0426  -0.0451   0.0337  -0.1570   0.0213  -0.0573   0.1466   0.0890 
     Pm4_2_1 |   0.2049   0.0942  -0.0384  -0.0787  -0.0605  -0.0195   0.1521   0.1198  -0.0450   0.0355  -0.0555 
     Pm4_2_2 |   0.3010   0.1819   0.0281  -0.0528  -0.0104   0.0581   0.1733   0.0689   0.0226   0.1326  -0.0235 
     Pm4_2_3 |   0.2219   0.1441  -0.0037  -0.1876  -0.1214  -0.0200   0.1021   0.1298   0.0423   0.0750  -0.0586 
     Pm4_2_4 |   0.2218   0.1906  -0.0684  -0.0522   0.0676   0.0513   0.1501   0.0604  -0.1864  -0.0031  -0.1512 
     Pm4_2_5 |   0.2197   0.2132  -0.0074  -0.1495   0.0168  -0.0703   0.0920   0.0845  -0.0073   0.0050  -0.1462 
     Pm4_2_6 |   0.1387   0.5701   0.4517   0.3430   0.2705   0.2189   0.3781   0.0325   0.0173  -0.1024  -0.1636 
     Pm4_3_1 |  -0.0244   0.1529   0.3057   0.1870   0.2390   0.1709   0.2192  -0.0803   0.0241  -0.0332  -0.1759 
     Pm4_3_2 |   0.1660   0.2173   0.1998   0.1609   0.0645   0.2029   0.2329  -0.0437   0.1019   0.0469  -0.1171 
     Pm4_3_3 |   0.1460   0.3749   0.2185   0.1900   0.1515   0.1941   0.3148  -0.1053   0.1154  -0.0705  -0.2560 
     Pm4_3_4 |   0.1478   0.4072   0.2595   0.2306   0.1805   0.2013   0.3058  -0.0563   0.1095  -0.0509  -0.2378 
     Pm4_4_1 |   0.1294   0.3367   0.2654   0.2372   0.2130   0.0967   0.1900  -0.1519   0.0177   0.0521  -0.1503 
     Pm4_4_2 |   0.1127   0.1404   0.2399   0.0697   0.2127   0.1932   0.1627  -0.0310   0.0377  -0.0019  -0.1701 
     Pm4_4_3 |   0.2292   0.2722   0.2182   0.1105   0.1361   0.2364   0.1236   0.0066   0.0559   0.0434  -0.1159 
     Pm4_4_4 |   0.0983   0.2675   0.3053   0.2054   0.2199   0.3016   0.2783  -0.0457   0.0828  -0.1169  -0.2017 
Pm17_1_1_s~e |   0.0362  -0.2800  -0.3007  -0.1283  -0.0722   0.0341  -0.2462   0.0103  -0.1481   0.1255   0.2563 
Pm17_1_2_s~e |   0.0691  -0.2076  -0.2436  -0.1108  -0.3296  -0.0082  -0.1411   0.0222   0.1448   0.4211   0.2299 
Pm17_1_3_s~e |  -0.0718   0.1095   0.0075   0.2243   0.0383   0.0527   0.0790  -0.0582   0.0982  -0.0103   0.0173 
Pm17_1_4_s~e |   0.1263  -0.1203  -0.2021  -0.0333   0.0548  -0.0233  -0.1204  -0.1599  -0.1429   0.0557   0.0328 
Pm17_total~e |   0.0530  -0.2002  -0.3190  -0.0106  -0.1933   0.0274  -0.1707  -0.0467   0.0314   0.2969   0.2578 
    Pm17_2_2 |   0.3252   0.0910  -0.1433  -0.2626  -0.1880  -0.1696  -0.0733   0.1032   0.0373   0.2811   0.0310 
    Pm17_2_3 |   0.3053   0.2444   0.0930   0.0318  -0.0603  -0.0632   0.0936   0.0402   0.0187   0.1306  -0.0177 
    Pm17_2_4 |   0.3687   0.1629  -0.0424  -0.1544  -0.1519  -0.0490  -0.0263   0.0797   0.0021   0.1688  -0.0443 
    Pm17_2_5 |   0.2140   0.2293   0.0286  -0.1095  -0.0014  -0.0569   0.0489  -0.1289   0.0739   0.1225  -0.1277 
    Pm17_3_1 |   0.0561   0.1332   0.2310  -0.0200   0.0407   0.0261   0.1562  -0.0998   0.1058   0.0329  -0.1183 
    Pm17_3_2 |   0.1235   0.0727   0.0222  -0.0746  -0.1042  -0.0623  -0.0171  -0.0445   0.0399   0.1369  -0.0086 
    Pm17_3_3 |   0.1099   0.2810   0.1791   0.1796   0.1227   0.1372   0.2042  -0.0927   0.0756   0.0073  -0.2076 
    Pm17_3_4 |   0.0424   0.2502   0.1594   0.1304   0.0655   0.0811   0.1546  -0.1272   0.0673  -0.0512  -0.1848 
    Pm17_4_1 |   0.0215   0.1367   0.1316   0.1245   0.1447   0.0344   0.0974  -0.1227   0.0139   0.0057  -0.1293 
    Pm17_4_2 |   0.0919   0.0407   0.2352   0.1162   0.0522   0.1237   0.1114   0.0053   0.1269   0.0986   0.0503 
    Pm17_4_3 |   0.1867   0.0381   0.0998   0.0320  -0.0113   0.1118  -0.0305  -0.0523   0.1443   0.1176   0.0276 
    Pm17_4_4 |   0.2204   0.2633   0.2254   0.0429   0.0914   0.1551   0.0899   0.0677   0.1386  -0.0850  -0.1090 
completed_~t |        .        .        .        .        .        .        .        .        .        .        . 

             | m3_1_4.. m3_1_4.. m3_1_4.. m3_1_5~e m3_tot~e   m3_2_1   m3_2_2   m3_2_3   m3_2_4   m3_2_5 m4_1_1~e
-------------+---------------------------------------------------------------------------------------------------
m3_1_4_2_s~e |   1.0000 
m3_1_4_3_s~e |   0.7241   1.0000 
m3_1_4_4_s~e |   0.4839   0.5005   1.0000 
m3_1_5_score |   0.1472   0.1724   0.1211   1.0000 
m3_total_s~e |   0.7361   0.6522   0.6401   0.4340   1.0000 
      m3_2_1 |   0.0000  -0.1084  -0.0063  -0.0807   0.0651   1.0000 
      m3_2_2 |   0.1141   0.0510   0.0636   0.0075   0.1465   0.6201   1.0000 
      m3_2_3 |  -0.0295  -0.1092  -0.1006   0.0369   0.0370   0.4886   0.5368   1.0000 
      m3_2_4 |  -0.0342  -0.1197  -0.0431  -0.0037  -0.0427   0.5967   0.5837   0.5903   1.0000 
      m3_2_5 |  -0.2228  -0.3748  -0.3527  -0.3005  -0.3270   0.1570   0.1910   0.2055   0.1620   1.0000 
m4_1_1_score |  -0.0880  -0.0307   0.1260   0.0678   0.0312  -0.0674  -0.1631  -0.1031  -0.1754  -0.1338   1.0000 
m4_1_2_score |   0.0788   0.0820   0.0853  -0.1101   0.1050  -0.0633  -0.2062  -0.0602  -0.1512  -0.0117   0.0774 
m4_1_3_score |   0.2488   0.2534   0.1700  -0.1131   0.2025   0.0072   0.0658   0.0884   0.0057  -0.0028  -0.0955 
m4_1_4_score |  -0.1558   0.0487  -0.0778   0.1575  -0.0361   0.0240   0.0118   0.0445   0.0999  -0.0396  -0.0107 
m4_total_s~e |  -0.0703   0.1348   0.1028   0.0848   0.0790  -0.0231  -0.0882   0.0059  -0.0388  -0.1167   0.5183 
      m4_2_1 |   0.0591  -0.0144  -0.0264   0.0220   0.1344   0.3545   0.4245   0.2743   0.3068   0.0495  -0.3011 
      m4_2_2 |   0.1359  -0.0411  -0.0060   0.0451   0.1820   0.4744   0.4866   0.4446   0.2746   0.1463  -0.1743 
      m4_2_3 |   0.0413  -0.0485   0.0030  -0.0233   0.0620   0.5574   0.5274   0.4279   0.5538   0.0872  -0.1246 
      m4_2_4 |   0.0572  -0.0719   0.0288  -0.0642  -0.0171   0.3994   0.4609   0.3800   0.4269   0.2747  -0.0897 
      m4_2_5 |  -0.1528  -0.0964  -0.1979  -0.0227  -0.1048   0.4096   0.4676   0.4137   0.4661   0.1980  -0.1401 
      m4_2_6 |  -0.1195  -0.2959  -0.2362  -0.2874  -0.2260   0.1796   0.2151   0.2123   0.0940   0.8394  -0.1679 
m17_1_1_sc~e |   0.1689   0.0429   0.1735   0.0543   0.2689   0.1154   0.1917   0.0957   0.0033  -0.0603  -0.1912 
m17_1_2_sc~e |   0.2530   0.2002   0.2785   0.0549   0.3264  -0.0417   0.0610  -0.0577  -0.1491  -0.2145   0.0617 
m17_1_3_sc~e |   0.0478   0.0436  -0.0415   0.1579   0.0571   0.0395   0.0073  -0.0647  -0.0283  -0.2654   0.1052 
m17_1_4_sc~e |   0.0832   0.0406   0.0993   0.1034   0.0583  -0.1140  -0.0300  -0.0300   0.0384  -0.2800   0.0844 
m17_total_~e |   0.2682   0.1383   0.2524   0.1211   0.3475   0.0229   0.1299   0.0058  -0.0408  -0.2961  -0.0416 
     m17_2_2 |   0.0927   0.1215  -0.0813  -0.0692   0.0981   0.4481   0.3959   0.3286   0.3841  -0.0638  -0.2420 
     m17_2_3 |  -0.0784  -0.0689  -0.0653  -0.2204  -0.0792   0.3626   0.4821   0.3864   0.3844   0.2433  -0.0351 
     m17_2_4 |  -0.0803  -0.0973  -0.1491  -0.0250  -0.0367   0.4514   0.5523   0.4773   0.4555   0.2517  -0.1735 
     m17_2_5 |  -0.1336  -0.2435  -0.1756  -0.1291  -0.2051   0.4624   0.3991   0.4193   0.5846   0.3265  -0.0395 
completed_~e |        .        .        .        .        .        .        .        .        .        .        . 
Pm1_1_1_sc~e |   0.0185   0.0210   0.0235  -0.0422  -0.0587  -0.0514  -0.0744  -0.0489  -0.0112  -0.0484  -0.0596 
Pm1_1_3_sc~e |   0.2739   0.2789   0.2033  -0.0744   0.0985  -0.0750  -0.0212  -0.1184  -0.0697   0.1243   0.0029 
Pm1_1_2_sc~e |   0.1239   0.0300   0.0336  -0.0602   0.0936   0.0511   0.0652  -0.0087   0.0431  -0.0691  -0.0851 
Pm1_1_4_sc~e |   0.1552   0.1581   0.1610   0.0997   0.1771  -0.0604  -0.0665  -0.0578  -0.0950  -0.1651   0.1242 
Pm1_total_~e |   0.3257   0.2786   0.2313  -0.0615   0.1671  -0.0672  -0.0343  -0.1283  -0.0658  -0.0397  -0.0199 
     Pm1_2_1 |   0.0379   0.0377  -0.0880  -0.0173   0.0227   0.2514   0.2545   0.2140   0.2138  -0.0219  -0.0532 
     Pm1_2_2 |   0.1134   0.0539   0.0457  -0.1293   0.0371   0.2504   0.3186   0.2408   0.2275   0.1067  -0.0850 
     Pm1_2_3 |   0.0774   0.0416   0.0551   0.0983   0.1672   0.2489   0.2653   0.2507   0.2071   0.0634   0.0362 
     Pm1_2_4 |  -0.0047  -0.0393   0.0539   0.0115   0.0729   0.1993   0.2242   0.1205   0.0803   0.0520  -0.0915 
     Pm1_2_5 |   0.2326   0.1678   0.1010   0.0251   0.1811   0.2609   0.2238   0.1708   0.1911  -0.0205  -0.0486 
     Pm1_2_6 |  -0.0835  -0.1914  -0.1514  -0.0486  -0.1249   0.1758   0.1490   0.1784   0.0520   0.5229   0.0592 
     Pm1_2_7 |  -0.3051  -0.3738  -0.1803  -0.1028  -0.2504   0.0657  -0.0466   0.0904   0.0069   0.2260   0.0665 
     Pm1_3_1 |  -0.0921  -0.0567  -0.1244  -0.2223  -0.0810   0.2618   0.1555   0.1518   0.1018   0.2111  -0.0234 
     Pm1_3_2 |  -0.0295   0.0432   0.0762  -0.0907   0.0128   0.1656   0.1603   0.1609   0.0880   0.1690   0.0179 
     Pm1_3_3 |  -0.1130  -0.1983  -0.1224  -0.1759  -0.0784   0.2341   0.0716   0.1739   0.0407   0.2913   0.1052 
     Pm1_3_4 |  -0.1130  -0.1983  -0.1224  -0.1759  -0.0784   0.2341   0.0716   0.1739   0.0407   0.2913   0.1052 
     Pm1_4_1 |  -0.0772  -0.1607  -0.2034  -0.1144  -0.1355  -0.0145  -0.0172   0.1548  -0.0662   0.2153   0.1316 
     Pm1_4_2 |  -0.1063  -0.1431  -0.1104  -0.1554  -0.0754   0.2225   0.1244   0.1772   0.0314   0.2105  -0.0456 
     Pm1_4_3 |  -0.0702  -0.0912  -0.2368  -0.1308  -0.1779   0.2773   0.2500   0.3702   0.2439   0.2106  -0.0725 
     Pm1_4_4 |  -0.2242  -0.2760  -0.1646  -0.1933  -0.2165   0.3167   0.2425   0.3288   0.2399   0.2919  -0.0430 
   Pm3_1_4_1 |  -0.2360  -0.2410  -0.2095   0.0639  -0.0617   0.0735   0.0132   0.1069  -0.0735   0.0518   0.0467 
   Pm3_1_4_2 |  -0.2461  -0.2545  -0.2630  -0.0409  -0.1542  -0.0285  -0.1411   0.1230  -0.0549   0.0628   0.1267 
   Pm3_1_4_3 |  -0.1792  -0.1362  -0.1877   0.0560  -0.0973  -0.0792  -0.0869   0.1537  -0.0971  -0.0671   0.0901 
   Pm3_1_4_4 |  -0.1936  -0.2483  -0.3034  -0.0253  -0.1779   0.1134  -0.0395   0.2442   0.0299  -0.0055   0.1504 
Pm3_1_1_sc~e |   0.0757  -0.0401   0.0882   0.1178   0.2550   0.1209   0.0733   0.0208   0.1910  -0.0514  -0.0641 
Pm3_1_2_sc~e |   0.1909   0.1945   0.1981  -0.1101   0.0665   0.0193   0.1054  -0.0073   0.1540   0.0388  -0.0733 
Pm3_1_3_sc~e |   0.0645   0.0783   0.1685  -0.1158   0.0378  -0.0802  -0.0650  -0.0721  -0.1127  -0.1686   0.0770 
Pm3_1_4_1_~e |   0.1600   0.2586   0.3134   0.0657   0.1627  -0.0329   0.0743  -0.1929   0.0498  -0.0615  -0.1717 
Pm3_1_4_2_~e |   0.2347   0.2431   0.2516   0.0510   0.1466   0.0322   0.1374  -0.1133   0.0532  -0.0723  -0.1192 
Pm3_1_4_3_~e |   0.2113   0.2712   0.2275   0.0871   0.1806   0.0343   0.0935  -0.1406  -0.0017  -0.0429  -0.1805 
Pm3_1_4_4_~e |   0.2401   0.3013   0.3629   0.0701   0.1669  -0.0413   0.1105  -0.1683   0.0478  -0.0587  -0.1739 
Pm3_1_5_sc~e |   0.1440   0.2344   0.2886   0.4892   0.3676  -0.0904   0.0737  -0.0472  -0.0713  -0.3754   0.1339 
Pm3_total_~e |   0.2576   0.3055   0.4318   0.2752   0.4154  -0.0537   0.1007  -0.1093  -0.0133  -0.3320   0.0051 
     Pm3_2_1 |   0.0918   0.0248   0.0513  -0.0609   0.0702   0.3859   0.4218   0.3117   0.3556   0.0855  -0.1401 
     Pm3_2_2 |   0.1497   0.0788   0.1143  -0.0458   0.1222   0.4028   0.4141   0.2664   0.3052   0.1805  -0.0589 
     Pm3_2_3 |   0.0137  -0.0144   0.0258  -0.0426   0.0189   0.2749   0.3919   0.3093   0.2859   0.1433   0.0493 
     Pm3_2_4 |   0.0619  -0.0601  -0.1199  -0.1177  -0.0613   0.3243   0.3790   0.3056   0.3163   0.2317  -0.0683 
     Pm3_2_5 |  -0.2165  -0.3776  -0.2229  -0.1692  -0.2435   0.1829   0.1077   0.1618   0.0470   0.6363  -0.0436 
     Pm3_3_1 |  -0.2255  -0.1767   0.0197  -0.1472  -0.1778   0.1125   0.0962   0.1321   0.0231   0.1771  -0.0734 
     Pm3_3_2 |  -0.2202  -0.1744  -0.0490  -0.1012  -0.1533   0.1404   0.0750   0.1282  -0.0292   0.0669   0.0013 
     Pm3_3_3 |  -0.1970  -0.2019  -0.2069  -0.0120  -0.1008   0.1010   0.0711   0.0823  -0.0778   0.1911  -0.0039 
     Pm3_3_4 |  -0.1970  -0.2019  -0.2069  -0.0120  -0.1008   0.1010   0.0711   0.0823  -0.0778   0.1911  -0.0039 
     Pm3_4_1 |  -0.2412  -0.2816  -0.0113  -0.0943  -0.1216   0.2174   0.1501   0.2902   0.0486   0.2524  -0.0454 
     Pm3_4_2 |  -0.0608  -0.0294   0.0195  -0.0026   0.1053   0.0782   0.0927   0.0380  -0.0682   0.0478  -0.0013 
     Pm3_4_3 |  -0.0458  -0.0855  -0.0510  -0.1528  -0.0115   0.3091   0.2493   0.2658   0.1171   0.0988  -0.0293 
     Pm3_4_4 |  -0.0999  -0.1050  -0.1211  -0.1748  -0.1434   0.1387   0.1919   0.1014   0.0373   0.1715  -0.0054 
Pm4_1_1_sc~e |  -0.1182   0.0210  -0.1140  -0.0422   0.0075  -0.0514   0.0192  -0.1434  -0.0950   0.0682  -0.0596 
Pm4_1_2_sc~e |   0.1092   0.1113   0.1133   0.0702   0.1502   0.0866   0.0793   0.0861  -0.0079  -0.1162   0.2167 
Pm4_1_3_sc~e |   0.1239   0.2256   0.1317  -0.0602   0.2170  -0.0822  -0.0724   0.0373  -0.1364  -0.0275   0.0461 
Pm4_1_4_sc~e |  -0.0436   0.1194   0.0255   0.2362   0.0677  -0.1486  -0.1060  -0.1063  -0.0760  -0.3363   0.0027 
Pm4_total_~e |   0.0000   0.2159   0.0541   0.2048   0.1701  -0.1601  -0.0966  -0.0997  -0.1393  -0.3326   0.0241 
     Pm4_2_1 |   0.0578   0.0088   0.0401  -0.1253  -0.0006   0.1494   0.2308   0.0937   0.1231   0.1700  -0.0285 
     Pm4_2_2 |   0.0318  -0.0030  -0.0129  -0.0025   0.0581   0.2857   0.4013   0.2280   0.0899   0.1542  -0.0382 
     Pm4_2_3 |   0.1101   0.0879   0.0308  -0.0360   0.0722   0.2283   0.3614   0.2662   0.1255   0.1602  -0.0338 
     Pm4_2_4 |  -0.0831  -0.0454  -0.0640   0.0381  -0.0743   0.0542   0.2298   0.1454   0.0529   0.1753  -0.0010 
     Pm4_2_5 |  -0.0318  -0.0971  -0.1030   0.0167  -0.0218   0.1617   0.3002   0.2892   0.1784   0.1344  -0.0503 
     Pm4_2_6 |  -0.1905  -0.3742  -0.2667  -0.1378  -0.2001   0.0837   0.0450   0.2200   0.0290   0.5875   0.0352 
     Pm4_3_1 |  -0.2149  -0.2357  -0.1128  -0.1622  -0.1849   0.0568   0.0855   0.0900   0.0193   0.1543  -0.0157 
     Pm4_3_2 |  -0.0356  -0.0959  -0.1162  -0.1228  -0.0546   0.1645   0.1552   0.1808   0.0486   0.0984  -0.0668 
     Pm4_3_3 |  -0.0789  -0.2083  -0.2706  -0.0591  -0.1610   0.0787   0.1224   0.1489   0.0036   0.3567  -0.1760 
     Pm4_3_4 |  -0.1064  -0.2398  -0.2463  -0.0998  -0.1581   0.0706   0.1110   0.1797  -0.0337   0.3834  -0.1177 
     Pm4_4_1 |  -0.1741  -0.2842  -0.1269  -0.1529  -0.1884   0.0440   0.0861   0.1803  -0.0456   0.2618  -0.0464 
     Pm4_4_2 |  -0.1860  -0.1546  -0.1754  -0.1078  -0.1273   0.1243   0.1642   0.1528   0.0021   0.1302  -0.0800 
     Pm4_4_3 |  -0.0840  -0.1035  -0.1418  -0.1216  -0.0689   0.2612   0.2029   0.2175   0.0676   0.1870  -0.0325 
     Pm4_4_4 |  -0.1408  -0.2105  -0.2481  -0.2000  -0.2218   0.1331   0.1583   0.1338   0.0304   0.1557  -0.1187 
Pm17_1_1_s~e |   0.0328   0.1925   0.2008   0.1034   0.1241  -0.0355  -0.0479  -0.1326   0.0099  -0.3459  -0.0514 
Pm17_1_2_s~e |   0.3629   0.3441   0.2519   0.1105   0.3858   0.0979   0.0734  -0.0178  -0.0480  -0.2253  -0.1604 
Pm17_1_3_s~e |   0.0222  -0.1420  -0.0068   0.1508   0.0320  -0.0751  -0.1767  -0.0483  -0.1229  -0.0105   0.1492 
Pm17_1_4_s~e |  -0.0476   0.0117   0.0713   0.0871  -0.0432   0.1584   0.0943  -0.0678   0.0102  -0.1884  -0.0414 
Pm17_total~e |   0.2351   0.2154   0.2371   0.2140   0.2821   0.0463  -0.0338  -0.1192  -0.0825  -0.3196  -0.0529 
    Pm17_2_2 |   0.1447   0.1176   0.1369   0.1491   0.2369   0.1845   0.3717   0.3152   0.1610   0.0162   0.0283 
    Pm17_2_3 |   0.0699   0.0145  -0.0471   0.0620   0.0805   0.2741   0.3856   0.2910   0.2691   0.1692  -0.1378 
    Pm17_2_4 |   0.1257   0.1122   0.0543   0.0394   0.1258   0.1969   0.4376   0.3286   0.1718   0.1482  -0.1327 
    Pm17_2_5 |  -0.0167  -0.0444  -0.0661  -0.0230  -0.0230   0.1908   0.4469   0.3259   0.1484   0.1861  -0.0930 
    Pm17_3_1 |  -0.0163  -0.1339  -0.0359  -0.0847  -0.0720   0.1156   0.1227   0.0833   0.2378   0.1315  -0.0664 
    Pm17_3_2 |   0.0769   0.0048   0.0535  -0.1128   0.0322   0.1974   0.2586   0.1492   0.1573   0.0109  -0.0448 
    Pm17_3_3 |  -0.0719  -0.1647  -0.1692   0.0238  -0.0735   0.0629   0.1118   0.2339  -0.0101   0.2646  -0.0234 
    Pm17_3_4 |  -0.0264  -0.1278  -0.1317   0.0602  -0.0898   0.0519   0.1617   0.1936   0.0415   0.2356  -0.0461 
    Pm17_4_1 |  -0.1221  -0.1522  -0.0183  -0.1086  -0.1417   0.0871   0.1849   0.1316   0.1072   0.1400   0.0261 
    Pm17_4_2 |  -0.0244  -0.0608  -0.0106  -0.1072   0.0278   0.0535   0.1422   0.1945   0.0299   0.0208   0.0677 
    Pm17_4_3 |   0.0441   0.0151  -0.0758  -0.0296   0.0527   0.1701   0.1609   0.2555   0.1072  -0.0270  -0.0412 
    Pm17_4_4 |  -0.0480  -0.1060  -0.1270  -0.1922  -0.0961   0.2293   0.1864   0.1616   0.1363   0.1961  -0.0947 
completed_~t |        .        .        .        .        .        .        .        .        .        .        . 

             | m4_1_2~e m4_1_3~e m4_1_4~e m4_tot~e   m4_2_1   m4_2_2   m4_2_3   m4_2_4   m4_2_5   m4_2_6 m17_1_..
-------------+---------------------------------------------------------------------------------------------------
m4_1_2_score |   1.0000 
m4_1_3_score |  -0.0362   1.0000 
m4_1_4_score |  -0.0788  -0.1611   1.0000 
m4_total_s~e |   0.1551   0.1485   0.7472   1.0000 
      m4_2_1 |  -0.0757   0.1705   0.0096  -0.0987   1.0000 
      m4_2_2 |  -0.0082   0.1641  -0.0410  -0.0535   0.5425   1.0000 
      m4_2_3 |  -0.0289   0.0472   0.0463  -0.0186   0.5117   0.6080   1.0000 
      m4_2_4 |  -0.0874   0.1367   0.0046  -0.0015   0.4213   0.5324   0.6059   1.0000 
      m4_2_5 |  -0.0302  -0.0014   0.0623  -0.0260   0.3886   0.3069   0.4556   0.2713   1.0000 
      m4_2_6 |  -0.0046   0.0869  -0.1031  -0.1551   0.1211   0.2981   0.1293   0.3310   0.2067   1.0000 
m17_1_1_sc~e |   0.0392   0.1093  -0.1689  -0.1844   0.0990   0.3023   0.1681   0.1045  -0.0576   0.0395   1.0000 
m17_1_2_sc~e |   0.0899   0.1171   0.0082   0.0868   0.0475   0.0631   0.0175  -0.0058  -0.2299  -0.1538   0.3354 
m17_1_3_sc~e |   0.0398   0.0519   0.0326   0.1155   0.0622  -0.0332  -0.0013  -0.1463   0.0518  -0.2109   0.0238 
m17_1_4_sc~e |  -0.0709  -0.0924   0.1692   0.1321  -0.0386  -0.1076   0.0093  -0.0394  -0.1529  -0.3473   0.0833 
m17_total_~e |   0.0407   0.0927  -0.0188   0.0045   0.0860   0.1608   0.1192   0.0335  -0.1816  -0.2192   0.7630 
     m17_2_2 |   0.0154   0.0983   0.0376  -0.0539   0.4932   0.4058   0.4545   0.4093   0.3459   0.0069   0.1324 
     m17_2_3 |  -0.0709  -0.0316   0.0162  -0.0250   0.2738   0.2532   0.4702   0.3491   0.3917   0.2580   0.0292 
     m17_2_4 |  -0.1159   0.0703   0.0582  -0.0495   0.4268   0.4745   0.5428   0.5367   0.4476   0.2411   0.0343 
     m17_2_5 |  -0.1188   0.0560   0.0650   0.0178   0.2949   0.3391   0.4594   0.5632   0.3894   0.3234   0.0449 
completed_~e |        .        .        .        .        .        .        .        .        .        .        . 
Pm1_1_1_sc~e |  -0.0226  -0.0294  -0.0185  -0.0654   0.0723  -0.0044   0.0495   0.0711  -0.0725  -0.0444   0.1226 
Pm1_1_3_sc~e |  -0.0398  -0.0519  -0.1130  -0.1326  -0.0393  -0.0117  -0.0414   0.1045  -0.0243   0.2109  -0.0238 
Pm1_1_2_sc~e |  -0.0322   0.1911  -0.0264  -0.0069   0.2469   0.0458   0.1561   0.1014   0.0653  -0.0634   0.0779 
Pm1_1_4_sc~e |  -0.0226   0.2971  -0.1552   0.0558  -0.1235  -0.0055  -0.0110   0.0539  -0.0469  -0.1665  -0.0135 
Pm1_total_~e |  -0.0633   0.1792  -0.1614  -0.0981   0.0914   0.0138   0.0749   0.1781  -0.0277   0.0236   0.0712 
     Pm1_2_1 |   0.0925   0.0437  -0.0895  -0.0961   0.1445   0.1983   0.1745   0.2313   0.1410   0.1169   0.1097 
     Pm1_2_2 |   0.1369   0.0520   0.0211  -0.0046   0.1610   0.2414   0.1187   0.2784   0.0644   0.1471   0.0958 
     Pm1_2_3 |   0.0010   0.1341  -0.0306   0.0143   0.1344   0.1839   0.1336   0.2715   0.0041   0.1409   0.2504 
     Pm1_2_4 |   0.0983   0.1305  -0.1006  -0.0836   0.1606   0.2236   0.1290   0.2784   0.0125   0.1198   0.3065 
     Pm1_2_5 |   0.1096   0.0988  -0.0197  -0.0112   0.1422   0.1658   0.1454   0.2764   0.0335  -0.0170   0.2052 
     Pm1_2_6 |   0.0140   0.1447  -0.0239   0.0327   0.0961   0.1741   0.0203   0.3105  -0.0025   0.5346   0.0640 
     Pm1_2_7 |  -0.0079   0.0224  -0.0767  -0.0013  -0.0511   0.0820  -0.0227  -0.0389  -0.1270   0.2387   0.1070 
     Pm1_3_1 |   0.1451   0.1088  -0.0226   0.0260   0.1791   0.0822   0.1042   0.1766   0.0865   0.2787  -0.0364 
     Pm1_3_2 |   0.0813   0.0802  -0.0105   0.0324   0.1352  -0.0145  -0.0611   0.0620   0.0468   0.1833   0.0593 
     Pm1_3_3 |   0.0398   0.0519  -0.1282  -0.0271   0.1538   0.0782   0.0065   0.0944   0.1542   0.2939  -0.1363 
     Pm1_3_4 |   0.0398   0.0519  -0.1282  -0.0271   0.1538   0.0782   0.0065   0.0944   0.1542   0.2939  -0.1363 
     Pm1_4_1 |   0.1153  -0.0203   0.0797   0.1367   0.0647   0.0064   0.0034  -0.0162   0.1395   0.2439  -0.1824 
     Pm1_4_2 |  -0.0339   0.0599  -0.1450  -0.1611   0.0947   0.1208   0.0303   0.1225   0.1322   0.2823  -0.0202 
     Pm1_4_3 |  -0.0967   0.1535  -0.1445  -0.1553   0.1708   0.1540   0.1088   0.2030   0.2623   0.2354   0.0109 
     Pm1_4_4 |   0.0019   0.0479  -0.0013  -0.0218   0.2310   0.1775   0.1325   0.1980   0.2461   0.3278  -0.0846 
   Pm3_1_4_1 |  -0.0952  -0.1584  -0.0505  -0.1128   0.0512   0.1344  -0.0907  -0.1368  -0.0065   0.0975  -0.0314 
   Pm3_1_4_2 |  -0.0928  -0.0357  -0.0172   0.0135   0.1084   0.0546  -0.0585  -0.0426  -0.1457  -0.0088  -0.0961 
   Pm3_1_4_3 |  -0.1180  -0.0745  -0.0247  -0.0360  -0.0040   0.0224  -0.1406  -0.1977  -0.0940   0.0001  -0.0816 
   Pm3_1_4_4 |  -0.1095  -0.0560   0.0631   0.0831   0.0513   0.1172  -0.0682  -0.0937   0.0389   0.0152  -0.1995 
Pm3_1_1_sc~e |  -0.0553  -0.0720  -0.1365  -0.1872   0.1233   0.0887   0.0690  -0.0393   0.0631  -0.0539   0.0579 
Pm3_1_2_sc~e |  -0.0278   0.2317  -0.0788  -0.0308   0.1542  -0.0418   0.2272   0.1457   0.1034   0.0474  -0.0724 
Pm3_1_3_sc~e |  -0.0094   0.1084  -0.2160  -0.1007  -0.0339   0.0623   0.0630   0.0740  -0.1199  -0.0960   0.2647 
Pm3_1_4_1_~e |   0.0474   0.0970  -0.1158  -0.1363   0.0492   0.0007   0.0948   0.0689   0.0692  -0.0079   0.2116 
Pm3_1_4_2_~e |   0.0834   0.0283   0.0177  -0.0148  -0.1130  -0.0495   0.0463   0.0262   0.1496   0.0045   0.0833 
Pm3_1_4_3_~e |   0.0898   0.0345   0.0993   0.0312   0.0253  -0.0336   0.0666   0.1141   0.0444   0.0362   0.1653 
Pm3_1_4_4_~e |   0.0966   0.0412  -0.0273  -0.0731  -0.1134  -0.1219  -0.0017   0.0343   0.0000  -0.0821   0.1460 
Pm3_1_5_sc~e |  -0.1537  -0.2002   0.0385   0.0094   0.0080  -0.0429  -0.0270  -0.0566   0.0077  -0.3369   0.1444 
Pm3_total_~e |  -0.0849  -0.0063  -0.1727  -0.1542   0.0590   0.0248   0.0826   0.0196   0.0002  -0.2584   0.3072 
     Pm3_2_1 |   0.0657   0.2107  -0.1258  -0.1281   0.2550   0.3380   0.2312   0.3227   0.1447   0.1249   0.0594 
     Pm3_2_2 |   0.0679   0.1731  -0.0010   0.0293   0.2340   0.2567   0.2318   0.3525   0.1425   0.2086   0.0757 
     Pm3_2_3 |  -0.0102   0.1195  -0.0347   0.0195   0.1646   0.2105   0.1580   0.2790   0.2261   0.1027   0.0412 
     Pm3_2_4 |  -0.0159   0.1160  -0.0052  -0.0353   0.2077   0.2902   0.2548   0.4067   0.0900   0.2437  -0.0136 
     Pm3_2_5 |   0.0431   0.0136  -0.1955  -0.1834   0.0439   0.1804  -0.0121   0.2065  -0.0398   0.6331   0.1600 
     Pm3_3_1 |   0.0357  -0.0174  -0.1289  -0.1669   0.1220  -0.0040  -0.0273   0.1364   0.1211   0.2861  -0.0274 
     Pm3_3_2 |   0.0567  -0.1458  -0.0736  -0.1035   0.1347   0.0916  -0.0337   0.0304   0.0819   0.1531   0.0003 
     Pm3_3_3 |   0.0398  -0.1419  -0.0464  -0.0811   0.1986   0.1453  -0.0167   0.0508   0.0730   0.1897  -0.0591 
     Pm3_3_4 |   0.0398  -0.1419  -0.0464  -0.0811   0.1986   0.1453  -0.0167   0.0508   0.0730   0.1897  -0.0591 
     Pm3_4_1 |  -0.0420  -0.0438  -0.0542  -0.0836   0.2821   0.2463   0.1057   0.0512   0.1659   0.2905   0.0477 
     Pm3_4_2 |   0.1605   0.0076  -0.0930  -0.0566   0.1933   0.1965  -0.0108   0.0582   0.0532   0.1101   0.0365 
     Pm3_4_3 |   0.0942   0.0692  -0.0402  -0.0044   0.3270   0.3077   0.1421   0.1554   0.2548   0.0940   0.0031 
     Pm3_4_4 |   0.0019   0.0607  -0.1605  -0.1072   0.1271   0.0991   0.0685   0.0802   0.1475   0.1583   0.0741 
Pm4_1_1_sc~e |  -0.0226  -0.0294  -0.0185  -0.0654   0.1112   0.1484  -0.0242  -0.1421   0.1383   0.0777   0.1226 
Pm4_1_2_sc~e |  -0.0159  -0.0207  -0.1092   0.0392  -0.0063   0.1590   0.1517   0.1758   0.0974  -0.1172  -0.1053 
Pm4_1_3_sc~e |   0.2659   0.4241  -0.0264   0.2111  -0.0111   0.0735  -0.1043   0.0000  -0.0358   0.0689   0.1750 
Pm4_1_4_sc~e |  -0.0363  -0.1931   0.4464   0.2747  -0.0504  -0.1768  -0.0121  -0.0715  -0.0350  -0.4068  -0.0703 
Pm4_total_~e |   0.0548  -0.0429   0.3948   0.3212  -0.0143  -0.0669  -0.0172  -0.0653   0.0195  -0.3638   0.0000 
     Pm4_2_1 |   0.1409   0.1530  -0.2799  -0.1840   0.2143   0.2804   0.1796   0.3730   0.1519   0.1629  -0.0255 
     Pm4_2_2 |  -0.0083   0.1832  -0.2305  -0.1692   0.3025   0.4038   0.2854   0.3681   0.1895   0.2686   0.1494 
     Pm4_2_3 |  -0.0062   0.2143  -0.1821  -0.1192   0.2315   0.3559   0.3000   0.4135   0.1717   0.2520   0.1042 
     Pm4_2_4 |   0.0309  -0.0224  -0.1543  -0.1474   0.1711   0.2539   0.1161   0.2193   0.1744   0.2043   0.1152 
     Pm4_2_5 |  -0.0241   0.1043  -0.0748  -0.0811   0.1688   0.3036   0.3070   0.4040   0.1891   0.2742   0.0510 
     Pm4_2_6 |   0.0441   0.1265  -0.2366  -0.1352   0.0753   0.2201   0.0121   0.1410  -0.0032   0.5816   0.1361 
     Pm4_3_1 |   0.0597  -0.1392  -0.0085  -0.0683   0.1471   0.0093   0.0298   0.1321   0.1277   0.2360  -0.0427 
     Pm4_3_2 |   0.1308  -0.1120  -0.1507  -0.1880   0.1926   0.1266   0.0625   0.0068   0.1257   0.1703   0.0019 
     Pm4_3_3 |   0.0553  -0.0746  -0.0499  -0.1647   0.1896   0.0829  -0.0459   0.0849   0.0947   0.3581  -0.0557 
     Pm4_3_4 |   0.0524  -0.0834  -0.0841  -0.1588   0.1607   0.0849  -0.0526   0.0580   0.1270   0.3868  -0.0319 
     Pm4_4_1 |  -0.0211  -0.1145  -0.0901  -0.1447   0.0843   0.1347  -0.0162   0.0232   0.1339   0.3528   0.0283 
     Pm4_4_2 |   0.0894  -0.0323   0.0161  -0.0456   0.1458   0.0916  -0.0167  -0.0210   0.2048   0.1619  -0.1135 
     Pm4_4_3 |   0.0492   0.0711   0.0152   0.0136   0.2137   0.1888   0.0667   0.1266   0.2243   0.1788  -0.0796 
     Pm4_4_4 |  -0.0482  -0.0167  -0.1353  -0.1979   0.1720   0.0450  -0.0067   0.0414   0.1499   0.2073  -0.0121 
Pm17_1_1_s~e |  -0.0709   0.1489   0.1692   0.1535  -0.1233  -0.1906  -0.1896  -0.0855  -0.2064  -0.2530   0.1336 
Pm17_1_2_s~e |   0.0693   0.1484  -0.1075  -0.1045   0.1185   0.1437  -0.0343  -0.0284  -0.0599  -0.2053   0.2897 
Pm17_1_3_s~e |   0.0185   0.0835  -0.0595   0.0526  -0.0316   0.0360   0.0135   0.0826  -0.0847   0.0049   0.2093 
Pm17_1_4_s~e |  -0.0684  -0.0891   0.1511   0.0661   0.1125   0.0843  -0.0358   0.0000  -0.0245  -0.2060   0.0622 
Pm17_total~e |  -0.0027   0.1590   0.0116   0.0362   0.0569   0.0710  -0.0664  -0.0001  -0.1664  -0.2783   0.3402 
    Pm17_2_2 |  -0.0101   0.2251  -0.0794   0.0087   0.2751   0.3093   0.2696   0.3468   0.1384   0.1566   0.1398 
    Pm17_2_3 |   0.0884   0.0250  -0.1589  -0.1983   0.2506   0.2694   0.2410   0.2608   0.1196   0.1272   0.1043 
    Pm17_2_4 |   0.1140   0.1344  -0.1000  -0.1068   0.2982   0.2922   0.1904   0.3305   0.1551   0.2617   0.0317 
    Pm17_2_5 |   0.0427  -0.0456  -0.1155  -0.1829   0.2414   0.2623   0.2145   0.3001   0.1674   0.2855   0.0634 
    Pm17_3_1 |   0.1519  -0.1599  -0.1336  -0.1906   0.1721   0.1150   0.2313   0.3229   0.1496   0.1895   0.0311 
    Pm17_3_2 |   0.0705  -0.0620  -0.0805  -0.1117   0.3047   0.2221   0.2758   0.2172   0.1899   0.0588   0.0868 
    Pm17_3_3 |   0.0362  -0.1641  -0.1011  -0.1490   0.2336   0.2328   0.1526   0.2316   0.1904   0.2670  -0.0204 
    Pm17_3_4 |   0.0322  -0.1911  -0.0712  -0.1453   0.2001   0.2553   0.2102   0.2797   0.2572   0.2377   0.0193 
    Pm17_4_1 |  -0.0581   0.0407  -0.1260  -0.0868   0.2717   0.2431   0.1896   0.2193   0.2266   0.2235   0.0497 
    Pm17_4_2 |   0.0608   0.0084  -0.2153  -0.1416   0.1911   0.1584   0.1519   0.1056   0.1169   0.0257   0.0562 
    Pm17_4_3 |   0.1233   0.0217  -0.1023  -0.0907   0.2338   0.2535   0.1349   0.1319   0.2006  -0.0357  -0.0112 
    Pm17_4_4 |   0.1280   0.0624  -0.2126  -0.1930   0.2098   0.0989   0.1015   0.0834   0.2631   0.2008  -0.0272 
completed_~t |        .        .        .        .        .        .        .        .        .        .        . 

             | m17_1_.. m17_1_.. m17_1_.. m17_to~e  m17_2_2  m17_2_3  m17_2_4  m17_2_5 comple~e Pm1_1_.. Pm1_1_..
-------------+---------------------------------------------------------------------------------------------------
m17_1_2_sc~e |   1.0000 
m17_1_3_sc~e |   0.0619   1.0000 
m17_1_4_sc~e |   0.1095   0.1017   1.0000 
m17_total_~e |   0.6496   0.2836   0.5229   1.0000 
     m17_2_2 |   0.1247   0.1700  -0.0016   0.1801   1.0000 
     m17_2_3 |  -0.0965  -0.0148  -0.1301  -0.0710   0.4422   1.0000 
     m17_2_4 |  -0.0003   0.0812  -0.1258  -0.0173   0.5610   0.5643   1.0000 
     m17_2_5 |  -0.1264  -0.0579  -0.0265  -0.0390   0.4432   0.5265   0.5684   1.0000 
completed_~e |        .        .        .        .        .        .        .        .        . 
Pm1_1_1_sc~e |   0.0730   0.0324  -0.0576   0.0948   0.1103   0.0011   0.0712   0.0840        .   1.0000 
Pm1_1_3_sc~e |  -0.0619  -0.2952  -0.1017  -0.1700   0.0337  -0.0283  -0.0387   0.0742        .  -0.0324   1.0000 
Pm1_1_2_sc~e |   0.1042   0.0462  -0.0822   0.0693   0.1370  -0.0617  -0.0281   0.0158        .  -0.0262  -0.0462 
Pm1_1_4_sc~e |  -0.0891   0.0324  -0.0576  -0.0531  -0.0364  -0.1499  -0.0416  -0.1106        .  -0.0183  -0.0324 
Pm1_total_~e |   0.0099  -0.1492  -0.1616  -0.0602   0.1295  -0.1135  -0.0303   0.0487        .   0.3566   0.6292 
     Pm1_2_1 |   0.0312   0.1618   0.0879   0.1543   0.3672   0.2790   0.2118   0.2319        .   0.0335  -0.0547 
     Pm1_2_2 |   0.0629   0.0780   0.0540   0.1265   0.2694   0.2272   0.3022   0.3284        .   0.0393   0.0996 
     Pm1_2_3 |   0.1935   0.1441   0.1097   0.3166   0.3545   0.1720   0.2130   0.2631        .   0.0421  -0.0415 
     Pm1_2_4 |   0.1662   0.0837   0.0812   0.3003   0.3248   0.1371   0.2704   0.2176        .   0.0375  -0.0514 
     Pm1_2_5 |   0.1770   0.0715   0.2067   0.2905   0.4108   0.1081   0.1753   0.3131        .   0.0205   0.0991 
     Pm1_2_6 |  -0.0544  -0.0402  -0.1174  -0.0450   0.0061   0.1168   0.1482   0.2651        .   0.0820   0.1669 
     Pm1_2_7 |  -0.0038  -0.0411  -0.0779   0.0131  -0.1089   0.1821  -0.0717   0.0860        .  -0.1085  -0.1333 
     Pm1_3_1 |  -0.0521   0.0127  -0.0431  -0.0506   0.2410   0.2356   0.1840   0.3123        .  -0.0072  -0.0127 
     Pm1_3_2 |   0.1165   0.0250   0.0044   0.0811   0.0688   0.0644   0.1362   0.2022        .   0.0260   0.0458 
     Pm1_3_3 |  -0.0335  -0.0571  -0.0090  -0.1202   0.0415   0.0894   0.1733   0.2186        .   0.0324   0.0571 
     Pm1_3_4 |  -0.0335  -0.0571  -0.0090  -0.1202   0.0415   0.0894   0.1733   0.2186        .   0.0324   0.0571 
     Pm1_4_1 |  -0.1152   0.0223   0.0216  -0.1544  -0.0425   0.0441   0.1387   0.1725        .  -0.0126  -0.0223 
     Pm1_4_2 |  -0.1080  -0.0229  -0.1222  -0.1161   0.0872   0.1067   0.1857   0.2439        .  -0.1087   0.0945 
     Pm1_4_3 |  -0.1342   0.0762  -0.0893  -0.0842   0.2031   0.3116   0.2708   0.3692        .  -0.0432   0.0488 
     Pm1_4_4 |  -0.0580  -0.0027  -0.0474  -0.0826   0.1280   0.2263   0.2331   0.2282        .  -0.0339  -0.1223 
   Pm3_1_4_1 |  -0.0660  -0.1305   0.0271  -0.0779  -0.0333   0.1120  -0.0863  -0.1265        .  -0.1058  -0.1366 
   Pm3_1_4_2 |  -0.0022  -0.1013  -0.0193  -0.1093   0.0119   0.0920   0.0688   0.0500        .   0.0574  -0.1331 
   Pm3_1_4_3 |   0.0077  -0.0489   0.0832  -0.0429  -0.0402   0.0353  -0.0766  -0.1517        .   0.0277  -0.1692 
   Pm3_1_4_4 |  -0.1746   0.0230   0.0704  -0.1657  -0.0547   0.1109   0.0005   0.0300        .  -0.1318  -0.1571 
Pm3_1_1_sc~e |   0.0345   0.0793   0.0264   0.0729   0.0540  -0.0253   0.1604  -0.0359        .  -0.0449  -0.0793 
Pm3_1_2_sc~e |  -0.0431   0.0398  -0.0709  -0.0806   0.0688   0.1938   0.1483   0.0363        .  -0.0226   0.2058 
Pm3_1_3_sc~e |   0.1352   0.0964   0.1497   0.2946  -0.0073  -0.0852  -0.1096   0.0444        .   0.0394   0.1525 
Pm3_1_4_1_~e |   0.2308   0.0288  -0.0411   0.2141   0.0574  -0.1244   0.0014  -0.0450        .   0.0934   0.0680 
Pm3_1_4_2_~e |  -0.0103   0.1017   0.0275   0.0997  -0.0220  -0.0974  -0.0801  -0.0592        .  -0.0576   0.1196 
Pm3_1_4_3_~e |   0.0985   0.0981  -0.0321   0.1659   0.1349  -0.0472  -0.0017  -0.0322        .  -0.0556   0.1288 
Pm3_1_4_4_~e |   0.0870  -0.0220  -0.0949   0.0896  -0.0129  -0.1843  -0.0571  -0.0921        .   0.1446   0.1386 
Pm3_1_5_sc~e |   0.0643   0.1404   0.3107   0.2633  -0.0477  -0.0744   0.0172  -0.0759        .   0.0110   0.0194 
Pm3_total_~e |   0.1739   0.1892   0.2657   0.4020   0.0157  -0.0997   0.0066  -0.0652        .   0.0153   0.1148 
     Pm3_2_1 |   0.0822  -0.0232   0.0772   0.1098   0.3451   0.2649   0.3172   0.3355        .  -0.1075  -0.0112 
     Pm3_2_2 |   0.1081   0.0811   0.1050   0.1496   0.3217   0.3294   0.3946   0.4258        .  -0.1031   0.0268 
     Pm3_2_3 |  -0.0989  -0.0570   0.1616   0.0415   0.1921   0.2339   0.3744   0.3906        .  -0.0895   0.0197 
     Pm3_2_4 |   0.0522  -0.0064   0.1470   0.0825   0.2322   0.2385   0.3649   0.4070        .  -0.0947   0.0407 
     Pm3_2_5 |  -0.0299  -0.0750  -0.2185  -0.0327  -0.0315   0.1993   0.1117   0.2748        .  -0.1063   0.1046 
     Pm3_3_1 |  -0.0596  -0.0512  -0.2012  -0.1441   0.0551   0.2788   0.1663   0.0858        .  -0.0106   0.0512 
     Pm3_3_2 |  -0.0847  -0.0124  -0.0753  -0.0735   0.0716   0.1324   0.1777   0.0434        .   0.0070   0.0124 
     Pm3_3_3 |  -0.1289  -0.0571  -0.2332  -0.1957   0.0267   0.1326   0.1989   0.0406        .   0.0324   0.0571 
     Pm3_3_4 |  -0.1289  -0.0571  -0.2332  -0.1957   0.0267   0.1326   0.1989   0.0406        .   0.0324   0.0571 
     Pm3_4_1 |  -0.0736  -0.0365  -0.1490  -0.0820   0.0214   0.2279   0.2481   0.1778        .  -0.0341  -0.0602 
     Pm3_4_2 |   0.0306   0.0600  -0.0972   0.0150   0.0085   0.2003   0.0348   0.0389        .  -0.1162  -0.0600 
     Pm3_4_3 |  -0.0166   0.0764  -0.1221  -0.0345   0.1697   0.2245   0.2312   0.1538        .  -0.1415  -0.1855 
     Pm3_4_4 |  -0.0639   0.0624  -0.0923   0.0007   0.0765   0.2466   0.1033   0.0905        .  -0.1324  -0.1154 
Pm4_1_1_sc~e |   0.0730   0.0324  -0.0576   0.0948   0.0287   0.0744  -0.0701  -0.0697        .  -0.0183  -0.0324 
Pm4_1_2_sc~e |  -0.1768   0.0228  -0.0405  -0.1414   0.0777  -0.0508   0.0987   0.0078        .  -0.0129  -0.0228 
Pm4_1_3_sc~e |   0.1042   0.0462  -0.0822   0.1354   0.0323  -0.0351  -0.0227  -0.0474        .  -0.0262  -0.0462 
Pm4_1_4_sc~e |   0.1753   0.2125   0.3272   0.2008   0.1067  -0.0545   0.0299  -0.0379        .   0.1524  -0.1323 
Pm4_total_~e |   0.1915   0.2359   0.2715   0.2389   0.1504  -0.0448   0.0303  -0.0615        .   0.1337  -0.1573 
     Pm4_2_1 |   0.0759  -0.0337  -0.1052  -0.0315   0.1837   0.1640   0.3059   0.3466        .  -0.0763   0.0585 
     Pm4_2_2 |   0.0818  -0.0644  -0.1004   0.0697   0.2238   0.2840   0.4041   0.2903        .  -0.0931   0.0207 
     Pm4_2_3 |   0.1015  -0.0179  -0.0009   0.0990   0.1749   0.2166   0.2838   0.2417        .  -0.0911   0.1265 
     Pm4_2_4 |   0.0333  -0.0443   0.0124   0.0578   0.0839   0.1162   0.3184   0.2161        .  -0.0725   0.0689 
     Pm4_2_5 |  -0.0409   0.0345   0.0858   0.0610   0.1744   0.2301   0.3011   0.2668        .  -0.1002   0.0741 
     Pm4_2_6 |  -0.0753   0.0040  -0.1880  -0.0310  -0.0703   0.2060   0.1007   0.2161        .  -0.1054  -0.0475 
     Pm4_3_1 |  -0.0897  -0.0856  -0.0394  -0.0898  -0.0653   0.1587   0.0674   0.1090        .   0.0094  -0.0525 
     Pm4_3_2 |   0.0198   0.0152  -0.0524  -0.0153   0.0385   0.1794   0.1803   0.1427        .   0.0305  -0.0152 
     Pm4_3_3 |  -0.0331  -0.0792  -0.1123  -0.1185  -0.0357   0.1227   0.1076   0.1765        .   0.0449   0.0792 
     Pm4_3_4 |  -0.0190  -0.0752  -0.1283  -0.1028  -0.0753   0.1687   0.1572   0.1849        .   0.0426   0.0752 
     Pm4_4_1 |  -0.0291  -0.0546   0.0090  -0.0276  -0.0370   0.1408   0.1417   0.1866        .  -0.0171   0.0546 
     Pm4_4_2 |  -0.0474   0.0083  -0.0238  -0.1118   0.0040   0.2232   0.1474   0.0579        .  -0.0821  -0.1448 
     Pm4_4_3 |   0.0085   0.0584  -0.1109  -0.0791   0.1273   0.2923   0.1969   0.1693        .  -0.1062  -0.0584 
     Pm4_4_4 |  -0.1011   0.0691   0.0100  -0.0354   0.0647   0.2500   0.1244   0.1814        .  -0.0068  -0.0691 
Pm17_1_1_s~e |   0.1095   0.1017   0.0275   0.1564   0.0330  -0.1555  -0.0805  -0.0862        .  -0.0576   0.0090 
Pm17_1_2_s~e |   0.3240  -0.0194   0.0597   0.3043   0.0842  -0.1600  -0.0401  -0.2149        .   0.0110   0.1793 
Pm17_1_3_s~e |   0.1025   0.1370   0.1328   0.2521   0.0018  -0.0842  -0.1181   0.0211        .   0.1077   0.1083 
Pm17_1_4_s~e |  -0.0243   0.0981   0.3240   0.1727   0.0940  -0.1081   0.0784  -0.1009        .  -0.0556  -0.0981 
Pm17_total~e |   0.2690   0.1275   0.2315   0.4197   0.0948  -0.2348  -0.0799  -0.1798        .   0.0267   0.1281 
    Pm17_2_2 |   0.1075   0.0852   0.0798   0.1744   0.2575   0.2345   0.2979   0.1961        .  -0.0884   0.0902 
    Pm17_2_3 |   0.0135   0.0000  -0.0076   0.0668   0.2420   0.3050   0.2934   0.2532        .  -0.1032  -0.0175 
    Pm17_2_4 |   0.0725  -0.0402  -0.0173   0.0308   0.2619   0.3090   0.2776   0.1560        .  -0.0910   0.0768 
    Pm17_2_5 |   0.0711  -0.0119   0.0305   0.0610   0.1686   0.3147   0.3196   0.1884        .  -0.0812   0.0396 
    Pm17_3_1 |  -0.1592  -0.0726   0.0697  -0.0299   0.0366   0.2049   0.1565   0.2222        .   0.0000   0.0726 
    Pm17_3_2 |  -0.0019   0.0463   0.1354   0.1216   0.0828   0.1410   0.1865   0.1550        .   0.0155  -0.0463 
    Pm17_3_3 |  -0.1171  -0.0519  -0.0293  -0.0921  -0.1000   0.1688   0.1900   0.1447        .   0.0294   0.0519 
    Pm17_3_4 |  -0.1042  -0.0462  -0.0520  -0.0693  -0.1283   0.1616   0.1610   0.1634        .   0.0262   0.0462 
    Pm17_4_1 |   0.0371  -0.0096   0.0354   0.0388   0.1100   0.1038   0.1499   0.1976        .  -0.0472   0.0096 
    Pm17_4_2 |   0.0921   0.0619   0.1143   0.1214   0.0308   0.1852   0.1432   0.0520        .  -0.1195  -0.1364 
    Pm17_4_3 |   0.0011   0.0919   0.0237   0.0150   0.1384   0.1606   0.1733   0.0687        .  -0.1282  -0.0919 
    Pm17_4_4 |  -0.1426   0.0506   0.0075  -0.0608   0.1507   0.2270   0.1855   0.1780        .  -0.0950  -0.0146 
completed_~t |        .        .        .        .        .        .        .        .        .        .        . 

             | Pm1_1_.. Pm1_1_.. Pm1_to~e  Pm1_2_1  Pm1_2_2  Pm1_2_3  Pm1_2_4  Pm1_2_5  Pm1_2_6  Pm1_2_7  Pm1_3_1
-------------+---------------------------------------------------------------------------------------------------
Pm1_1_2_sc~e |   1.0000 
Pm1_1_4_sc~e |  -0.0262   1.0000 
Pm1_total_~e |   0.5089   0.3566   1.0000 
     Pm1_2_1 |  -0.1309  -0.0917  -0.1341   1.0000 
     Pm1_2_2 |  -0.0333  -0.0859   0.0305   0.6061   1.0000 
     Pm1_2_3 |  -0.0283  -0.0817  -0.0600   0.5612   0.5669   1.0000 
     Pm1_2_4 |  -0.0374   0.0375  -0.0260   0.5752   0.5900   0.6974   1.0000 
     Pm1_2_5 |  -0.0524  -0.0939   0.0087   0.5706   0.6323   0.6419   0.6812   1.0000 
     Pm1_2_6 |  -0.0781  -0.1914   0.0260   0.3571   0.4024   0.4151   0.3376   0.3067   1.0000 
     Pm1_2_7 |  -0.0456  -0.1085  -0.2033  -0.0515  -0.1069  -0.0243  -0.0087  -0.1405   0.1836   1.0000 
     Pm1_3_1 |  -0.0996   0.1179  -0.0202   0.2262   0.3000   0.1403   0.2204   0.1859   0.2397   0.2128   1.0000 
     Pm1_3_2 |  -0.0488   0.0260   0.0246   0.0996   0.2487   0.0674   0.1323   0.1846   0.2695   0.0173   0.5878 
     Pm1_3_3 |   0.0462   0.0324   0.0908  -0.0131   0.1300  -0.0743  -0.0661  -0.0227   0.3378   0.1914   0.4417 
     Pm1_3_4 |   0.0462   0.0324   0.0908  -0.0131   0.1300  -0.0743  -0.0661  -0.0227   0.3378   0.1914   0.4417 
     Pm1_4_1 |   0.0958  -0.0126   0.0285  -0.0482   0.1149  -0.2157  -0.1801  -0.1006   0.2365   0.0615   0.3201 
     Pm1_4_2 |   0.1054   0.1347   0.1340   0.0718   0.2456   0.0394   0.1389   0.0227   0.1946   0.0974   0.5730 
     Pm1_4_3 |   0.1483   0.0631   0.1244   0.1485   0.2232   0.0382   0.0616   0.0517   0.2303   0.1232   0.4522 
     Pm1_4_4 |   0.0275  -0.0339  -0.0950   0.2188   0.2752   0.1105   0.1237   0.1023   0.2680   0.2282   0.4696 
   Pm3_1_4_1 |  -0.0724  -0.1308  -0.2285   0.0851  -0.0657  -0.0068  -0.0325  -0.0634  -0.0179   0.2606  -0.0511 
   Pm3_1_4_2 |  -0.0602  -0.1418  -0.1583   0.0372  -0.0172   0.0628   0.0405   0.0707   0.0423   0.2368   0.0571 
   Pm3_1_4_3 |  -0.0928  -0.1577  -0.2194   0.0181  -0.1930  -0.0809  -0.0334  -0.1117  -0.0331   0.2166  -0.0377 
   Pm3_1_4_4 |  -0.0788  -0.1567  -0.2668   0.0651   0.0081  -0.0655  -0.0810   0.0562  -0.0224   0.2045  -0.0525 
Pm3_1_1_sc~e |  -0.0641  -0.0449  -0.1260   0.1517   0.1470   0.0573   0.1045   0.1505  -0.0457  -0.1534  -0.0161 
Pm3_1_2_sc~e |   0.2659  -0.0226   0.2714  -0.1128  -0.1057  -0.1005  -0.1106  -0.1155  -0.0841  -0.0079   0.0424 
Pm3_1_3_sc~e |   0.1569  -0.1017   0.1670   0.0161  -0.0102  -0.0182   0.0720   0.1307   0.0568   0.2594  -0.0033 
Pm3_1_4_1_~e |   0.0159   0.0934   0.1301  -0.0272  -0.1043  -0.1220   0.0516  -0.0898  -0.1104  -0.1094   0.0362 
Pm3_1_4_2_~e |   0.0520   0.1305   0.1398  -0.0357   0.0109  -0.0731  -0.0434  -0.0747  -0.0480  -0.2275  -0.0676 
Pm3_1_4_3_~e |   0.0583   0.1372   0.1531   0.0282  -0.0535   0.0811   0.1173   0.0018   0.0194  -0.2707   0.0756 
Pm3_1_4_4_~e |   0.0650   0.1446   0.2467  -0.0993   0.0449   0.0385   0.0564  -0.0098  -0.0479  -0.2396   0.0061 
Pm3_1_5_sc~e |  -0.0813   0.0110  -0.0235   0.0063  -0.0835   0.0476  -0.0530  -0.0218  -0.1615  -0.1689  -0.1111 
Pm3_total_~e |   0.0661  -0.0131   0.1162   0.0276  -0.0489   0.0271   0.0401   0.0627  -0.1054  -0.0711  -0.0530 
     Pm3_2_1 |   0.0188  -0.1075  -0.0833   0.5366   0.5727   0.5947   0.5100   0.5652   0.3600  -0.1420   0.1744 
     Pm3_2_2 |   0.0223  -0.1031  -0.0519   0.5352   0.6255   0.6323   0.5826   0.6256   0.3520  -0.0910   0.2097 
     Pm3_2_3 |   0.0461   0.0323   0.0164   0.4354   0.5189   0.4336   0.5122   0.4841   0.3399  -0.1721   0.1523 
     Pm3_2_4 |   0.0398  -0.0947  -0.0258   0.5117   0.5538   0.4874   0.4884   0.5607   0.3494  -0.0917   0.2873 
     Pm3_2_5 |  -0.0894  -0.1812  -0.0941   0.2214   0.2162   0.2664   0.2292   0.1383   0.7047   0.5044   0.2664 
     Pm3_3_1 |  -0.0151  -0.1894  -0.0537   0.1697   0.1798   0.0862   0.1484   0.0536   0.2274   0.2545   0.3728 
     Pm3_3_2 |   0.0100  -0.1793  -0.0549   0.1376   0.2370   0.0594   0.2104   0.1722   0.1972   0.0908   0.3937 
     Pm3_3_3 |   0.0462  -0.2698  -0.0303  -0.0668   0.0526  -0.0798  -0.0443  -0.0820   0.3377   0.1914   0.1197 
     Pm3_3_4 |   0.0462  -0.2698  -0.0303  -0.0668   0.0526  -0.0798  -0.0443  -0.0820   0.3377   0.1914   0.1197 
     Pm3_4_1 |  -0.0487  -0.1815  -0.1548  -0.0220   0.0103  -0.0461   0.0532  -0.0639   0.2445   0.1587   0.2580 
     Pm3_4_2 |   0.0102  -0.1838  -0.1554   0.0686   0.1441   0.0868   0.1241   0.0302   0.2001   0.1371   0.3819 
     Pm3_4_3 |   0.1639  -0.0835  -0.1245   0.0911   0.1734   0.0846   0.1122   0.0409   0.1425   0.1293   0.4320 
     Pm3_4_4 |   0.0432  -0.1826  -0.1806   0.1106  -0.0418  -0.0377   0.0643  -0.0853   0.1719   0.2433   0.2867 
Pm4_1_1_sc~e |  -0.0262  -0.0183  -0.0515   0.0335  -0.0859  -0.0817   0.0375  -0.0939  -0.0068   0.1977  -0.0072 
Pm4_1_2_sc~e |  -0.0184   0.7039   0.2510  -0.0646  -0.0605  -0.0575   0.1160  -0.0661  -0.1347  -0.0763   0.0830 
Pm4_1_3_sc~e |  -0.0374  -0.0262  -0.0735   0.1707   0.2103   0.0901   0.1773   0.1761   0.1000   0.0636   0.1683 
Pm4_1_4_sc~e |   0.0228  -0.1204  -0.0645   0.1401   0.0283   0.0696   0.0488   0.1090  -0.1154  -0.3044  -0.0919 
Pm4_total_~e |   0.0000   0.0000  -0.0536   0.2028   0.0769   0.0746   0.1505   0.1407  -0.0906  -0.2302  -0.0223 
     Pm4_2_1 |  -0.0068  -0.0763  -0.0251   0.3318   0.3280   0.3052   0.3064   0.3963   0.2053  -0.2407   0.0225 
     Pm4_2_2 |  -0.0404  -0.0931  -0.0832   0.3743   0.3375   0.4280   0.4718   0.3516   0.2442  -0.1355   0.1225 
     Pm4_2_3 |  -0.0379  -0.0911  -0.0081   0.4921   0.4452   0.4155   0.3665   0.4179   0.3029  -0.1895   0.1324 
     Pm4_2_4 |  -0.1035  -0.0725  -0.0693   0.3984   0.4115   0.3591   0.4718   0.3349   0.3178  -0.2578   0.0553 
     Pm4_2_5 |  -0.0567  -0.1002  -0.0617   0.4479   0.3592   0.4160   0.3742   0.3092   0.3275  -0.0873   0.0958 
     Pm4_2_6 |  -0.0256  -0.1794  -0.1608   0.1912   0.1332   0.2164   0.1851   0.0859   0.6549   0.5207   0.1691 
     Pm4_3_1 |   0.0134  -0.2371  -0.1194   0.0937   0.1288  -0.0486  -0.0046   0.0150   0.2458   0.2120   0.3378 
     Pm4_3_2 |   0.0435  -0.2368  -0.0686   0.1519   0.2553  -0.0186   0.0584   0.1153   0.2162   0.0859   0.4099 
     Pm4_3_3 |   0.0641  -0.4123  -0.0572   0.0497   0.1733  -0.0640  -0.0866   0.0407   0.4685   0.2035   0.2316 
     Pm4_3_4 |   0.0608  -0.4305  -0.0700  -0.0052   0.1243  -0.0834  -0.1085  -0.0123   0.4447   0.2520   0.2119 
     Pm4_4_1 |   0.0785  -0.2886  -0.0412  -0.0058   0.0644  -0.0482  -0.0233  -0.0333   0.2541   0.1995   0.2116 
     Pm4_4_2 |   0.0485  -0.2368  -0.1992   0.1688   0.1955   0.0022   0.1170   0.0848   0.1974   0.1229   0.3876 
     Pm4_4_3 |   0.1615  -0.2309  -0.0842   0.1202   0.1296  -0.0356   0.0657   0.0344   0.2930   0.2009   0.4197 
     Pm4_4_4 |   0.1065  -0.2193  -0.0779   0.1978   0.1897  -0.0106   0.1090   0.0580   0.2319   0.3327   0.4611 
Pm17_1_1_s~e |   0.0520   0.1305   0.0645   0.0568   0.0109   0.1280   0.1314   0.1249  -0.0720  -0.1709   0.0493 
Pm17_1_2_s~e |   0.1127   0.0110   0.1943   0.1221   0.0547   0.0591   0.0953   0.1876  -0.1186  -0.1715  -0.0109 
Pm17_1_3_s~e |  -0.0447  -0.0313   0.0793   0.1482  -0.0168   0.1662   0.0655   0.1364   0.2660   0.1997  -0.0289 
Pm17_1_4_s~e |  -0.0793  -0.0556  -0.1559  -0.0052   0.0716   0.0965   0.1003   0.0966  -0.0168  -0.1173  -0.0191 
Pm17_total~e |   0.0381   0.0078   0.1225   0.1463   0.0409   0.1901   0.1687   0.2381   0.0307  -0.0987  -0.0176 
    Pm17_2_2 |   0.0780   0.1522   0.1308   0.4009   0.3920   0.5364   0.3693   0.4238   0.3164  -0.1697   0.1758 
    Pm17_2_3 |   0.0737   0.1032   0.0294   0.3929   0.4380   0.5084   0.3950   0.3723   0.2933   0.0243   0.1952 
    Pm17_2_4 |   0.0325  -0.0910  -0.0024   0.4783   0.4607   0.4735   0.3835   0.3945   0.3331  -0.1623   0.2416 
    Pm17_2_5 |  -0.1159  -0.0812  -0.1032   0.5020   0.4483   0.4687   0.3882   0.3240   0.3605  -0.0974   0.2192 
    Pm17_3_1 |   0.0000  -0.1876  -0.0257   0.2203   0.1860   0.0859   0.1602   0.1531   0.1457   0.1742   0.2594 
    Pm17_3_2 |   0.1116  -0.1827  -0.0359   0.1673   0.2516   0.1153   0.1984   0.2287   0.0860  -0.1462   0.2770 
    Pm17_3_3 |   0.0420  -0.3000  -0.0495   0.0356   0.1139  -0.0620  -0.0207   0.0368   0.3069   0.1739   0.1249 
    Pm17_3_4 |   0.0374  -0.3372  -0.0721   0.0080   0.0964  -0.0963  -0.0535   0.0086   0.2732   0.1548   0.0524 
    Pm17_4_1 |   0.1580  -0.1816   0.0035   0.1406   0.0958  -0.0609   0.0747   0.0864   0.1625   0.1451   0.2299 
    Pm17_4_2 |   0.1006  -0.0609  -0.1087   0.1436   0.0749  -0.0130   0.1433   0.1048  -0.0000   0.1324   0.2984 
    Pm17_4_3 |   0.1115  -0.0723  -0.0803   0.1210   0.1064  -0.0425   0.0811   0.0701  -0.0135   0.1223   0.3302 
    Pm17_4_4 |  -0.0387  -0.1583  -0.1332   0.2598   0.1500   0.0502   0.1926   0.1461   0.1955   0.1784   0.2968 
completed_~t |        .        .        .        .        .        .        .        .        .        .        . 

             |  Pm1_3_2  Pm1_3_3  Pm1_3_4  Pm1_4_1  Pm1_4_2  Pm1_4_3  Pm1_4_4 P~_1_4_1 P~_1_4_2 P~_1_4_3 Pm3_1_~4
-------------+---------------------------------------------------------------------------------------------------
     Pm1_3_2 |   1.0000 
     Pm1_3_3 |   0.4290   1.0000 
     Pm1_3_4 |   0.4290   1.0000   1.0000 
     Pm1_4_1 |   0.4061   0.5741   0.5741   1.0000 
     Pm1_4_2 |   0.4737   0.4337   0.4337   0.3820   1.0000 
     Pm1_4_3 |   0.3839   0.4245   0.4245   0.3836   0.5942   1.0000 
     Pm1_4_4 |   0.4462   0.4162   0.4162   0.2689   0.4204   0.5218   1.0000 
   Pm3_1_4_1 |  -0.0970   0.1219   0.1219  -0.0309   0.0649   0.0138   0.0844   1.0000 
   Pm3_1_4_2 |   0.0004   0.0159   0.0159  -0.0167  -0.1385  -0.0484   0.0585   0.4383   1.0000 
   Pm3_1_4_3 |  -0.0418  -0.0428  -0.0428   0.0738  -0.0009   0.0133   0.0467   0.4955   0.6448   1.0000 
   Pm3_1_4_4 |  -0.1204   0.1424   0.1424   0.0853   0.0391   0.0764   0.1021   0.5655   0.5949   0.6081   1.0000 
Pm3_1_1_sc~e |   0.1108  -0.0541  -0.0541  -0.0295   0.0284  -0.1024   0.0613  -0.1197   0.1405   0.1427   0.1133 
Pm3_1_2_sc~e |   0.0813   0.0398   0.0398  -0.0155  -0.0339   0.1446   0.0891  -0.3580  -0.2562  -0.2701  -0.2760 
Pm3_1_3_sc~e |   0.0517   0.0135   0.0135  -0.0241   0.0340  -0.0168   0.0019  -0.0574   0.0122   0.0461   0.0385 
Pm3_1_4_1_~e |   0.2231  -0.0680  -0.0680   0.0056   0.0233  -0.0479   0.0196  -0.4132  -0.5313  -0.3265  -0.7065 
Pm3_1_4_2_~e |  -0.0126  -0.0090  -0.0090   0.0204   0.1510   0.0543  -0.0492  -0.3930  -0.9964  -0.6043  -0.5406 
Pm3_1_4_3_~e |   0.1135  -0.1288  -0.1288  -0.0951   0.0573   0.0265   0.0106  -0.5655  -0.7135  -0.4988  -0.6959 
Pm3_1_4_4_~e |   0.0882  -0.1386  -0.1386  -0.0965   0.0083  -0.0582  -0.0741  -0.5387  -0.6700  -0.5725  -0.8646 
Pm3_1_5_sc~e |  -0.0397  -0.0994  -0.0994  -0.0809  -0.1167  -0.1795  -0.2874  -0.0161  -0.0131  -0.0167  -0.0509 
Pm3_total_~e |   0.1059  -0.0680  -0.0680  -0.1046  -0.0145  -0.1142  -0.1289  -0.2506  -0.2687  -0.1548  -0.2638 
     Pm3_2_1 |   0.2050   0.0478   0.0478  -0.1703   0.1465   0.1750   0.2582  -0.0266   0.0494  -0.0869   0.0319 
     Pm3_2_2 |   0.2505   0.0889   0.0889  -0.0104   0.1819   0.1754   0.2338  -0.1176  -0.0066  -0.1630   0.0447 
     Pm3_2_3 |   0.2214   0.1396   0.1396   0.1115   0.2512   0.2518   0.1913  -0.0496  -0.0905  -0.1801   0.0030 
     Pm3_2_4 |   0.2666   0.1442   0.1442  -0.0250   0.2863   0.2907   0.3382  -0.0745   0.0580  -0.0933   0.1200 
     Pm3_2_5 |   0.2294   0.3198   0.3198   0.1276   0.2792   0.2719   0.3090   0.0622   0.1369   0.0194   0.0706 
     Pm3_3_1 |   0.3609   0.1592   0.1592   0.1287   0.3726   0.3831   0.4534   0.0622   0.0425   0.1465   0.1005 
     Pm3_3_2 |   0.4634   0.1379   0.1379   0.1419   0.4568   0.2685   0.3870   0.0712   0.0237   0.1396   0.1097 
     Pm3_3_3 |   0.0885   0.2983   0.2983   0.2110   0.1732   0.1590   0.1467   0.1287   0.1352   0.1712   0.1592 
     Pm3_3_4 |   0.0885   0.2983   0.2983   0.2110   0.1732   0.1590   0.1467   0.1287   0.1352   0.1712   0.1592 
     Pm3_4_1 |   0.2858   0.2337   0.2337   0.2163   0.2354   0.2597   0.3150   0.1352   0.0444   0.0336   0.0231 
     Pm3_4_2 |   0.3366   0.1395   0.1395   0.1441   0.3516   0.2890   0.2659   0.0394  -0.0808  -0.0340  -0.0341 
     Pm3_4_3 |   0.3978   0.1815   0.1815   0.2666   0.5100   0.5260   0.4385   0.0556   0.0087   0.0691   0.0709 
     Pm3_4_4 |   0.2154   0.0188   0.0188   0.0750   0.3337   0.3547   0.3479  -0.0725  -0.1116   0.1089  -0.0701 
Pm4_1_1_sc~e |   0.0260   0.0324   0.0324  -0.0126   0.1347  -0.0432   0.0724   0.3072  -0.1080   0.0277   0.0463 
Pm4_1_2_sc~e |  -0.0665   0.0228   0.0228  -0.0089   0.0948   0.0444  -0.0986   0.0207   0.0404   0.0195   0.0326 
Pm4_1_3_sc~e |   0.1634   0.0462   0.0462  -0.0180   0.1054   0.0142   0.0275   0.0420   0.0819   0.0396   0.0661 
Pm4_1_4_sc~e |  -0.1113  -0.2689  -0.2689  -0.1197  -0.1548  -0.1411  -0.1623  -0.1732  -0.0285  -0.0269  -0.0634 
Pm4_total_~e |  -0.0716  -0.2359  -0.2359  -0.1281  -0.0687  -0.1402  -0.1392  -0.0718  -0.0224  -0.0027  -0.0227 
     Pm4_2_1 |   0.0713   0.0505   0.0505  -0.0386   0.0212   0.0399  -0.0126  -0.1486   0.0928  -0.0461   0.0046 
     Pm4_2_2 |   0.1362   0.0118   0.0118   0.0604   0.1760   0.1230   0.1035   0.0057   0.0788   0.1091   0.0189 
     Pm4_2_3 |   0.1950   0.0089   0.0089   0.0351   0.1593   0.1254   0.0564   0.0033   0.1177   0.1086   0.1048 
     Pm4_2_4 |   0.1598  -0.0443  -0.0443   0.0664   0.1736   0.1027   0.1571  -0.0901  -0.0239   0.0174  -0.1113 
     Pm4_2_5 |   0.1195   0.0050   0.0050   0.1054   0.2983   0.1364   0.0982   0.0453   0.0146   0.1159   0.1111 
     Pm4_2_6 |   0.1650   0.3165   0.3165   0.1654   0.2739   0.2757   0.2875   0.1566   0.1688   0.1545   0.2185 
     Pm4_3_1 |   0.3460   0.2043   0.2043   0.3496   0.2380   0.2250   0.4395   0.1278   0.0910   0.0961   0.0830 
     Pm4_3_2 |   0.4572   0.2606   0.2606   0.3543   0.3916   0.3372   0.3411   0.0444   0.1194   0.1520   0.0885 
     Pm4_3_3 |   0.2104   0.4587   0.4587   0.3819   0.2067   0.2772   0.2643   0.0680   0.0384   0.0201   0.1489 
     Pm4_3_4 |   0.1979   0.4814   0.4814   0.3925   0.2421   0.2555   0.2886   0.0765   0.0518   0.0266   0.1638 
     Pm4_4_1 |   0.1724   0.3496   0.3496   0.4677   0.2896   0.2558   0.3191   0.1434   0.0039   0.0206   0.0405 
     Pm4_4_2 |   0.4019   0.2586   0.2586   0.3027   0.4220   0.3679   0.4778   0.1684   0.0775   0.1616   0.2077 
     Pm4_4_3 |   0.3596   0.2696   0.2696   0.2548   0.4992   0.5021   0.4921   0.1260   0.0330   0.1175   0.1688 
     Pm4_4_4 |   0.2970   0.2234   0.2234   0.2453   0.4636   0.4382   0.4999   0.1212   0.0374   0.1592   0.1662 
Pm17_1_1_s~e |   0.0697  -0.1196  -0.1196  -0.2129   0.0576  -0.0410  -0.0927  -0.1851  -0.0998  -0.0602  -0.0815 
Pm17_1_2_s~e |   0.1087  -0.0994  -0.0994  -0.1235  -0.0192  -0.0228  -0.1159  -0.0635  -0.0622  -0.0213  -0.1065 
Pm17_1_3_s~e |  -0.0422  -0.0265  -0.0265  -0.0694  -0.0700  -0.0421   0.0338  -0.0413   0.0655  -0.0999   0.0000 
Pm17_1_4_s~e |  -0.0232  -0.0153  -0.0153  -0.1555  -0.0810  -0.0539   0.0708   0.0223  -0.1042  -0.1306   0.0519 
Pm17_total~e |   0.0325  -0.1281  -0.1281  -0.2320  -0.0534  -0.0812  -0.0779  -0.1310  -0.0775  -0.1089  -0.0885 
    Pm17_2_2 |   0.1421   0.0664   0.0664  -0.0204   0.2048   0.1738   0.1697   0.0532  -0.0486  -0.0614   0.0391 
    Pm17_2_3 |   0.2253   0.0681   0.0681  -0.0575   0.1952   0.2907   0.1992   0.0044   0.0228  -0.1119  -0.0090 
    Pm17_2_4 |   0.2209   0.0472   0.0472  -0.0241   0.1387   0.2374   0.2495   0.0920   0.0131  -0.0081   0.0388 
    Pm17_2_5 |   0.2244   0.1224   0.1224   0.0694   0.2733   0.2160   0.2736   0.2090   0.0414   0.0608   0.0685 
    Pm17_3_1 |   0.1715   0.0377   0.0377   0.1569   0.1691   0.1416   0.2820   0.0379   0.0445   0.0421  -0.0161 
    Pm17_3_2 |   0.3257  -0.0583  -0.0583   0.1311   0.2758   0.1686   0.1952   0.0185  -0.0003  -0.0237  -0.0498 
    Pm17_3_3 |   0.0896   0.3270   0.3270   0.2180   0.1822   0.1597   0.0789   0.2430   0.1600   0.0769   0.2978 
    Pm17_3_4 |   0.0160   0.1675   0.1675   0.1296   0.1172   0.0942   0.0067   0.1689   0.0602  -0.0322   0.2059 
    Pm17_4_1 |   0.2501   0.1624   0.1624   0.3056   0.2163   0.2702   0.2879   0.1313   0.0296   0.0112   0.0463 
    Pm17_4_2 |   0.3848   0.1019   0.1019   0.2040   0.3694   0.2414   0.1906   0.1819   0.2224   0.2630   0.2134 
    Pm17_4_3 |   0.3220   0.0932   0.0932   0.1203   0.4921   0.4660   0.2485   0.1821   0.0449   0.1469   0.2126 
    Pm17_4_4 |   0.2760   0.2156   0.2156   0.0811   0.4097   0.2753   0.3936   0.1796  -0.0455   0.0644   0.1575 
completed_~t |        .        .        .        .        .        .        .        .        .        .        . 

             | Pm3_1_.. Pm3_1_.. Pm3_1_.. Pm3_1_.. Pm3_1_.. Pm3_1_.. Pm3_1_.. Pm3_1_.. Pm3_to~e  Pm3_2_1  Pm3_2_2
-------------+---------------------------------------------------------------------------------------------------
Pm3_1_1_sc~e |   1.0000 
Pm3_1_2_sc~e |  -0.0553   1.0000 
Pm3_1_3_sc~e |  -0.0605   0.1063   1.0000 
Pm3_1_4_1_~e |   0.0455   0.3173   0.1072   1.0000 
Pm3_1_4_2_~e |  -0.1410   0.2376  -0.0066   0.5058   1.0000 
Pm3_1_4_3_~e |  -0.0503   0.2479  -0.0943   0.5944   0.6801   1.0000 
Pm3_1_4_4_~e |  -0.1311   0.2591  -0.0771   0.6886   0.6368   0.6631   1.0000 
Pm3_1_5_sc~e |   0.0572  -0.0422   0.1364  -0.0012   0.0095   0.0334   0.0057   1.0000 
Pm3_total_~e |   0.2732   0.2665   0.6222   0.3956   0.2609   0.2671   0.2222   0.6782   1.0000 
     Pm3_2_1 |   0.1404   0.0657  -0.0546  -0.0757  -0.0561   0.0543   0.0126  -0.1021  -0.0264   1.0000 
     Pm3_2_2 |   0.2173   0.0679  -0.0309  -0.0508  -0.0027   0.0768  -0.0089   0.0160   0.0813   0.6904   1.0000 
     Pm3_2_3 |   0.0780  -0.0102  -0.0375  -0.0285   0.0881   0.1021   0.0454   0.0597   0.0611   0.5556   0.6410 
     Pm3_2_4 |   0.1178   0.0846   0.0192  -0.1090  -0.0619   0.0156  -0.0760  -0.1040  -0.0254   0.6960   0.7407 
     Pm3_2_5 |   0.0065  -0.0284   0.1292  -0.0694  -0.1446  -0.0479  -0.1401  -0.2039  -0.0766   0.2829   0.3212 
     Pm3_3_1 |   0.0005   0.1332  -0.0065  -0.0380  -0.0295   0.0209  -0.0545  -0.0923  -0.0438   0.2166   0.1256 
     Pm3_3_2 |   0.1476  -0.0394   0.0821  -0.0962  -0.0065   0.0368  -0.0561   0.0113   0.0699   0.2050   0.1660 
     Pm3_3_3 |   0.0793   0.0398   0.0120  -0.2598  -0.1216  -0.1308  -0.1407  -0.0216  -0.0439   0.0153  -0.0920 
     Pm3_3_4 |   0.0793   0.0398   0.0120  -0.2598  -0.1216  -0.1308  -0.1407  -0.0216  -0.0439   0.0153  -0.0920 
     Pm3_4_1 |  -0.0104   0.0929  -0.0430  -0.0095  -0.0338   0.0341  -0.0223  -0.0431  -0.0189   0.0923   0.0281 
     Pm3_4_2 |   0.0449   0.0593   0.0020   0.0418   0.0863   0.1347  -0.0078   0.0779   0.1183   0.2345   0.1660 
     Pm3_4_3 |   0.0418   0.0675   0.0437  -0.0202   0.0013   0.0158  -0.0411  -0.0972   0.0131   0.2495   0.2080 
     Pm3_4_4 |   0.0218   0.2059   0.0926   0.1283   0.1214   0.1076   0.1034  -0.1020   0.0753   0.1394   0.0825 
Pm4_1_1_sc~e |  -0.0449  -0.0226   0.1805   0.2579   0.1305  -0.0556  -0.0535  -0.1249   0.0861  -0.1075  -0.1031 
Pm4_1_2_sc~e |  -0.0316  -0.0159  -0.0716  -0.0501  -0.0405  -0.0391  -0.0377   0.1034  -0.0092  -0.0757  -0.0726 
Pm4_1_3_sc~e |  -0.0641  -0.0322   0.1569  -0.1016  -0.0822  -0.0793  -0.0764  -0.0813  -0.0210   0.1868   0.1447 
Pm4_1_4_sc~e |   0.0088  -0.0363   0.0507  -0.0703   0.0250   0.1517   0.0201   0.3454   0.2310  -0.0493   0.0405 
Pm4_total_~e |  -0.0298  -0.0548   0.1296  -0.0432   0.0247   0.1012  -0.0260   0.2854   0.2298  -0.0149   0.0590 
     Pm4_2_1 |   0.2330   0.0235   0.0068   0.0304  -0.1067  -0.0408  -0.0392  -0.0113   0.0535   0.5052   0.5078 
     Pm4_2_2 |   0.1597  -0.0083   0.0279   0.0638  -0.0804   0.0334  -0.0485   0.0658   0.0921   0.4907   0.5282 
     Pm4_2_3 |   0.2197  -0.0062   0.0848  -0.0139  -0.1225  -0.0594  -0.1438   0.0858   0.1277   0.5011   0.5626 
     Pm4_2_4 |   0.2478  -0.0892  -0.0560   0.1221   0.0170   0.1976   0.0895   0.0350   0.0915   0.4234   0.4295 
     Pm4_2_5 |   0.1986  -0.1233   0.0484  -0.0849  -0.0122   0.0333  -0.1541   0.0744   0.0851   0.4595   0.4915 
     Pm4_2_6 |   0.0474  -0.0276   0.1783  -0.1630  -0.1607  -0.1868  -0.2879  -0.2316  -0.0773   0.2325   0.2476 
     Pm4_3_1 |   0.0204   0.0597   0.0816  -0.0470  -0.0832  -0.1338  -0.1164   0.0110   0.0179   0.0520  -0.0746 
     Pm4_3_2 |   0.1717  -0.0106   0.0893  -0.0545  -0.1113  -0.1705  -0.1126   0.0291   0.0547   0.2132   0.1253 
     Pm4_3_3 |   0.0082   0.0553   0.0017  -0.1214  -0.0279  -0.1237  -0.1358  -0.0545  -0.0530   0.1080   0.0273 
     Pm4_3_4 |  -0.0009   0.0524   0.0396  -0.1405  -0.0409  -0.1396  -0.1517  -0.0256  -0.0238   0.0572   0.0067 
     Pm4_4_1 |  -0.1024  -0.0211   0.1120  -0.0088   0.0058  -0.0422  -0.0400   0.0103   0.0250   0.0325  -0.0172 
     Pm4_4_2 |   0.1263  -0.0058  -0.0689  -0.1182  -0.0576  -0.0528  -0.1492  -0.0901  -0.0737   0.2306   0.1788 
     Pm4_4_3 |   0.0051   0.0492   0.0473  -0.0671  -0.0149  -0.0354  -0.1267  -0.1143  -0.0306   0.1845   0.1648 
     Pm4_4_4 |   0.0518   0.0315   0.1328  -0.0880  -0.0188  -0.0903  -0.1284  -0.0965   0.0181   0.0962   0.1028 
Pm17_1_1_s~e |   0.0264   0.0834   0.0455   0.0805   0.0970   0.2528   0.1978   0.0597   0.1313   0.1699   0.1484 
Pm17_1_2_s~e |   0.1177   0.0693   0.0987   0.2184   0.0597   0.1363   0.1644   0.1657   0.2764   0.1266   0.1181 
Pm17_1_3_s~e |   0.0162   0.0185   0.2887  -0.0765  -0.0726  -0.0422  -0.0643   0.2136   0.2682   0.0303   0.0400 
Pm17_1_4_s~e |  -0.0503  -0.0684  -0.0409  -0.0286   0.1104   0.1967   0.0629   0.1363   0.0826   0.1910   0.1322 
Pm17_total~e |   0.0846   0.0684   0.2128   0.1246   0.0727   0.2159   0.1674   0.2578   0.3744   0.2021   0.1799 
    Pm17_2_2 |   0.1115  -0.0101  -0.0272  -0.0408   0.0440   0.1650  -0.0826   0.1772   0.1424   0.5008   0.5479 
    Pm17_2_3 |   0.1384   0.0884  -0.0629  -0.0552  -0.0347   0.0573  -0.0366   0.0202   0.0670   0.5823   0.5963 
    Pm17_2_4 |   0.0853   0.1140  -0.0966  -0.0302  -0.0173   0.0975  -0.0778   0.0978   0.0749   0.5733   0.5919 
    Pm17_2_5 |   0.0141  -0.0999  -0.0250  -0.0500  -0.0426   0.0351  -0.1022   0.0440   0.0126   0.5154   0.5138 
    Pm17_3_1 |   0.0539   0.0506   0.1036   0.0783  -0.0465  -0.0018  -0.0259   0.0355   0.0912   0.1978   0.1042 
    Pm17_3_2 |   0.0893  -0.0323   0.1191   0.0536  -0.0013  -0.0081   0.0130   0.0873   0.1324   0.2860   0.2079 
    Pm17_3_3 |  -0.0746   0.0362   0.0758  -0.2005  -0.1456  -0.2796  -0.2930   0.1162   0.0286   0.0943   0.0288 
    Pm17_3_4 |  -0.0976   0.0322   0.1451  -0.1333  -0.0520  -0.1959  -0.2064   0.1783   0.1081   0.0674  -0.0034 
    Pm17_4_1 |   0.0355   0.0714   0.2196   0.2404  -0.0229  -0.0654  -0.0580   0.0158   0.1634   0.0757   0.0385 
    Pm17_4_2 |   0.1282   0.0608   0.1801  -0.0571  -0.2132  -0.2217  -0.2539   0.0995   0.1490   0.1693   0.1717 
    Pm17_4_3 |  -0.0348   0.0870   0.0555  -0.0512  -0.0237  -0.0821  -0.1755  -0.0411   0.0166   0.1963   0.0614 
    Pm17_4_4 |   0.0816   0.0464   0.0432   0.0080   0.0677  -0.0351  -0.1188  -0.1491  -0.0020   0.2221   0.2098 
completed_~t |        .        .        .        .        .        .        .        .        .        .        . 

             |  Pm3_2_3  Pm3_2_4  Pm3_2_5  Pm3_3_1  Pm3_3_2  Pm3_3_3  Pm3_3_4  Pm3_4_1  Pm3_4_2  Pm3_4_3  Pm3_4_4
-------------+---------------------------------------------------------------------------------------------------
     Pm3_2_3 |   1.0000 
     Pm3_2_4 |   0.6328   1.0000 
     Pm3_2_5 |   0.2107   0.3286   1.0000 
     Pm3_3_1 |   0.0366   0.1253   0.3024   1.0000 
     Pm3_3_2 |   0.1739   0.2158   0.2067   0.6778   1.0000 
     Pm3_3_3 |  -0.0398  -0.0807   0.2776   0.3396   0.3995   1.0000 
     Pm3_3_4 |  -0.0398  -0.0807   0.2776   0.3396   0.3995   1.0000   1.0000 
     Pm3_4_1 |   0.2028   0.0249   0.2999   0.4135   0.5023   0.4976   0.4976   1.0000 
     Pm3_4_2 |   0.1400   0.1030   0.1589   0.4718   0.4855   0.4056   0.4056   0.4601   1.0000 
     Pm3_4_3 |   0.2124   0.1794   0.1739   0.4510   0.5370   0.3398   0.3398   0.4625   0.6351   1.0000 
     Pm3_4_4 |   0.1619   0.0883   0.2362   0.4119   0.4063   0.3261   0.3261   0.3575   0.4913   0.6395   1.0000 
Pm4_1_1_sc~e |  -0.0895  -0.0947   0.0559  -0.1294  -0.1101   0.0324   0.0324  -0.0341   0.1304   0.0765   0.0685 
Pm4_1_2_sc~e |   0.1085  -0.0666  -0.1275  -0.0911  -0.0775   0.0228   0.0228  -0.0240  -0.0818   0.0539  -0.0932 
Pm4_1_3_sc~e |   0.0780   0.0754   0.0263   0.1545   0.0937   0.0462   0.0462  -0.0487   0.1862   0.1092   0.0977 
Pm4_1_4_sc~e |   0.0270   0.0306  -0.3434  -0.0958  -0.0085  -0.0304  -0.0304  -0.1222  -0.0229  -0.0612  -0.0663 
Pm4_total_~e |   0.0577   0.0266  -0.3240  -0.0951  -0.0254  -0.0021  -0.0021  -0.1489   0.0565   0.0053  -0.0329 
     Pm4_2_1 |   0.4418   0.4684   0.2391  -0.0135  -0.0310   0.0287   0.0287  -0.0312   0.0392   0.0709   0.0591 
     Pm4_2_2 |   0.4670   0.4229   0.2838   0.1104   0.1763   0.1143   0.1143   0.2361   0.1997   0.2470   0.1935 
     Pm4_2_3 |   0.3923   0.4802   0.2604   0.1036   0.1597   0.0361   0.0361   0.0493   0.1607   0.2244   0.1016 
     Pm4_2_4 |   0.6132   0.3870   0.2661   0.0789   0.2704   0.1106   0.1106   0.3184   0.1668   0.2205   0.2258 
     Pm4_2_5 |   0.4641   0.4951   0.2822   0.1052   0.1965   0.0535   0.0535   0.0594   0.1293   0.1434   0.1309 
     Pm4_2_6 |   0.1714   0.2943   0.8505   0.2237   0.1880   0.2749   0.2749   0.2638   0.1351   0.1946   0.2843 
     Pm4_3_1 |   0.0472  -0.0092   0.1650   0.4780   0.4071   0.3161   0.3161   0.3096   0.3817   0.4031   0.3896 
     Pm4_3_2 |   0.1107   0.2091   0.1896   0.3890   0.5747   0.3098   0.3098   0.3259   0.4291   0.4816   0.3539 
     Pm4_3_3 |   0.0062   0.0818   0.3778   0.3447   0.2721   0.5991   0.5991   0.3479   0.3254   0.2209   0.2202 
     Pm4_3_4 |   0.0387   0.0648   0.4209   0.3296   0.3076   0.6267   0.6267   0.4217   0.3124   0.2446   0.2422 
     Pm4_4_1 |   0.1243   0.0032   0.2729   0.3261   0.3598   0.3519   0.3519   0.5841   0.3533   0.2935   0.1985 
     Pm4_4_2 |   0.2138   0.2241   0.1222   0.5364   0.6173   0.3092   0.3092   0.4263   0.5463   0.5365   0.4009 
     Pm4_4_3 |   0.1718   0.1625   0.2699   0.4348   0.5031   0.3108   0.3108   0.3745   0.5166   0.6844   0.5930 
     Pm4_4_4 |   0.1685   0.1670   0.2856   0.4938   0.5554   0.2999   0.2999   0.3719   0.3707   0.5296   0.6408 
Pm17_1_1_s~e |   0.1285   0.1376  -0.1078  -0.0074   0.0402  -0.0100  -0.0100  -0.0401  -0.0018  -0.0201  -0.0025 
Pm17_1_2_s~e |   0.0186   0.0013  -0.1346  -0.0031   0.0266  -0.0216  -0.0216  -0.0431   0.1108   0.1232   0.0630 
Pm17_1_3_s~e |   0.0061   0.0587   0.3078   0.0270  -0.0358   0.0530   0.0530   0.0114  -0.0217  -0.0621   0.0819 
Pm17_1_4_s~e |   0.1656   0.1034  -0.1283   0.0659   0.1509  -0.1308  -0.1308   0.0964   0.0413   0.0325  -0.0786 
Pm17_total~e |   0.0969   0.0964   0.0006   0.0031   0.0338  -0.0493  -0.0493  -0.0429   0.0343   0.0281   0.0625 
    Pm17_2_2 |   0.5237   0.4735   0.2124   0.1335   0.1803  -0.0327  -0.0327   0.1706   0.2215   0.1319  -0.0367 
    Pm17_2_3 |   0.4826   0.5254   0.3672   0.1157   0.1197   0.0058   0.0058   0.1321   0.2446   0.3100   0.1162 
    Pm17_2_4 |   0.4348   0.5206   0.2706   0.2339   0.2374   0.0462   0.0462   0.2035   0.3193   0.2713   0.1200 
    Pm17_2_5 |   0.4142   0.5412   0.3591   0.2157   0.2083   0.0190   0.0190   0.1871   0.1826   0.2097   0.0427 
    Pm17_3_1 |   0.0912   0.0995   0.1611   0.5077   0.3518   0.0781   0.0781   0.0949   0.2817   0.2786   0.2593 
    Pm17_3_2 |   0.2626   0.2703  -0.0024   0.2671   0.5140  -0.0133  -0.0133   0.2341   0.3204   0.4757   0.2976 
    Pm17_3_3 |   0.0944   0.0944   0.2905   0.3222   0.3088   0.5259   0.5259   0.3366   0.3155   0.2538   0.1849 
    Pm17_3_4 |   0.0736   0.0719   0.2586   0.2704   0.2559   0.3851   0.3851   0.2591   0.2624   0.1970   0.1246 
    Pm17_4_1 |   0.1771   0.0981   0.2111   0.3390   0.2996   0.1541   0.1541   0.4491   0.2338   0.3275   0.2694 
    Pm17_4_2 |   0.1559   0.2113   0.1040   0.3609   0.5146   0.0702   0.0702   0.2556   0.4863   0.5280   0.3822 
    Pm17_4_3 |   0.1188   0.1910   0.0458   0.3949   0.4828   0.1302   0.1302   0.2339   0.4441   0.6917   0.4338 
    Pm17_4_4 |   0.2750   0.1950   0.2202   0.3336   0.4656   0.1668   0.1668   0.3273   0.2770   0.4455   0.5440 
completed_~t |        .        .        .        .        .        .        .        .        .        .        . 

             | Pm4_1_.. Pm4_1_.. Pm4_1_.. Pm4_1_.. Pm4_to~e  Pm4_2_1  Pm4_2_2  Pm4_2_3  Pm4_2_4  Pm4_2_5  Pm4_2_6
-------------+---------------------------------------------------------------------------------------------------
Pm4_1_1_sc~e |   1.0000 
Pm4_1_2_sc~e |  -0.0129   1.0000 
Pm4_1_3_sc~e |  -0.0262  -0.0184   1.0000 
Pm4_1_4_sc~e |  -0.1204  -0.0848  -0.0745   1.0000 
Pm4_total_~e |   0.1337   0.0941   0.2385   0.8951   1.0000 
     Pm4_2_1 |  -0.0763  -0.0537  -0.0068  -0.0679  -0.0941   1.0000 
     Pm4_2_2 |  -0.0931  -0.0656   0.0521  -0.1942  -0.2017   0.6582   1.0000 
     Pm4_2_3 |  -0.0911  -0.0641   0.0867  -0.0800  -0.0764   0.6575   0.7761   1.0000 
     Pm4_2_4 |  -0.0725  -0.0511   0.0010   0.0213  -0.0026   0.5290   0.6769   0.5651   1.0000 
     Pm4_2_5 |  -0.1002  -0.0706   0.0654  -0.0488  -0.0566   0.4682   0.6405   0.7086   0.5224   1.0000 
     Pm4_2_6 |   0.1435  -0.1263   0.0896  -0.3141  -0.2490   0.2251   0.2556   0.2401   0.1949   0.3098   1.0000 
     Pm4_3_1 |   0.0094  -0.1669  -0.0327  -0.0890  -0.1123   0.0346   0.1056   0.0845   0.1196   0.0702   0.1677 
     Pm4_3_2 |  -0.0867  -0.1667   0.0293  -0.1133  -0.1386   0.1516   0.2809   0.2870   0.1723   0.1581   0.2318 
     Pm4_3_3 |   0.0449  -0.2902  -0.0991  -0.1340  -0.1830   0.1066   0.0794   0.1287   0.0393   0.0487   0.3736 
     Pm4_3_4 |   0.0426  -0.3030  -0.1080  -0.1638  -0.2173   0.0943   0.1169   0.1141   0.0868   0.0801   0.4167 
     Pm4_4_1 |  -0.0171  -0.2031  -0.1213  -0.1351  -0.2005  -0.0575   0.2023   0.0705   0.2075   0.0910   0.2012 
     Pm4_4_2 |   0.0340  -0.1667   0.0761  -0.0166   0.0051   0.0167   0.1872   0.1602   0.2170   0.2136   0.1809 
     Pm4_4_3 |   0.1131  -0.1625   0.0387  -0.0560  -0.0261   0.0446   0.1738   0.1641   0.1643   0.1493   0.3210 
     Pm4_4_4 |   0.0904  -0.1543   0.0186  -0.0963  -0.0782  -0.0451   0.1222   0.0846   0.1706   0.1603   0.3028 
Pm17_1_1_s~e |  -0.0576  -0.0405   0.1862   0.2265   0.2468   0.0403   0.0325   0.0065   0.1123  -0.0045  -0.1780 
Pm17_1_2_s~e |   0.1469  -0.0879   0.1127   0.0541   0.1070   0.1528   0.2042   0.2013   0.0462   0.0421  -0.1948 
Pm17_1_3_s~e |  -0.0313  -0.1199   0.0545   0.2228   0.2007   0.0391   0.0027   0.0525   0.0179   0.1876   0.2926 
Pm17_1_4_s~e |  -0.0556  -0.0391  -0.0793   0.1517   0.1012  -0.1636  -0.0682  -0.1610   0.0708  -0.1204  -0.1868 
Pm17_total~e |   0.0267  -0.1408   0.1364   0.2799   0.2910   0.0747   0.1240   0.0989   0.1170   0.1008  -0.0756 
    Pm17_2_2 |  -0.0884   0.1071   0.0780  -0.0345  -0.0026   0.3390   0.5126   0.5504   0.4618   0.5549   0.1536 
    Pm17_2_3 |   0.0000   0.0727  -0.1228  -0.0848  -0.1079   0.4310   0.4832   0.4896   0.4401   0.4306   0.2942 
    Pm17_2_4 |  -0.0910  -0.0641   0.0667  -0.0510  -0.0553   0.4425   0.5969   0.6519   0.4790   0.5375   0.1929 
    Pm17_2_5 |   0.0508  -0.0572  -0.0217  -0.0690  -0.0676   0.3945   0.5755   0.5611   0.5348   0.6225   0.2657 
    Pm17_3_1 |  -0.1235  -0.0869  -0.0458  -0.1333  -0.1795   0.0972   0.1900   0.2045   0.1061   0.2207   0.1226 
    Pm17_3_2 |  -0.1098  -0.0773  -0.0673  -0.0422  -0.1022   0.1984   0.3645   0.3903   0.2742   0.3029   0.0233 
    Pm17_3_3 |   0.0294   0.0207   0.0420  -0.1560  -0.1278   0.1224   0.1249   0.2067   0.0973   0.2152   0.2875 
    Pm17_3_4 |   0.0262   0.0184   0.0374  -0.1201  -0.0954   0.1089   0.1060   0.1969   0.0826   0.2033   0.2560 
    Pm17_4_1 |   0.1107  -0.0332  -0.0674  -0.1641  -0.1596   0.0745   0.2387   0.1701   0.2274   0.1309   0.1892 
    Pm17_4_2 |   0.0072   0.0942   0.1910  -0.0925  -0.0097   0.1190   0.2690   0.3441   0.1938   0.2563   0.1890 
    Pm17_4_3 |   0.1002   0.0706   0.1431  -0.0215   0.0644   0.0271   0.0960   0.1531   0.0685   0.1621   0.1323 
    Pm17_4_4 |   0.1041  -0.0669   0.0323  -0.2181  -0.1725   0.1053   0.2058   0.1857   0.2356   0.2739   0.2999 
completed_~t |        .        .        .        .        .        .        .        .        .        .        . 

             |  Pm4_3_1  Pm4_3_2  Pm4_3_3  Pm4_3_4  Pm4_4_1  Pm4_4_2  Pm4_4_3  Pm4_4_4 Pm17_1.. Pm17_1.. Pm17_1..
-------------+---------------------------------------------------------------------------------------------------
     Pm4_3_1 |   1.0000 
     Pm4_3_2 |   0.6391   1.0000 
     Pm4_3_3 |   0.5540   0.5491   1.0000 
     Pm4_3_4 |   0.5507   0.5500   0.9578   1.0000 
     Pm4_4_1 |   0.5221   0.5175   0.5929   0.6704   1.0000 
     Pm4_4_2 |   0.6175   0.6591   0.5482   0.5501   0.5392   1.0000 
     Pm4_4_3 |   0.5232   0.5711   0.4954   0.5364   0.3787   0.7342   1.0000 
     Pm4_4_4 |   0.5443   0.5465   0.4739   0.5093   0.4725   0.6679   0.7132   1.0000 
Pm17_1_1_s~e |  -0.1309  -0.0801  -0.1968  -0.2157  -0.1477  -0.0719  -0.0772  -0.0885   1.0000 
Pm17_1_2_s~e |  -0.0517   0.0438   0.0005  -0.0256  -0.0282   0.0507   0.1541   0.0090   0.1601   1.0000 
Pm17_1_3_s~e |   0.0170  -0.1245   0.0485   0.0727   0.0495  -0.0781   0.0019   0.0565  -0.0213   0.1023   1.0000 
Pm17_1_4_s~e |  -0.1089  -0.1261  -0.1237  -0.1396   0.0124   0.0790   0.0560   0.0668   0.1816   0.0849  -0.0422 
Pm17_total~e |  -0.1157  -0.1223  -0.1086  -0.1250  -0.0726  -0.0300   0.0738   0.0298   0.4717   0.6974   0.5505 
    Pm17_2_2 |   0.0155   0.1325   0.0592   0.0428   0.1306   0.1800   0.0890   0.0505   0.1722   0.1490   0.1029 
    Pm17_2_3 |   0.0356   0.2166   0.1317   0.0858   0.0469   0.1921   0.1659   0.1500   0.0225   0.0983   0.1359 
    Pm17_2_4 |   0.1331   0.2964   0.2068   0.1602   0.1513   0.2830   0.2400   0.1812   0.0783   0.1752   0.0170 
    Pm17_2_5 |   0.1422   0.2161   0.1480   0.1362   0.2065   0.2769   0.1455   0.1642   0.0192   0.0660   0.0856 
    Pm17_3_1 |   0.5752   0.4612   0.2798   0.2637   0.3804   0.4100   0.3179   0.4036  -0.2088   0.0162   0.0357 
    Pm17_3_2 |   0.3897   0.6316   0.1237   0.1575   0.3370   0.4028   0.4196   0.4085  -0.1257   0.1154  -0.0828 
    Pm17_3_3 |   0.3800   0.3796   0.6610   0.6901   0.4626   0.3796   0.3701   0.3515  -0.2727   0.0243   0.0972 
    Pm17_3_4 |   0.3384   0.3380   0.5885   0.6145   0.4119   0.3380   0.3296   0.3130  -0.3204  -0.0157   0.1439 
    Pm17_4_1 |   0.4294   0.3649   0.3568   0.3593   0.5914   0.3908   0.3571   0.4316  -0.1805   0.0705   0.1717 
    Pm17_4_2 |   0.3786   0.5663   0.1360   0.1688   0.2749   0.6036   0.5440   0.4615  -0.1699   0.1308  -0.0036 
    Pm17_4_3 |   0.2975   0.4203   0.1419   0.1679   0.1650   0.5361   0.6522   0.5061  -0.0874   0.2283  -0.0700 
    Pm17_4_4 |   0.3527   0.3979   0.3229   0.3815   0.2554   0.5600   0.6690   0.6607  -0.1713   0.0465  -0.0062 
completed_~t |        .        .        .        .        .        .        .        .        .        .        . 

             | Pm17_1.. Pm17_t~e Pm17_2_2 Pm17_2_3 Pm17_2_4 Pm17_2_5 Pm17_3_1 Pm17_3_2 Pm17_3_3 Pm17_3_4 Pm17_4_1
-------------+---------------------------------------------------------------------------------------------------
Pm17_1_4_s~e |   1.0000 
Pm17_total~e |   0.4234   1.0000 
    Pm17_2_2 |   0.1199   0.2220   1.0000 
    Pm17_2_3 |   0.0426   0.1390   0.6020   1.0000 
    Pm17_2_4 |   0.0440   0.1372   0.7734   0.7242   1.0000 
    Pm17_2_5 |   0.0697   0.1084   0.7199   0.6582   0.7784   1.0000 
    Pm17_3_1 |  -0.0454  -0.0541   0.1026   0.1105   0.1690   0.1871   1.0000 
    Pm17_3_2 |   0.1121   0.0081   0.2490   0.2273   0.3343   0.3071   0.5671   1.0000 
    Pm17_3_3 |  -0.1548  -0.1134   0.1782   0.1877   0.2529   0.2550   0.3639   0.2871   1.0000 
    Pm17_3_4 |  -0.0583  -0.0865   0.1664   0.1719   0.2479   0.2536   0.3593   0.3647   0.8985   1.0000 
    Pm17_4_1 |   0.0453   0.0591   0.2393   0.1279   0.2755   0.2504   0.4046   0.4144   0.4234   0.4509   1.0000 
    Pm17_4_2 |  -0.0520  -0.0040   0.1956   0.2242   0.2494   0.2772   0.4140   0.5854   0.3678   0.3650   0.3736 
    Pm17_4_3 |   0.0530   0.0675   0.0886   0.2229   0.1951   0.1816   0.3864   0.5193   0.3924   0.3493   0.2925 
    Pm17_4_4 |   0.0874  -0.0151   0.1407   0.2316   0.2274   0.2390   0.3211   0.4270   0.3554   0.3164   0.2727 
completed_~t |        .        .        .        .        .        .        .        .        .        .        . 

             | Pm17_4_2 Pm17_4_3 Pm17_4_4 comple~t
-------------+------------------------------------
    Pm17_4_2 |   1.0000 
    Pm17_4_3 |   0.6644   1.0000 
    Pm17_4_4 |   0.4901   0.5721   1.0000 
completed_~t |        .        .        .        . 

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. exit, clear
