-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Ronald Munjoma\Documents\chips-analysis\data\chips_analysis.log
  log type:  text
 opened on:  18 Jan 2021, 22:11:14

. 
. clear

. 
. cd "C:\Users\Ronald Munjoma\Documents\chips-analysis\data"
C:\Users\Ronald Munjoma\Documents\chips-analysis\data

. ******************************************************************
. *LOAD LATEST DATA
. use chips_cleaned, clear
(This file contains CHIPS STRIPE HIV data)

. 
. * Data Analysis only for subject with non-missing values *
. keep if m1_total_score~=. & m3_total_score~=. & m4_total_score~=. & m17_total_score~=. & Pm1_total_score~=. & Pm3_total_score~=. & Pm4_total_score~=. & Pm17_total_sc
> ore~=.
(94 observations deleted)

. 
. * Create Tables
. *descriptive statistics
. 
. * check out these commands
. *tab m1_total_score, chi2
. 
. *Clinical Site by Profession Category
. *pre-test - total survey
. tab clinical_site profession_category, row nokey

  Partner or Clinical |               Health Profession Category
                 Site | Laborat..    Medical  Nursing..      Other   Pharmacy |     Total
----------------------+-------------------------------------------------------+----------
       Gweru Hospital |         1          3          4          1          0 |         9 
                      |     11.11      33.33      44.44      11.11       0.00 |    100.00 
----------------------+-------------------------------------------------------+----------
      Harare Hospital |         3          2         12          4          0 |        21 
                      |     14.29       9.52      57.14      19.05       0.00 |    100.00 
----------------------+-------------------------------------------------------+----------
      Howard Hospital |         0          4          6          1          0 |        11 
                      |      0.00      36.36      54.55       9.09       0.00 |    100.00 
----------------------+-------------------------------------------------------+----------
       Mpilo Hospital |         0          3          1          1          2 |         7 
                      |      0.00      42.86      14.29      14.29      28.57 |    100.00 
----------------------+-------------------------------------------------------+----------
Parirenyatwa Hospital |         2         28         31          1          0 |        62 
                      |      3.23      45.16      50.00       1.61       0.00 |    100.00 
----------------------+-------------------------------------------------------+----------
              UNKNOWN |         0          1          0          0          1 |         2 
                      |      0.00      50.00       0.00       0.00      50.00 |    100.00 
----------------------+-------------------------------------------------------+----------
                Total |         6         41         54          8          3 |       112 
                      |      5.36      36.61      48.21       7.14       2.68 |    100.00 


. 
. *Clinical Site by Training levels
. *pre-test - total survey
. tab clinical_site training_level, row nokey

  Partner or Clinical |    Training Level
                 Site | Post-gr..  Pre-ser.. |     Total
----------------------+----------------------+----------
       Gweru Hospital |         0          9 |         9 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
      Harare Hospital |         0         21 |        21 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
      Howard Hospital |         0         11 |        11 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
       Mpilo Hospital |         0          7 |         7 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
Parirenyatwa Hospital |         0         62 |        62 
                      |      0.00     100.00 |    100.00 
----------------------+----------------------+----------
              UNKNOWN |         1          1 |         2 
                      |     50.00      50.00 |    100.00 
----------------------+----------------------+----------
                Total |         1        111 |       112 
                      |      0.89      99.11 |    100.00 


. 
. *Trainne characteristics by gender
. *training_level
. tab training_level gender, row nokey

                      |              Gender
       Training Level |    Female       Male      Other |     Total
----------------------+---------------------------------+----------
Post-graduate
(beyo.. |         1          0          0 |         1 
                      |    100.00       0.00       0.00 |    100.00 
----------------------+---------------------------------+----------
  Pre-service
Student |        57         41         13 |       111 
                      |     51.35      36.94      11.71 |    100.00 
----------------------+---------------------------------+----------
                Total |        58         41         13 |       112 
                      |     51.79      36.61      11.61 |    100.00 


. *clinical_site
. tab clinical_site gender, row nokey

  Partner or Clinical |              Gender
                 Site |    Female       Male      Other |     Total
----------------------+---------------------------------+----------
       Gweru Hospital |         5          4          0 |         9 
                      |     55.56      44.44       0.00 |    100.00 
----------------------+---------------------------------+----------
      Harare Hospital |        14          7          0 |        21 
                      |     66.67      33.33       0.00 |    100.00 
----------------------+---------------------------------+----------
      Howard Hospital |         7          4          0 |        11 
                      |     63.64      36.36       0.00 |    100.00 
----------------------+---------------------------------+----------
       Mpilo Hospital |         3          4          0 |         7 
                      |     42.86      57.14       0.00 |    100.00 
----------------------+---------------------------------+----------
Parirenyatwa Hospital |        27         22         13 |        62 
                      |     43.55      35.48      20.97 |    100.00 
----------------------+---------------------------------+----------
              UNKNOWN |         2          0          0 |         2 
                      |    100.00       0.00       0.00 |    100.00 
----------------------+---------------------------------+----------
                Total |        58         41         13 |       112 
                      |     51.79      36.61      11.61 |    100.00 


. *Profession_categoty
. tab profession_category gender, row nokey

Health Profession |              Gender
         Category |    Female       Male      Other |     Total
------------------+---------------------------------+----------
       Laboratory |         3          3          0 |         6 
                  |     50.00      50.00       0.00 |    100.00 
------------------+---------------------------------+----------
          Medical |        12         21          8 |        41 
                  |     29.27      51.22      19.51 |    100.00 
------------------+---------------------------------+----------
Nursing/midwifery |        38         11          5 |        54 
                  |     70.37      20.37       9.26 |    100.00 
------------------+---------------------------------+----------
            Other |         3          5          0 |         8 
                  |     37.50      62.50       0.00 |    100.00 
------------------+---------------------------------+----------
         Pharmacy |         2          1          0 |         3 
                  |     66.67      33.33       0.00 |    100.00 
------------------+---------------------------------+----------
            Total |        58         41         13 |       112 
                  |     51.79      36.61      11.61 |    100.00 


. 
. 
. *dependent ttest pre post multiple questions
. *Module 1 ttest
. ttest Pm1_total_score=m1_total_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm1_to~e |     112      96.875    .7847613    8.305132    95.31994    98.43006
m1_tot~e |     112    91.74107    1.322252     13.9934    89.12094     94.3612
---------+--------------------------------------------------------------------
    diff |     112    5.133929    1.387194    14.68068    2.385111    7.882746
------------------------------------------------------------------------------
     mean(diff) = mean(Pm1_total_score - m1_total_score)          t =   3.7009
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.9998         Pr(|T| > |t|) = 0.0003          Pr(T > t) = 0.0002

. 
. *Module 3 ttest
. ttest Pm3_total_score=m3_total_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm3_to~e |     112    77.92411    1.668844    17.66138    74.61718    81.23103
m3_tot~e |     112    59.21875      2.2576    23.89219    54.74516    63.69234
---------+--------------------------------------------------------------------
    diff |     112    18.70536    2.173634    23.00358    14.39816    23.01256
------------------------------------------------------------------------------
     mean(diff) = mean(Pm3_total_score - m3_total_score)          t =   8.6056
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. 
. *Module 4 ttest
. ttest Pm4_total_score=m4_total_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm4_to~e |     112        87.5     1.22809    12.99688    85.06646    89.93354
m4_tot~e |     112    79.91071    1.481848    15.68241    76.97433     82.8471
---------+--------------------------------------------------------------------
    diff |     112    7.589286    1.580353    16.72488    4.457711    10.72086
------------------------------------------------------------------------------
     mean(diff) = mean(Pm4_total_score - m4_total_score)          t =   4.8023
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. 
. *Module 17 ttest
. ttest Pm17_total_score=m17_total_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm17_t~e |     112    65.84821    2.242075    23.72789    61.40539    70.29104
m17_to~e |     112    39.28571    2.167252    22.93604    34.99116    43.58027
---------+--------------------------------------------------------------------
    diff |     112     26.5625    2.378846    25.17534    21.84866    31.27634
------------------------------------------------------------------------------
     mean(diff) = mean(Pm17_total_score - m17_total_score)        t =  11.1661
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. 
. *Individual question ttest
. *Module 1 ttest
. ttest Pm1_1_1_score=m1_1_1_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm1_1_.. |     112    .9821429    .0125699    .1330273    .9572348    1.007051
m1_1_1~e |     112    .8482143     .034057    .3604257     .780728    .9157006
---------+--------------------------------------------------------------------
    diff |     112    .1339286    .0347253    .3674979    .0651181     .202739
------------------------------------------------------------------------------
     mean(diff) = mean(Pm1_1_1_score - m1_1_1_score)              t =   3.8568
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.9999         Pr(|T| > |t|) = 0.0002          Pr(T > t) = 0.0001

. ttest Pm1_1_2_score=m1_1_2_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm1_1_.. |     112    .9642857    .0176142    .1864109     .929382    .9991894
m1_1_2~e |     112    .9821429    .0125699    .1330273    .9572348    1.007051
---------+--------------------------------------------------------------------
    diff |     112   -.0178571    .0178571    .1889822   -.0532423     .017528
------------------------------------------------------------------------------
     mean(diff) = mean(Pm1_1_2_score - m1_1_2_score)              t =  -1.0000
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.1597         Pr(|T| > |t|) = 0.3195          Pr(T > t) = 0.8403

. ttest Pm1_1_3_score=m1_1_3_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm1_1_.. |     112    .9464286    .0213722     .226182    .9040781     .988779
m1_1_3~e |     112    .9107143    .0270658    .2864373    .8570816    .9643469
---------+--------------------------------------------------------------------
    diff |     112    .0357143    .0281582    .2979985   -.0200831    .0915117
------------------------------------------------------------------------------
     mean(diff) = mean(Pm1_1_3_score - m1_1_3_score)              t =   1.2683
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.8963         Pr(|T| > |t|) = 0.2073          Pr(T > t) = 0.1037

. ttest Pm1_1_4_score=m1_1_4_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm1_1_.. |     112    .9821429    .0125699    .1330273    .9572348    1.007051
m1_1_4~e |     112    .9285714    .0244446    .2586969    .8801329    .9770099
---------+--------------------------------------------------------------------
    diff |     112    .0535714     .027902    .2952869   -.0017182    .1088611
------------------------------------------------------------------------------
     mean(diff) = mean(Pm1_1_4_score - m1_1_4_score)              t =   1.9200
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.9713         Pr(|T| > |t|) = 0.0574          Pr(T > t) = 0.0287

. 
. *Module 3 ttest
. ttest Pm3_1_1_score=m3_1_1_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm3_1_.. |     112    .9017857    .0282473    .2989417    .8458117    .9577597
m3_1_1~e |     112    .7767857     .039523    .4182723    .6984682    .8551032
---------+--------------------------------------------------------------------
    diff |     112        .125     .036154    .3826178    .0533585    .1966415
------------------------------------------------------------------------------
     mean(diff) = mean(Pm3_1_1_score - m3_1_1_score)              t =   3.4574
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.9996         Pr(|T| > |t|) = 0.0008          Pr(T > t) = 0.0004

. ttest Pm3_1_2_score=m3_1_2_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm3_1_.. |     112    .9732143    .0153248    .1621823    .9428472    1.003581
m3_1_2~e |     112    .8928571     .029357    .3106849    .8346844    .9510299
---------+--------------------------------------------------------------------
    diff |     112    .0803571    .0338879    .3586359     .013206    .1475083
------------------------------------------------------------------------------
     mean(diff) = mean(Pm3_1_2_score - m3_1_2_score)              t =   2.3713
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.9903         Pr(|T| > |t|) = 0.0195          Pr(T > t) = 0.0097

. ttest Pm3_1_3_score=m3_1_3_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm3_1_.. |     112    .6428571    .0454796     .481311    .5527363     .732978
m3_1_3~e |     112    .3839286    .0461614    .4885267    .2924566    .4754005
---------+--------------------------------------------------------------------
    diff |     112    .2589286    .0604913    .6401793    .1390611     .378796
------------------------------------------------------------------------------
     mean(diff) = mean(Pm3_1_3_score - m3_1_3_score)              t =   4.2804
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm3_1_4_1_score=m3_1_4_1_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm3_1_.. |     112     .203125    .0120875    .1279219    .1791728    .2270772
m3_1_4.. |     112    .1272321    .0141792    .1500583    .0991352    .1553291
---------+--------------------------------------------------------------------
    diff |     112    .0758929    .0133929    .1417367     .049354    .1024317
------------------------------------------------------------------------------
     mean(diff) = mean(Pm3_1_4_1_score - m3_1_4_1_score)          t =   5.6667
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm3_1_4_2_score=m3_1_4_2_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm3_1_.. |     112      .21875    .0110414    .1168515    .1968707    .2406293
m3_1_4.. |     112    .1495536    .0139879    .1480345    .1218355    .1772716
---------+--------------------------------------------------------------------
    diff |     112    .0691964    .0127666    .1351085    .0438987    .0944942
------------------------------------------------------------------------------
     mean(diff) = mean(Pm3_1_4_2_score - m3_1_4_2_score)          t =   5.4201
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm3_1_4_3_score=m3_1_4_3_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm3_1_.. |     112    .2209821    .0108673    .1150085    .1994479    .2425164
m3_1_4.. |     112    .1517857     .013951    .1476434    .1241409    .1794305
---------+--------------------------------------------------------------------
    diff |     112    .0691964    .0123665    .1308747    .0446914    .0937015
------------------------------------------------------------------------------
     mean(diff) = mean(Pm3_1_4_3_score - m3_1_4_3_score)          t =   5.5955
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm3_1_4_4_score=m3_1_4_4_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm3_1_.. |     112    .2232143    .0106861     .113091    .2020391    .2443895
m3_1_4.. |     112    .1540179    .0139107    .1472172    .1264528    .1815829
---------+--------------------------------------------------------------------
    diff |     112    .0691964    .0115248    .1219669    .0463593    .0920336
------------------------------------------------------------------------------
     mean(diff) = mean(Pm3_1_4_4_score - m3_1_4_4_score)          t =   6.0041
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm3_1_5_score=m3_1_5_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm3_1_.. |     112    .5357143    .0473367    .5009643    .4419135    .6295151
m3_1_5~e |     112    .3482143    .0452183    .4785455    .2586112    .4378174
---------+--------------------------------------------------------------------
    diff |     112       .1875    .0466566    .4937675    .0950468    .2799532
------------------------------------------------------------------------------
     mean(diff) = mean(Pm3_1_5_score - m3_1_5_score)              t =   4.0187
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.9999         Pr(|T| > |t|) = 0.0001          Pr(T > t) = 0.0001

. 
. *Module 4 ttest
. ttest Pm4_1_1_score=m4_1_1_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm4_1_.. |     112    .9821429    .0125699    .1330273    .9572348    1.007051
m4_1_1~e |     112    .8392857    .0348595    .3689179    .7702094    .9083621
---------+--------------------------------------------------------------------
    diff |     112    .1428571    .0377478    .3994849    .0680574    .2176569
------------------------------------------------------------------------------
     mean(diff) = mean(Pm4_1_1_score - m4_1_1_score)              t =   3.7845
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.9999         Pr(|T| > |t|) = 0.0003          Pr(T > t) = 0.0001

. ttest Pm4_1_2_score=m4_1_2_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm4_1_.. |     112    .9910714    .0089286    .0944911    .9733789    1.008764
m4_1_2~e |     112    .9732143    .0153248    .1621823    .9428472    1.003581
---------+--------------------------------------------------------------------
    diff |     112    .0178571    .0178571    .1889822    -.017528    .0532423
------------------------------------------------------------------------------
     mean(diff) = mean(Pm4_1_2_score - m4_1_2_score)              t =   1.0000
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.8403         Pr(|T| > |t|) = 0.3195          Pr(T > t) = 0.1597

. ttest Pm4_1_3_score=m4_1_3_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm4_1_.. |     112    .9642857    .0176142    .1864109     .929382    .9991894
m4_1_3~e |     112    .9553571    .0196019    .2074466    .9165147    .9941995
---------+--------------------------------------------------------------------
    diff |     112    .0089286    .0200367    .2120486   -.0307755    .0486326
------------------------------------------------------------------------------
     mean(diff) = mean(Pm4_1_3_score - m4_1_3_score)              t =   0.4456
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.6716         Pr(|T| > |t|) = 0.6567          Pr(T > t) = 0.3284

. ttest Pm4_1_4_score=m4_1_4_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm4_1_.. |     112       .5625    .0470857    .4983079    .4691966    .6558034
m4_1_4~e |     112    .4285714    .0469711    .4970958     .335495    .5216479
---------+--------------------------------------------------------------------
    diff |     112    .1339286    .0499284    .5283927    .0349921    .2328651
------------------------------------------------------------------------------
     mean(diff) = mean(Pm4_1_4_score - m4_1_4_score)              t =   2.6824
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.9958         Pr(|T| > |t|) = 0.0084          Pr(T > t) = 0.0042

. 
. *Module 17 ttest
. ttest Pm17_1_1_score=m17_1_1_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm17_1.. |     112    .8482143     .034057    .3604257     .780728    .9157006
m17_1_.. |     112    .4464286    .0471847    .4993561    .3529289    .5399282
---------+--------------------------------------------------------------------
    diff |     112    .4017857    .0544952     .576723    .2937998    .5097716
------------------------------------------------------------------------------
     mean(diff) = mean(Pm17_1_1_score - m17_1_1_score)            t =   7.3729
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm17_1_2_score=m17_1_2_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm17_1.. |     112    .5446429    .0472684    .5002413    .4509775    .6383083
m17_1_.. |     112    .2232143     .039523    .4182723    .1448968    .3015318
---------+--------------------------------------------------------------------
    diff |     112    .3214286    .0510732    .5405084    .2202235    .4226336
------------------------------------------------------------------------------
     mean(diff) = mean(Pm17_1_2_score - m17_1_2_score)            t =   6.2935
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm17_1_3_score=m17_1_3_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm17_1.. |     112    .3839286    .0461614    .4885267    .2924566    .4754005
m17_1_.. |     112    .0535714    .0213722     .226182     .011221    .0959219
---------+--------------------------------------------------------------------
    diff |     112    .3303571    .0481117    .5091663    .2350206    .4256937
------------------------------------------------------------------------------
     mean(diff) = mean(Pm17_1_3_score - m17_1_3_score)            t =   6.8665
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm17_1_4_score=m17_1_4_score

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm17_1.. |     112    .8571429    .0332136    .3514998    .7913279    .9229578
m17_1_.. |     112    .8482143     .034057    .3604257     .780728    .9157006
---------+--------------------------------------------------------------------
    diff |     112    .0089286    .0390845    .4136312   -.0685199    .0863771
------------------------------------------------------------------------------
     mean(diff) = mean(Pm17_1_4_score - m17_1_4_score)            t =   0.2284
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.5901         Pr(|T| > |t|) = 0.8197          Pr(T > t) = 0.4099

. 
. *Learner evaluation of facilitator
. *post test module 1 Learner evaluation of facilitator
. tab Pm1_3_1 gender, row nokey

post-test, module 1, |
  Learner evaluation |
      of facilitator |              Gender
         question #1 |    Female       Male      Other |     Total
---------------------+---------------------------------+----------
      very effective |        31         25          7 |        63 
                     |     49.21      39.68      11.11 |    100.00 
---------------------+---------------------------------+----------
 extremely effective |        23         13          6 |        42 
                     |     54.76      30.95      14.29 |    100.00 
---------------------+---------------------------------+----------
                   6 |         4          3          0 |         7 
                     |     57.14      42.86       0.00 |    100.00 
---------------------+---------------------------------+----------
               Total |        58         41         13 |       112 
                     |     51.79      36.61      11.61 |    100.00 


. tab Pm1_3_2 gender, row nokey

 post-test, module 1, |
Learner evaluation of |
 facilitator question |              Gender
                   #2 |    Female       Male      Other |     Total
----------------------+---------------------------------+----------
moderately knowledgea |         1          0          0 |         1 
                      |    100.00       0.00       0.00 |    100.00 
----------------------+---------------------------------+----------
   very knowledgeable |        25         18          5 |        48 
                      |     52.08      37.50      10.42 |    100.00 
----------------------+---------------------------------+----------
extremely knowledgeab |        28         19          8 |        55 
                      |     50.91      34.55      14.55 |    100.00 
----------------------+---------------------------------+----------
                    6 |         4          4          0 |         8 
                      |     50.00      50.00       0.00 |    100.00 
----------------------+---------------------------------+----------
                Total |        58         41         13 |       112 
                      |     51.79      36.61      11.61 |    100.00 


. tab Pm1_3_3 gender, row nokey

post-test, |
 module 1, |
   Learner |
evaluation |
        of |
facilitato |
r question |              Gender
        #3 |    Female       Male      Other |     Total
-----------+---------------------------------+----------
       Yes |        55         38         13 |       106 
           |     51.89      35.85      12.26 |    100.00 
-----------+---------------------------------+----------
         3 |         3          3          0 |         6 
           |     50.00      50.00       0.00 |    100.00 
-----------+---------------------------------+----------
     Total |        58         41         13 |       112 
           |     51.79      36.61      11.61 |    100.00 


. tab Pm1_3_4 gender, row nokey

post-test, |
 module 1, |
   Learner |
evaluation |
        of |
facilitato |
r question |              Gender
        #4 |    Female       Male      Other |     Total
-----------+---------------------------------+----------
       Yes |        55         38         13 |       106 
           |     51.89      35.85      12.26 |    100.00 
-----------+---------------------------------+----------
         3 |         3          3          0 |         6 
           |     50.00      50.00       0.00 |    100.00 
-----------+---------------------------------+----------
     Total |        58         41         13 |       112 
           |     51.79      36.61      11.61 |    100.00 


. 
. *post test module 3 Learner evaluation of facilitator
. tab Pm3_3_1

post-test, module 3, |
  Learner evaluation |
      of facilitator |
         question #1 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
moderately effective |          5        4.46        4.46
      very effective |         56       50.00       54.46
 extremely effective |         46       41.07       95.54
                   6 |          5        4.46      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm3_3_2

    post-test, module 3, |
   Learner evaluation of |
 facilitator question #2 |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
not knowledgeable at all |          1        0.89        0.89
moderately knowledgeable |          5        4.46        5.36
      very knowledgeable |         47       41.96       47.32
 extremely knowledgeable |         54       48.21       95.54
                       6 |          5        4.46      100.00
-------------------------+-----------------------------------
                   Total |        112      100.00

. tab Pm3_3_3

 post-test, |
  module 3, |
    Learner |
 evaluation |
         of |
facilitator |
question #3 |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        106       94.64       94.64
          2 |          1        0.89       95.54
          3 |          5        4.46      100.00
------------+-----------------------------------
      Total |        112      100.00

. tab Pm3_3_4

 post-test, |
  module 3, |
    Learner |
 evaluation |
         of |
facilitator |
question #4 |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        106       94.64       94.64
          2 |          1        0.89       95.54
          3 |          5        4.46      100.00
------------+-----------------------------------
      Total |        112      100.00

. 
. *post test module 4 Learner evaluation of facilitator
. tab Pm4_3_1

post-test, module 4, |
  Learner evaluation |
      of facilitator |
         question #1 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
moderately effective |          1        0.89        0.89
      very effective |         56       50.00       50.89
 extremely effective |         45       40.18       91.07
                   6 |         10        8.93      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm4_3_2

    post-test, module 4, |
   Learner evaluation of |
 facilitator question #2 |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
moderately knowledgeable |          1        0.89        0.89
      very knowledgeable |         47       41.96       42.86
 extremely knowledgeable |         54       48.21       91.07
                       6 |         10        8.93      100.00
-------------------------+-----------------------------------
                   Total |        112      100.00

. tab Pm4_3_3

 post-test, |
  module 4, |
    Learner |
 evaluation |
         of |
facilitator |
question #3 |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        101       90.18       90.18
          2 |          1        0.89       91.07
          3 |         10        8.93      100.00
------------+-----------------------------------
      Total |        112      100.00

. tab Pm4_3_4

 post-test, |
  module 4, |
    Learner |
 evaluation |
         of |
facilitator |
question #4 |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        102       91.07       91.07
          3 |         10        8.93      100.00
------------+-----------------------------------
      Total |        112      100.00

. 
. *post test module 17 Learner evaluation of facilitator
. tab Pm17_3_1

   post-test, module |
         17, Learner |
       evaluation of |
facilitator question |
                  #1 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
moderately effective |          2        1.79        1.79
      very effective |         56       50.00       51.79
 extremely effective |         49       43.75       95.54
                   6 |          5        4.46      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm17_3_2

   post-test, module 17, |
   Learner evaluation of |
 facilitator question #2 |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
moderately knowledgeable |          2        1.79        1.79
      very knowledgeable |         49       43.75       45.54
 extremely knowledgeable |         57       50.89       96.43
                       6 |          4        3.57      100.00
-------------------------+-----------------------------------
                   Total |        112      100.00

. tab Pm17_3_3

 post-test, |
 module 17, |
    Learner |
 evaluation |
         of |
facilitator |
question #3 |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        107       95.54       95.54
          2 |          1        0.89       96.43
          3 |          4        3.57      100.00
------------+-----------------------------------
      Total |        112      100.00

. tab Pm17_3_4

 post-test, |
 module 17, |
    Learner |
 evaluation |
         of |
facilitator |
question #4 |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |        108       96.43       96.43
          3 |          4        3.57      100.00
------------+-----------------------------------
      Total |        112      100.00

. 
. *Learner evaluation of module
. *post test module 1 Learner evaluation of module
. tab Pm1_4_1

  post-test, module 1, |
 Learner evaluation of |
    module question #1 |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
Extremely dissatisfied |          2        1.79        1.79
    Slightly satisfied |         10        8.93       10.71
   Extremely satisfied |         92       82.14       92.86
                     6 |          8        7.14      100.00
-----------------------+-----------------------------------
                 Total |        112      100.00

. tab Pm1_4_2

post-test, module 1, |
  Learner evaluation |
  of module question |
                  #2 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
moderately effective |          1        0.89        0.89
      very effective |         52       46.43       47.32
 extremely effective |         52       46.43       93.75
                   6 |          7        6.25      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm1_4_3

post-test, module 1, |
  Learner evaluation |
  of module question |
                  #3 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
  slightly effective |          2        1.79        1.79
moderately effective |         10        8.93       10.71
      very effective |         60       53.57       64.29
 extremely effective |         32       28.57       92.86
                   6 |          8        7.14      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm1_4_4

post-test, module 1, |
  Learner evaluation |
  of module question |
                  #4 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
  slightly effective |          2        1.79        1.79
moderately effective |          8        7.14        8.93
      very effective |         60       53.57       62.50
 extremely effective |         32       28.57       91.07
                   6 |         10        8.93      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. 
. *post test module 3 Learner evaluation of module
. tab Pm3_4_1

  post-test, module 3, |
 Learner evaluation of |
    module question #1 |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
    Slightly satisfied |         16       14.29       14.29
   Extremely satisfied |         91       81.25       95.54
                     6 |          5        4.46      100.00
-----------------------+-----------------------------------
                 Total |        112      100.00

. tab Pm3_4_2

post-test, module 3, |
  Learner evaluation |
  of module question |
                  #2 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
moderately effective |          2        1.79        1.79
      very effective |         52       46.43       48.21
 extremely effective |         53       47.32       95.54
                   6 |          5        4.46      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm3_4_3

post-test, module 3, |
  Learner evaluation |
  of module question |
                  #3 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
  slightly effective |          1        0.89        0.89
moderately effective |         10        8.93        9.82
      very effective |         56       50.00       59.82
 extremely effective |         39       34.82       94.64
                   6 |          6        5.36      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm3_4_4

post-test, module 3, |
  Learner evaluation |
  of module question |
                  #4 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
  slightly effective |          2        1.79        1.79
moderately effective |         12       10.71       12.50
      very effective |         53       47.32       59.82
 extremely effective |         36       32.14       91.96
                   6 |          9        8.04      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. 
. *post test module 4 Learner evaluation of module
. tab Pm4_4_1

  post-test, module 4, |
 Learner evaluation of |
    module question #1 |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
    Slightly satisfied |         16       14.29       14.29
   Extremely satisfied |         86       76.79       91.07
                     6 |         10        8.93      100.00
-----------------------+-----------------------------------
                 Total |        112      100.00

. tab Pm4_4_2

post-test, module 4, |
  Learner evaluation |
  of module question |
                  #2 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
moderately effective |          2        1.79        1.79
      very effective |         43       38.39       40.18
 extremely effective |         57       50.89       91.07
                   6 |         10        8.93      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm4_4_3

post-test, module 4, |
  Learner evaluation |
  of module question |
                  #3 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
moderately effective |          5        4.46        4.46
      very effective |         52       46.43       50.89
 extremely effective |         44       39.29       90.18
                   6 |         11        9.82      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm4_4_4

post-test, module 4, |
  Learner evaluation |
  of module question |
                  #4 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
  slightly effective |          2        1.79        1.79
moderately effective |          9        8.04        9.82
      very effective |         49       43.75       53.57
 extremely effective |         38       33.93       87.50
                   6 |         14       12.50      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. 
. *post test module 17 Learner evaluation of module
. tab Pm17_4_1

 post-test, module 17, |
 Learner evaluation of |
    module question #1 |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
    Slightly satisfied |         20       17.86       17.86
   Extremely satisfied |         88       78.57       96.43
                     6 |          4        3.57      100.00
-----------------------+-----------------------------------
                 Total |        112      100.00

. tab Pm17_4_2

   post-test, module |
         17, Learner |
evaluation of module |
         question #2 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
moderately effective |          1        0.89        0.89
      very effective |         53       47.32       48.21
 extremely effective |         54       48.21       96.43
                   6 |          4        3.57      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm17_4_3

   post-test, module |
         17, Learner |
evaluation of module |
         question #3 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
  slightly effective |          1        0.89        0.89
moderately effective |          6        5.36        6.25
      very effective |         54       48.21       54.46
 extremely effective |         45       40.18       94.64
                   6 |          6        5.36      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm17_4_4

   post-test, module |
         17, Learner |
evaluation of module |
         question #4 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
  slightly effective |          1        0.89        0.89
moderately effective |          9        8.04        8.93
      very effective |         45       40.18       49.11
 extremely effective |         44       39.29       88.39
                   6 |         13       11.61      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. 
. *Wilcoxon signed ranks tests pre post multiple questions
. *Module 1 Wilcoxon signed ranks tests
. signrank Pm1_total_score=m1_total_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       27        2589      1623.5
    negative |        7         658      1623.5
        zero |       78        3081        3081
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties     -620.50
adjustment for zeros  -40309.75
                     ----------
adjusted variance      77719.75

Ho: Pm1_total_score = m1_total_score
             z =   3.463
    Prob > |z| =   0.0005

. 
. *Module 3 Wilcoxon signed ranks tests
. signrank Pm3_total_score=m3_total_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       74        5365      3001.5
    negative |       13         638      3001.5
        zero |       25         325         325
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties     -229.13
adjustment for zeros   -1381.25
                     ----------
adjusted variance     117039.63

Ho: Pm3_total_score = m3_total_score
             z =   6.909
    Prob > |z| =   0.0000

. 
. *Module 4 Wilcoxon signed ranks tests
. signrank Pm4_total_score=m4_total_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       41        3582      2218.5
    negative |       10         855      2218.5
        zero |       61        1891        1891
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -2303.50
adjustment for zeros  -19382.75
                     ----------
adjusted variance      96963.75

Ho: Pm4_total_score = m4_total_score
             z =   4.379
    Prob > |z| =   0.0000

. 
. *Module 17 Wilcoxon signed ranks tests
. signrank Pm17_total_score=m17_total_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       79        5619        2975
    negative |        6         331        2975
        zero |       27         378         378
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -2687.50
adjustment for zeros   -1732.50
                     ----------
adjusted variance     114230.00

Ho: Pm17_total_score = m17_total_score
             z =   7.823
    Prob > |z| =   0.0000

. 
. *Individual question Wilcoxon signed ranks tests
. *Module 1 Wilcoxon signed ranks tests
. signrank Pm1_1_1_score=m1_1_1_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       16        1664         884
    negative |        1         104         884
        zero |       95        4560        4560
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties     -102.00
adjustment for zeros  -72580.00
                     ----------
adjusted variance      45968.00

Ho: Pm1_1_1_score = m1_1_1_score
             z =   3.638
    Prob > |z| =   0.0003

. signrank Pm1_1_2_score=m1_1_2_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |        1       110.5         221
    negative |        3       331.5         221
        zero |      108        5886        5886
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties       -1.25
adjustment for zeros -106438.50
                     ----------
adjusted variance      12210.25

Ho: Pm1_1_2_score = m1_1_2_score
             z =  -1.000
    Prob > |z| =   0.3173

. signrank Pm1_1_3_score=m1_1_3_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |        7       752.5       537.5
    negative |        3       322.5       537.5
        zero |      102        5253        5253
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties      -20.63
adjustment for zeros  -89738.75
                     ----------
adjusted variance      28890.63

Ho: Pm1_1_3_score = m1_1_3_score
             z =   1.265
    Prob > |z| =   0.2059

. signrank Pm1_1_4_score=m1_1_4_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |        8         860       537.5
    negative |        2         215       537.5
        zero |      102        5253        5253
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties      -20.63
adjustment for zeros  -89738.75
                     ----------
adjusted variance      28890.63

Ho: Pm1_1_4_score = m1_1_4_score
             z =   1.897
    Prob > |z| =   0.0578

. 
. *Module 3 Wilcoxon signed ranks tests
. signrank Pm3_1_1_score=m3_1_1_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       16        1656       931.5
    negative |        2         207       931.5
        zero |       94        4465        4465
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties     -121.13
adjustment for zeros  -70323.75
                     ----------
adjusted variance      48205.13

Ho: Pm3_1_1_score = m3_1_1_score
             z =   3.300
    Prob > |z| =   0.0010

. signrank Pm3_1_2_score=m3_1_2_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       12        1260       787.5
    negative |        3         315       787.5
        zero |       97        4753        4753
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties      -70.00
adjustment for zeros  -77236.25
                     ----------
adjusted variance      41343.75

Ho: Pm3_1_2_score = m3_1_2_score
             z =   2.324
    Prob > |z| =   0.0201

. signrank Pm3_1_3_score=m3_1_3_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       41        3526        2279
    negative |       12        1032        2279
        zero |       59        1770        1770
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -3100.50
adjustment for zeros  -17552.50
                     ----------
adjusted variance      97997.00

Ho: Pm3_1_3_score = m3_1_3_score
             z =   3.983
    Prob > |z| =   0.0001

. signrank Pm3_1_4_1_score=m3_1_4_1_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       40        3580      2058.5
    negative |        6         537      2058.5
        zero |       66        2211        2211
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -2026.88
adjustment for zeros  -24505.25
                     ----------
adjusted variance      92117.88

Ho: Pm3_1_4_1_score = m3_1_4_1_score
             z =   5.013
    Prob > |z| =   0.0000

. signrank Pm3_1_4_2_score=m3_1_4_2_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       36        3312        1886
    negative |        5         460        1886
        zero |       71        2556        2556
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -1435.00
adjustment for zeros  -30459.00
                     ----------
adjusted variance      86756.00

Ho: Pm3_1_4_2_score = m3_1_4_2_score
             z =   4.841
    Prob > |z| =   0.0000

. signrank Pm3_1_4_3_score=m3_1_4_3_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       35        3255      1813.5
    negative |        4         372      1813.5
        zero |       73        2701        2701
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -1235.00
adjustment for zeros  -33087.25
                     ----------
adjusted variance      84327.75

Ho: Pm3_1_4_3_score = m3_1_4_3_score
             z =   4.964
    Prob > |z| =   0.0000

. signrank Pm3_1_4_4_score=m3_1_4_4_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       33        3135      1662.5
    negative |        2         190      1662.5
        zero |       77        3003        3003
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties     -892.50
adjustment for zeros  -38788.75
                     ----------
adjusted variance      78968.75

Ho: Pm3_1_4_4_score = m3_1_4_4_score
             z =   5.240
    Prob > |z| =   0.0000

. signrank Pm3_1_5_score=m3_1_5_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       26        2522      1503.5
    negative |        5         485      1503.5
        zero |       81        3321        3321
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties     -620.00
adjustment for zeros  -45110.25
                     ----------
adjusted variance      72919.75

Ho: Pm3_1_5_score = m3_1_5_score
             z =   3.772
    Prob > |z| =   0.0002

. 
. *Module 4 Wilcoxon signed ranks tests
. signrank Pm4_1_1_score=m4_1_1_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       18        1845        1025
    negative |        2         205        1025
        zero |       92        4278        4278
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties     -166.25
adjustment for zeros  -65952.50
                     ----------
adjusted variance      52531.25

Ho: Pm4_1_1_score = m4_1_1_score
             z =   3.578
    Prob > |z| =   0.0003

. signrank Pm4_1_2_score=m4_1_2_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |        3       331.5         221
    negative |        1       110.5         221
        zero |      108        5886        5886
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties       -1.25
adjustment for zeros -106438.50
                     ----------
adjusted variance      12210.25

Ho: Pm4_1_2_score = m4_1_2_score
             z =   1.000
    Prob > |z| =   0.3173

. signrank Pm4_1_3_score=m4_1_3_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |        3         330         275
    negative |        2         220         275
        zero |      107        5778        5778
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties       -2.50
adjustment for zeros -103522.50
                     ----------
adjusted variance      15125.00

Ho: Pm4_1_3_score = m4_1_3_score
             z =   0.447
    Prob > |z| =   0.6547

. signrank Pm4_1_4_score=m4_1_4_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       24        2304        1584
    negative |        9         864        1584
        zero |       79        3160        3160
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties     -748.00
adjustment for zeros  -41870.00
                     ----------
adjusted variance      76032.00

Ho: Pm4_1_4_score = m4_1_4_score
             z =   2.611
    Prob > |z| =   0.0090

. 
. *Module 17 Wilcoxon signed ranks tests
. signrank Pm17_1_1_score=m17_1_1_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       50        4250      2337.5
    negative |        5         425      2337.5
        zero |       57        1653        1653
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -3465.00
adjustment for zeros  -15841.25
                     ----------
adjusted variance      99343.75

Ho: Pm17_1_1_score = m17_1_1_score
             z =   6.068
    Prob > |z| =   0.0000

. signrank Pm17_1_2_score=m17_1_2_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       40        3620        1991
    negative |        4         362        1991
        zero |       68        2346        2346
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -1773.75
adjustment for zeros  -26783.50
                     ----------
adjusted variance      90092.75

Ho: Pm17_1_2_score = m17_1_2_score
             z =   5.427
    Prob > |z| =   0.0000

. signrank Pm17_1_3_score=m17_1_3_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       39        3588        1886
    negative |        2         184        1886
        zero |       71        2556        2556
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -1435.00
adjustment for zeros  -30459.00
                     ----------
adjusted variance      86756.00

Ho: Pm17_1_3_score = m17_1_3_score
             z =   5.778
    Prob > |z| =   0.0000

. signrank Pm17_1_4_score=m17_1_4_score

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       10        1030       978.5
    negative |        9         927       978.5
        zero |       93        4371        4371
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties     -142.50
adjustment for zeros  -68114.75
                     ----------
adjusted variance      50392.75

Ho: Pm17_1_4_score = m17_1_4_score
             z =   0.229
    Prob > |z| =   0.8185

. 
. * Learner self conceived competency
. * Module 1 pretest Learner self conceived competency
. tab m1_2_1

 pre-test, module 1, |
  Likert question #1 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          8        7.14        7.14
Somewhat comfortable |         22       19.64       26.79
         Comfortable |         50       44.64       71.43
    Very Comfortable |         26       23.21       94.64
      Not Applicable |          6        5.36      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m1_2_2

 pre-test, module 1, |
  Likert question #2 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          5        4.46        4.46
Somewhat comfortable |         20       17.86       22.32
         Comfortable |         43       38.39       60.71
    Very Comfortable |         39       34.82       95.54
      Not Applicable |          5        4.46      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m1_2_3

 pre-test, module 1, |
  Likert question #3 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          1        0.89        0.89
Somewhat comfortable |         29       25.89       26.79
         Comfortable |         38       33.93       60.71
    Very Comfortable |         41       36.61       97.32
      Not Applicable |          3        2.68      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m1_2_4

 pre-test, module 1, |
  Likert question #4 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          6        5.36        5.36
Somewhat comfortable |         17       15.18       20.54
         Comfortable |         59       52.68       73.21
    Very Comfortable |         26       23.21       96.43
      Not Applicable |          4        3.57      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m1_2_5

 pre-test, module 1, |
  Likert question #5 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |         10        8.93        8.93
Somewhat comfortable |         29       25.89       34.82
         Comfortable |         40       35.71       70.54
    Very Comfortable |         27       24.11       94.64
      Not Applicable |          6        5.36      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m1_2_6

 pre-test, module 1, |
  Likert question #6 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          1        0.89        0.89
Somewhat comfortable |         17       15.18       16.07
         Comfortable |         34       30.36       46.43
    Very Comfortable |         29       25.89       72.32
      Not Applicable |         31       27.68      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m1_2_7

 pre-test, module 1, |
  Likert question #7 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
Somewhat comfortable |          8        7.21        7.21
         Comfortable |         28       25.23       32.43
    Very Comfortable |         11        9.91       42.34
      Not Applicable |         64       57.66      100.00
---------------------+-----------------------------------
               Total |        111      100.00

. 
. * Module 3 pretest Learner self conceived competency
. tab m3_2_1

 pre-test, module 3, |
  Likert question #1 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |         13       11.61       11.61
Somewhat comfortable |         30       26.79       38.39
         Comfortable |         48       42.86       81.25
    Very Comfortable |         19       16.96       98.21
      Not Applicable |          2        1.79      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m3_2_2

 pre-test, module 3, |
  Likert question #2 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |         14       12.50       12.50
Somewhat comfortable |         33       29.46       41.96
         Comfortable |         50       44.64       86.61
    Very Comfortable |         13       11.61       98.21
      Not Applicable |          2        1.79      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m3_2_3

 pre-test, module 3, |
  Likert question #3 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |         12       10.71       10.71
Somewhat comfortable |         32       28.57       39.29
         Comfortable |         46       41.07       80.36
    Very Comfortable |         18       16.07       96.43
      Not Applicable |          4        3.57      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m3_2_4

 pre-test, module 3, |
  Likert question #4 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          7        6.25        6.25
Somewhat comfortable |         28       25.00       31.25
         Comfortable |         46       41.07       72.32
    Very Comfortable |         30       26.79       99.11
      Not Applicable |          1        0.89      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m3_2_5

 pre-test, module 3, |
  Likert question #5 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          2        1.80        1.80
Somewhat comfortable |         20       18.02       19.82
         Comfortable |         36       32.43       52.25
    Very Comfortable |         17       15.32       67.57
      Not Applicable |         36       32.43      100.00
---------------------+-----------------------------------
               Total |        111      100.00

. 
. * Module 4 pretest Learner self conceived competency
. tab m4_2_1

 pre-test, module 4, |
  Likert question #1 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          7        6.25        6.25
Somewhat comfortable |         28       25.00       31.25
         Comfortable |         45       40.18       71.43
    Very Comfortable |         28       25.00       96.43
      Not Applicable |          4        3.57      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m4_2_2

 pre-test, module 4, |
  Likert question #2 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          9        8.04        8.04
Somewhat comfortable |         26       23.21       31.25
         Comfortable |         43       38.39       69.64
    Very Comfortable |         30       26.79       96.43
      Not Applicable |          4        3.57      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m4_2_3

 pre-test, module 4, |
  Likert question #3 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |         13       11.61       11.61
Somewhat comfortable |         29       25.89       37.50
         Comfortable |         38       33.93       71.43
    Very Comfortable |         29       25.89       97.32
      Not Applicable |          3        2.68      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m4_2_4

 pre-test, module 4, |
  Likert question #4 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          2        1.79        1.79
Somewhat comfortable |         14       12.50       14.29
         Comfortable |         48       42.86       57.14
    Very Comfortable |         46       41.07       98.21
      Not Applicable |          2        1.79      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m4_2_5

 pre-test, module 4, |
  Likert question #5 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |         49       43.75       43.75
Somewhat comfortable |         24       21.43       65.18
         Comfortable |         19       16.96       82.14
    Very Comfortable |         13       11.61       93.75
      Not Applicable |          7        6.25      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m4_2_6

 pre-test, module 4, |
  Likert question #6 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          2        1.80        1.80
Somewhat comfortable |         15       13.51       15.32
         Comfortable |         42       37.84       53.15
    Very Comfortable |         16       14.41       67.57
      Not Applicable |         36       32.43      100.00
---------------------+-----------------------------------
               Total |        111      100.00

. 
. * Module 17 pretest Learner self conceived competency
. tab m17_2_2

pre-test, module 17, |
  Likert question #2 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |         13       11.61       11.61
Somewhat comfortable |         36       32.14       43.75
         Comfortable |         39       34.82       78.57
    Very Comfortable |         20       17.86       96.43
      Not Applicable |          4        3.57      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m17_2_3

pre-test, module 17, |
  Likert question #3 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |         20       17.86       17.86
Somewhat comfortable |         38       33.93       51.79
         Comfortable |         30       26.79       78.57
    Very Comfortable |         17       15.18       93.75
      Not Applicable |          7        6.25      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m17_2_4

pre-test, module 17, |
  Likert question #4 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |         11        9.82        9.82
Somewhat comfortable |         25       22.32       32.14
         Comfortable |         38       33.93       66.07
    Very Comfortable |         29       25.89       91.96
      Not Applicable |          9        8.04      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m17_2_5

pre-test, module 17, |
  Likert question #5 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          8        7.14        7.14
Somewhat comfortable |         24       21.43       28.57
         Comfortable |         43       38.39       66.96
    Very Comfortable |         31       27.68       94.64
      Not Applicable |          6        5.36      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. 
. * Module 1 posttest Learner self conceived competency
. tab Pm1_2_1

post-test, module 1, |
  Likert question #1 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          1        0.89        0.89
Somewhat comfortable |          7        6.25        7.14
         Comfortable |         32       28.57       35.71
    Very Comfortable |         70       62.50       98.21
      Not Applicable |          2        1.79      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm1_2_2

post-test, module 1, |
  Likert question #2 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          2        1.79        1.79
Somewhat comfortable |          3        2.68        4.46
         Comfortable |         34       30.36       34.82
    Very Comfortable |         69       61.61       96.43
      Not Applicable |          4        3.57      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm1_2_3

post-test, module 1, |
  Likert question #3 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          3        2.68        2.68
Somewhat comfortable |          4        3.57        6.25
         Comfortable |         30       26.79       33.04
    Very Comfortable |         71       63.39       96.43
      Not Applicable |          4        3.57      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm1_2_4

post-test, module 1, |
  Likert question #4 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          1        0.89        0.89
Somewhat comfortable |          6        5.36        6.25
         Comfortable |         32       28.57       34.82
    Very Comfortable |         71       63.39       98.21
      Not Applicable |          2        1.79      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm1_2_5

post-test, module 1, |
  Likert question #5 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          4        3.57        3.57
Somewhat comfortable |          9        8.04       11.61
         Comfortable |         29       25.89       37.50
    Very Comfortable |         67       59.82       97.32
      Not Applicable |          3        2.68      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm1_2_6

post-test, module 1, |
  Likert question #6 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          3        2.68        2.68
Somewhat comfortable |          3        2.68        5.36
         Comfortable |         24       21.43       26.79
    Very Comfortable |         55       49.11       75.89
      Not Applicable |         27       24.11      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm1_2_7

post-test, module 1, |
  Likert question #7 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
         Comfortable |         29       26.13       26.13
    Very Comfortable |         16       14.41       40.54
      Not Applicable |         66       59.46      100.00
---------------------+-----------------------------------
               Total |        111      100.00

. 
. * Module 3 posttest Learner self conceived competency
. tab Pm3_2_1

post-test, module 3, |
  Likert question #1 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          3        2.68        2.68
Somewhat comfortable |          5        4.46        7.14
         Comfortable |         39       34.82       41.96
    Very Comfortable |         63       56.25       98.21
      Not Applicable |          2        1.79      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm3_2_2

post-test, module 3, |
  Likert question #2 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          1        0.89        0.89
Somewhat comfortable |          9        8.04        8.93
         Comfortable |         35       31.25       40.18
    Very Comfortable |         65       58.04       98.21
      Not Applicable |          2        1.79      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm3_2_3

post-test, module 3, |
  Likert question #3 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          2        1.79        1.79
Somewhat comfortable |          9        8.04        9.82
         Comfortable |         27       24.11       33.93
    Very Comfortable |         72       64.29       98.21
      Not Applicable |          2        1.79      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm3_2_4

post-test, module 3, |
  Likert question #4 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          1        0.89        0.89
Somewhat comfortable |          6        5.36        6.25
         Comfortable |         35       31.25       37.50
    Very Comfortable |         67       59.82       97.32
      Not Applicable |          3        2.68      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm3_2_5

post-test, module 3, |
  Likert question #5 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          2        1.80        1.80
Somewhat comfortable |          1        0.90        2.70
         Comfortable |         41       36.94       39.64
    Very Comfortable |         37       33.33       72.97
      Not Applicable |         30       27.03      100.00
---------------------+-----------------------------------
               Total |        111      100.00

. 
. * Module 4 posttest Learner self conceived competency
. tab Pm4_2_1

post-test, module 4, |
  Likert question #1 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          3        2.68        2.68
Somewhat comfortable |          2        1.79        4.46
         Comfortable |         24       21.43       25.89
    Very Comfortable |         82       73.21       99.11
      Not Applicable |          1        0.89      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm4_2_2

post-test, module 4, |
  Likert question #2 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          1        0.89        0.89
Somewhat comfortable |          6        5.36        6.25
         Comfortable |         31       27.68       33.93
    Very Comfortable |         73       65.18       99.11
      Not Applicable |          1        0.89      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm4_2_3

post-test, module 4, |
  Likert question #3 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          1        0.89        0.89
Somewhat comfortable |          7        6.25        7.14
         Comfortable |         29       25.89       33.04
    Very Comfortable |         74       66.07       99.11
      Not Applicable |          1        0.89      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm4_2_4

post-test, module 4, |
  Likert question #4 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          2        1.79        1.79
Somewhat comfortable |          3        2.68        4.46
         Comfortable |         22       19.64       24.11
    Very Comfortable |         84       75.00       99.11
      Not Applicable |          1        0.89      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm4_2_5

post-test, module 4, |
  Likert question #5 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          1        0.89        0.89
Somewhat comfortable |         10        8.93        9.82
         Comfortable |         31       27.68       37.50
    Very Comfortable |         69       61.61       99.11
      Not Applicable |          1        0.89      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm4_2_6

post-test, module 4, |
  Likert question #6 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
Somewhat comfortable |          2        1.80        1.80
         Comfortable |         43       38.74       40.54
    Very Comfortable |         35       31.53       72.07
      Not Applicable |         31       27.93      100.00
---------------------+-----------------------------------
               Total |        111      100.00

. 
. * Module 17 posttest Learner self conceived competency
. tab Pm17_2_2

   post-test, module |
 17, Likert question |
                  #2 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          2        1.79        1.79
Somewhat comfortable |          8        7.14        8.93
         Comfortable |         30       26.79       35.71
    Very Comfortable |         69       61.61       97.32
      Not Applicable |          3        2.68      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm17_2_3

   post-test, module |
 17, Likert question |
                  #3 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          2        1.79        1.79
Somewhat comfortable |         13       11.61       13.39
         Comfortable |         37       33.04       46.43
    Very Comfortable |         54       48.21       94.64
      Not Applicable |          6        5.36      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm17_2_4

   post-test, module |
 17, Likert question |
                  #4 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          2        1.79        1.79
Somewhat comfortable |         10        8.93       10.71
         Comfortable |         30       26.79       37.50
    Very Comfortable |         66       58.93       96.43
      Not Applicable |          4        3.57      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab Pm17_2_5

   post-test, module |
 17, Likert question |
                  #5 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          2        1.79        1.79
Somewhat comfortable |          2        1.79        3.57
         Comfortable |         31       27.68       31.25
    Very Comfortable |         74       66.07       97.32
      Not Applicable |          3        2.68      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. 
. * Wilcoxon signed ranks tests Learner self conceived competency
. 
. * Wilcoxon signed ranks tests Module 1 posttest Learner self conceived competency
. signrank Pm1_2_1=m1_2_1

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       60        4586        2831
    negative |       16        1076        2831
        zero |       36         666         666
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -3928.25
adjustment for zeros   -4051.50
                     ----------
adjusted variance     110670.25

Ho: Pm1_2_1 = m1_2_1
             z =   5.275
    Prob > |z| =   0.0000

. signrank Pm1_2_2=m17_2_2

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       72        5328        2916
    negative |        9         504        2916
        zero |       31         496         496
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -2744.50
adjustment for zeros   -2604.00
                     ----------
adjusted variance     113301.50

Ho: Pm1_2_2 = m17_2_2
             z =   7.166
    Prob > |z| =   0.0000

. signrank Pm1_2_3=m1_2_3

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       52        4213        2576
    negative |       12         939        2576
        zero |       48        1176        1176
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -2349.00
adjustment for zeros   -9506.00
                     ----------
adjusted variance     106795.00

Ho: Pm1_2_3 = m1_2_3
             z =   5.009
    Prob > |z| =   0.0000

. signrank Pm1_2_4=m1_2_4

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       60      4601.5      2712.5
    negative |       10       823.5      2712.5
        zero |       42         903         903
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -2848.00
adjustment for zeros   -6396.25
                     ----------
adjusted variance     109405.75

Ho: Pm1_2_4 = m1_2_4
             z =   5.711
    Prob > |z| =   0.0000

. signrank Pm1_2_5=m1_2_5

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       58        4499        2754
    negative |       14        1009        2754
        zero |       40         820         820
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -2330.75
adjustment for zeros   -5535.00
                     ----------
adjusted variance     110784.25

Ho: Pm1_2_5 = m1_2_5
             z =   5.243
    Prob > |z| =   0.0000

. signrank Pm1_2_6=m1_2_6

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       39      3295.5        2249
    negative |       13      1202.5        2249
        zero |       60        1830        1830
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -1056.25
adjustment for zeros  -18452.50
                     ----------
adjusted variance      99141.25

Ho: Pm1_2_6 = m1_2_6
             z =   3.324
    Prob > |z| =   0.0009

. signrank Pm1_2_7=m1_2_7

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       19        1854        1323
    negative |        8         792        1323
        zero |       84        3570        3570
-------------+---------------------------------
         all |      111        6216        6216

unadjusted variance   115514.00
adjustment for ties      -78.00
adjustment for zeros  -50277.50
                     ----------
adjusted variance      65158.50

Ho: Pm1_2_7 = m1_2_7
             z =   2.080
    Prob > |z| =   0.0375

. 
. * Wilcoxon signed ranks tests Module 3 posttest Learner self conceived competency
. signrank Pm3_2_1=m3_2_1

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       68        5191        2774
    negative |        5         357        2774
        zero |       39         780         780
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -2746.13
adjustment for zeros   -5135.00
                     ----------
adjusted variance     110768.88

Ho: Pm3_2_1 = m3_2_1
             z =   7.262
    Prob > |z| =   0.0000

. signrank Pm3_2_2=m3_2_2

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       79        5602        2975
    negative |        6         348        2975
        zero |       27         378         378
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -4894.25
adjustment for zeros   -1732.50
                     ----------
adjusted variance     112023.25

Ho: Pm3_2_2 = m3_2_2
             z =   7.849
    Prob > |z| =   0.0000

. signrank Pm3_2_3=m3_2_3

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       72      5274.5        2900
    negative |        8       525.5        2900
        zero |       32         528         528
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -3448.13
adjustment for zeros   -2860.00
                     ----------
adjusted variance     112341.88

Ho: Pm3_2_3 = m3_2_3
             z =   7.084
    Prob > |z| =   0.0000

. signrank Pm3_2_4=m3_2_4

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       61        4792      2646.5
    negative |        6         501      2646.5
        zero |       45        1035        1035
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -1940.50
adjustment for zeros   -7848.75
                     ----------
adjusted variance     108860.75

Ho: Pm3_2_4 = m3_2_4
             z =   6.503
    Prob > |z| =   0.0000

. signrank Pm3_2_5=m3_2_5

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       34        2975      2002.5
    negative |       11        1030      2002.5
        zero |       66        2211        2211
-------------+---------------------------------
         all |      111        6216        6216

unadjusted variance   115514.00
adjustment for ties     -598.12
adjustment for zeros  -24505.25
                     ----------
adjusted variance      90410.63

Ho: Pm3_2_5 = m3_2_5
             z =   3.234
    Prob > |z| =   0.0012

. 
. * Wilcoxon signed ranks tests Module 4 posttest Learner self conceived competency
. signrank Pm4_2_1=m4_2_1

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       63        4887        2754
    negative |        9         621        2754
        zero |       40         820         820
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -2290.13
adjustment for zeros   -5535.00
                     ----------
adjusted variance     110824.88

Ho: Pm4_2_1 = m4_2_1
             z =   6.407
    Prob > |z| =   0.0000

. signrank Pm4_2_2=m4_2_2

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       62        4804      2733.5
    negative |        9         663      2733.5
        zero |       41         861         861
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -2616.38
adjustment for zeros   -5955.25
                     ----------
adjusted variance     110078.38

Ho: Pm4_2_2 = m4_2_2
             z =   6.241
    Prob > |z| =   0.0000

. signrank Pm4_2_3=m4_2_3

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       66        4996        2831
    negative |       10         666        2831
        zero |       36         666         666
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -2354.38
adjustment for zeros   -4051.50
                     ----------
adjusted variance     112244.13

Ho: Pm4_2_3 = m4_2_3
             z =   6.462
    Prob > |z| =   0.0000

. signrank Pm4_2_4=m4_2_4

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       54      4252.5        2600
    negative |       11       947.5        2600
        zero |       47        1128        1128
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -3300.00
adjustment for zeros   -8930.00
                     ----------
adjusted variance     106420.00

Ho: Pm4_2_4 = m4_2_4
             z =   5.066
    Prob > |z| =   0.0000

. signrank Pm4_2_5=m4_2_5

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       81        5663      3048.5
    negative |       10         434      3048.5
        zero |       21         231         231
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -1777.50
adjustment for zeros    -827.75
                     ----------
adjusted variance     116044.75

Ho: Pm4_2_5 = m4_2_5
             z =   7.675
    Prob > |z| =   0.0000

. signrank Pm4_2_6=m4_2_6

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       29        2638        1830
    negative |       11        1022        1830
        zero |       71        2556        2556
-------------+---------------------------------
         all |      111        6216        6216

unadjusted variance   115514.00
adjustment for ties     -393.25
adjustment for zeros  -30459.00
                     ----------
adjusted variance      84661.75

Ho: Pm4_2_6 = m4_2_6
             z =   2.777
    Prob > |z| =   0.0055

. 
. * Wilcoxon signed ranks tests Module 17 posttest Learner self conceived competency
. signrank Pm17_2_2=m17_2_2

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       71        5225        2916
    negative |       10         607        2916
        zero |       31         496         496
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -3019.88
adjustment for zeros   -2604.00
                     ----------
adjusted variance     113026.13

Ho: Pm17_2_2 = m17_2_2
             z =   6.868
    Prob > |z| =   0.0000

. signrank Pm17_2_3=m17_2_3

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       69        5047      2883.5
    negative |       10         720      2883.5
        zero |       33         561         561
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -2057.63
adjustment for zeros   -3132.25
                     ----------
adjusted variance     113460.13

Ho: Pm17_2_3 = m17_2_3
             z =   6.423
    Prob > |z| =   0.0000

. signrank Pm17_2_4=m17_2_4

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       60        4398        2916
    negative |       21        1434        2916
        zero |       31         496         496
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -5238.13
adjustment for zeros   -2604.00
                     ----------
adjusted variance     110807.88

Ho: Pm17_2_4 = m17_2_4
             z =   4.452
    Prob > |z| =   0.0000

. signrank Pm17_2_5=m17_2_5

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       57      4517.5      2733.5
    negative |       14       949.5      2733.5
        zero |       41         861         861
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -2407.50
adjustment for zeros   -5955.25
                     ----------
adjusted variance     110287.25

Ho: Pm17_2_5 = m17_2_5
             z =   5.372
    Prob > |z| =   0.0000

. 
. * Ttest tests Learner self conceived competency
. 
. * Ttest tests Module 1 posttest Learner self conceived competency
. ttest Pm1_2_1=m1_2_1

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm1_2_1 |     112    3.580357    .0642229    .6796713    3.453095    3.707619
  m1_2_1 |     112           3    .0914632     .967955     2.81876     3.18124
---------+--------------------------------------------------------------------
    diff |     112    .5803571    .0962943    1.019083    .3895436    .7711707
------------------------------------------------------------------------------
     mean(diff) = mean(Pm1_2_1 - m1_2_1)                          t =   6.0269
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm1_2_2=m17_2_2

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm1_2_2 |     112       3.625    .0648295    .6860909    3.496536    3.753464
 m17_2_2 |     112    2.696429    .0956244    1.011994    2.506942    2.885915
---------+--------------------------------------------------------------------
    diff |     112    .9285714    .1012425     1.07145    .7279526     1.12919
------------------------------------------------------------------------------
     mean(diff) = mean(Pm1_2_2 - m17_2_2)                         t =   9.1718
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm1_2_3=m1_2_3

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm1_2_3 |     112    3.616071     .069755    .7382172    3.477847    3.754296
  m1_2_3 |     112    3.142857    .0820596     .868437    2.980251    3.305464
---------+--------------------------------------------------------------------
    diff |     112    .4732143    .0905437    .9582249    .2937958    .6526328
------------------------------------------------------------------------------
     mean(diff) = mean(Pm1_2_3 - m1_2_3)                          t =   5.2264
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm1_2_4=m1_2_4

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm1_2_4 |     112    3.598214    .0627294    .6638656    3.473912    3.722517
  m1_2_4 |     112    3.044643    .0815988    .8635605    2.882949    3.206336
---------+--------------------------------------------------------------------
    diff |     112    .5535714    .0930667     .984925    .3691536    .7379892
------------------------------------------------------------------------------
     mean(diff) = mean(Pm1_2_4 - m1_2_4)                          t =   5.9481
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm1_2_5=m1_2_5

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm1_2_5 |     112         3.5    .0781873    .8274568    3.345067    3.654933
  m1_2_5 |     112    2.910714     .097881    1.035875    2.716757    3.104672
---------+--------------------------------------------------------------------
    diff |     112    .5892857    .1034737    1.095063    .3842456    .7943259
------------------------------------------------------------------------------
     mean(diff) = mean(Pm1_2_5 - m1_2_5)                          t =   5.6950
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm1_2_6=m1_2_6

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm1_2_6 |     112    3.892857    .0844746    .8939954    3.725465    4.060249
  m1_2_6 |     112    3.642857    .1013559    1.072651    3.442014    3.843701
---------+--------------------------------------------------------------------
    diff |     112         .25     .086491    .9153348    .0786123    .4213877
------------------------------------------------------------------------------
     mean(diff) = mean(Pm1_2_6 - m1_2_6)                          t =   2.8905
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.9977         Pr(|T| > |t|) = 0.0046          Pr(T > t) = 0.0023

. ttest Pm1_2_7=m1_2_7

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm1_2_7 |     111    4.333333    .0822825    .8668997    4.170269    4.496398
  m1_2_7 |     111     4.18018    .0992999     1.04619    3.983391    4.376969
---------+--------------------------------------------------------------------
    diff |     111    .1531532    .0801291    .8442124   -.0056439    .3119502
------------------------------------------------------------------------------
     mean(diff) = mean(Pm1_2_7 - m1_2_7)                          t =   1.9113
 Ho: mean(diff) = 0                              degrees of freedom =      110

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.9707         Pr(|T| > |t|) = 0.0586          Pr(T > t) = 0.0293

. 
. * Ttest tests Module 3 posttest Learner self conceived competency
. ttest Pm3_2_1=m3_2_1

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm3_2_1 |     112         3.5    .0694713    .7352146    3.362338    3.637662
  m3_2_1 |     112    2.705357    .0893621    .9457195     2.52828    2.882434
---------+--------------------------------------------------------------------
    diff |     112    .7946429    .0889109    .9409444      .61846    .9708257
------------------------------------------------------------------------------
     mean(diff) = mean(Pm3_2_1 - m3_2_1)                          t =   8.9375
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm3_2_2=m3_2_2

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm3_2_2 |     112    3.517857    .0670942    .7100583    3.384906    3.650809
  m3_2_2 |     112    2.607143    .0863581    .9139277    2.436019    2.778267
---------+--------------------------------------------------------------------
    diff |     112    .9107143    .0856063    .9059719    .7410797    1.080349
------------------------------------------------------------------------------
     mean(diff) = mean(Pm3_2_2 - m3_2_2)                          t =  10.6384
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm3_2_3=m3_2_3

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm3_2_3 |     112      3.5625      .07037    .7447262    3.423057    3.701943
  m3_2_3 |     112    2.732143    .0923229    .9770533    2.549199    2.915087
---------+--------------------------------------------------------------------
    diff |     112    .8303571    .0973328    1.030074    .6374856    1.023229
------------------------------------------------------------------------------
     mean(diff) = mean(Pm3_2_3 - m3_2_3)                          t =   8.5311
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm3_2_4=m3_2_4

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm3_2_4 |     112    3.580357    .0642229    .6796713    3.453095    3.707619
  m3_2_4 |     112    2.910714    .0846615    .8959727    2.742952    3.078477
---------+--------------------------------------------------------------------
    diff |     112    .6696429    .0900347    .9528373    .4912332    .8480526
------------------------------------------------------------------------------
     mean(diff) = mean(Pm3_2_4 - m3_2_4)                          t =   7.4376
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm3_2_5=m3_2_5

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm3_2_5 |     111    3.828829    .0857342    .9032655    3.658924    3.998734
  m3_2_5 |     111    3.585586    .1111834     1.17139    3.365246    3.805925
---------+--------------------------------------------------------------------
    diff |     111    .2432432    .0897865      .94596    .0653074    .4211791
------------------------------------------------------------------------------
     mean(diff) = mean(Pm3_2_5 - m3_2_5)                          t =   2.7091
 Ho: mean(diff) = 0                              degrees of freedom =      110

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.9961         Pr(|T| > |t|) = 0.0078          Pr(T > t) = 0.0039

. 
. * Ttest tests Module 4 posttest Learner self conceived competency
. ttest Pm4_2_1=m4_2_1

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm4_2_1 |     112    3.678571    .0624138    .6605251    3.554894    3.802248
  m4_2_1 |     112    2.946429    .0895427    .9476313    2.768994    3.123863
---------+--------------------------------------------------------------------
    diff |     112    .7321429     .099048    1.048226    .5358726    .9284131
------------------------------------------------------------------------------
     mean(diff) = mean(Pm4_2_1 - m4_2_1)                          t =   7.3918
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm4_2_2=m4_2_2

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm4_2_2 |     112    3.598214    .0614337    .6501534    3.476479    3.719949
  m4_2_2 |     112    2.946429    .0930667     .984925    2.762011    3.130846
---------+--------------------------------------------------------------------
    diff |     112    .6517857    .0894264    .9463997    .4745814      .82899
------------------------------------------------------------------------------
     mean(diff) = mean(Pm4_2_2 - m4_2_2)                          t =   7.2885
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm4_2_3=m4_2_3

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm4_2_3 |     112    3.598214    .0627294    .6638656    3.473912    3.722517
  m4_2_3 |     112    2.821429    .0976018     1.03292    2.628024    3.014833
---------+--------------------------------------------------------------------
    diff |     112    .7767857    .0996372    1.054461    .5793479    .9742235
------------------------------------------------------------------------------
     mean(diff) = mean(Pm4_2_3 - m4_2_3)                          t =   7.7961
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm4_2_4=m4_2_4

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm4_2_4 |     112    3.705357    .0590007    .6244045    3.588443    3.822271
  m4_2_4 |     112    3.285714    .0733337    .7760906    3.140399     3.43103
---------+--------------------------------------------------------------------
    diff |     112    .4196429    .0818449    .8661647    .2574618    .5818239
------------------------------------------------------------------------------
     mean(diff) = mean(Pm4_2_4 - m4_2_4)                          t =   5.1273
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm4_2_5=m4_2_5

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm4_2_5 |     112    3.526786    .0670674     .709775    3.393887    3.659684
  m4_2_5 |     112    2.151786    .1204679    1.274913     1.91307    2.390501
---------+--------------------------------------------------------------------
    diff |     112       1.375        .125    1.322876    1.127304    1.622696
------------------------------------------------------------------------------
     mean(diff) = mean(Pm4_2_5 - m4_2_5)                          t =  11.0000
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm4_2_6=m4_2_6

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Pm4_2_6 |     111    3.855856    .0807894    .8511687     3.69575    4.015961
  m4_2_6 |     111    3.621622    .1071208    1.128588    3.409333     3.83391
---------+--------------------------------------------------------------------
    diff |     111    .2342342    .0895479    .9434459    .0567713    .4116972
------------------------------------------------------------------------------
     mean(diff) = mean(Pm4_2_6 - m4_2_6)                          t =   2.6157
 Ho: mean(diff) = 0                              degrees of freedom =      110

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.9949         Pr(|T| > |t|) = 0.0102          Pr(T > t) = 0.0051

. 
. * Ttest tests Module 17 posttest Learner self conceived competency
. ttest Pm17_2_2=m17_2_2

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm17_2_2 |     112      3.5625      .07037    .7447262    3.423057    3.701943
 m17_2_2 |     112    2.696429    .0956244    1.011994    2.506942    2.885915
---------+--------------------------------------------------------------------
    diff |     112    .8660714    .1018613    1.077999    .6642264    1.067916
------------------------------------------------------------------------------
     mean(diff) = mean(Pm17_2_2 - m17_2_2)                        t =   8.5025
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm17_2_3=m17_2_3

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm17_2_3 |     112      3.4375     .078987    .8359194    3.280982    3.594018
 m17_2_3 |     112    2.580357    .1073538    1.136126    2.367628    2.793086
---------+--------------------------------------------------------------------
    diff |     112    .8571429    .1133447    1.199528    .6325427    1.081743
------------------------------------------------------------------------------
     mean(diff) = mean(Pm17_2_3 - m17_2_3)                        t =   7.5623
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm17_2_4=m17_2_4

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm17_2_4 |     112    3.535714    .0738801    .7818731    3.389316    3.682113
 m17_2_4 |     112           3    .1038202     1.09873    2.794273    3.205727
---------+--------------------------------------------------------------------
    diff |     112    .5357143    .1105216    1.169651    .3167084    .7547202
------------------------------------------------------------------------------
     mean(diff) = mean(Pm17_2_4 - m17_2_4)                        t =   4.8471
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. ttest Pm17_2_5=m17_2_5

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm17_2_5 |     112    3.660714    .0615564    .6514512    3.538736    3.782692
 m17_2_5 |     112    3.026786    .0944569     .999638    2.839613    3.213958
---------+--------------------------------------------------------------------
    diff |     112    .6339286     .103039    1.090463    .4297498    .8381073
------------------------------------------------------------------------------
     mean(diff) = mean(Pm17_2_5 - m17_2_5)                        t =   6.1523
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. 
end of do-file

. tab Pm17_2_2 m17_2_2,

   post-test, module |
 17, Likert question |        pre-test, module 17, Likert question #2
                  #2 | Uncomfort  Somewhat   Comfortab  Very Comf  Not Appli |     Total
---------------------+-------------------------------------------------------+----------
       Uncomfortable |         0          2          0          0          0 |         2 
Somewhat comfortable |         4          3          1          0          0 |         8 
         Comfortable |         4         11         11          3          1 |        30 
    Very Comfortable |         4         18         27         17          3 |        69 
      Not Applicable |         1          2          0          0          0 |         3 
---------------------+-------------------------------------------------------+----------
               Total |        13         36         39         20          4 |       112 


. tab Pm17_2_2 m17_2_2, row nokey

   post-test, module |
 17, Likert question |        pre-test, module 17, Likert question #2
                  #2 | Uncomfort  Somewhat   Comfortab  Very Comf  Not Appli |     Total
---------------------+-------------------------------------------------------+----------
       Uncomfortable |         0          2          0          0          0 |         2 
                     |      0.00     100.00       0.00       0.00       0.00 |    100.00 
---------------------+-------------------------------------------------------+----------
Somewhat comfortable |         4          3          1          0          0 |         8 
                     |     50.00      37.50      12.50       0.00       0.00 |    100.00 
---------------------+-------------------------------------------------------+----------
         Comfortable |         4         11         11          3          1 |        30 
                     |     13.33      36.67      36.67      10.00       3.33 |    100.00 
---------------------+-------------------------------------------------------+----------
    Very Comfortable |         4         18         27         17          3 |        69 
                     |      5.80      26.09      39.13      24.64       4.35 |    100.00 
---------------------+-------------------------------------------------------+----------
      Not Applicable |         1          2          0          0          0 |         3 
                     |     33.33      66.67       0.00       0.00       0.00 |    100.00 
---------------------+-------------------------------------------------------+----------
               Total |        13         36         39         20          4 |       112 
                     |     11.61      32.14      34.82      17.86       3.57 |    100.00 


. tab Pm17_2_2

   post-test, module |
 17, Likert question |
                  #2 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |          2        1.79        1.79
Somewhat comfortable |          8        7.14        8.93
         Comfortable |         30       26.79       35.71
    Very Comfortable |         69       61.61       97.32
      Not Applicable |          3        2.68      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m17_2_2

pre-test, module 17, |
  Likert question #2 |      Freq.     Percent        Cum.
---------------------+-----------------------------------
       Uncomfortable |         13       11.61       11.61
Somewhat comfortable |         36       32.14       43.75
         Comfortable |         39       34.82       78.57
    Very Comfortable |         20       17.86       96.43
      Not Applicable |          4        3.57      100.00
---------------------+-----------------------------------
               Total |        112      100.00

. tab m17_2_2 Pm17_2_2, row nokey

pre-test, module 17, |        post-test, module 17, Likert question #2
  Likert question #2 | Uncomfort  Somewhat   Comfortab  Very Comf  Not Appli |     Total
---------------------+-------------------------------------------------------+----------
       Uncomfortable |         0          4          4          4          1 |        13 
                     |      0.00      30.77      30.77      30.77       7.69 |    100.00 
---------------------+-------------------------------------------------------+----------
Somewhat comfortable |         2          3         11         18          2 |        36 
                     |      5.56       8.33      30.56      50.00       5.56 |    100.00 
---------------------+-------------------------------------------------------+----------
         Comfortable |         0          1         11         27          0 |        39 
                     |      0.00       2.56      28.21      69.23       0.00 |    100.00 
---------------------+-------------------------------------------------------+----------
    Very Comfortable |         0          0          3         17          0 |        20 
                     |      0.00       0.00      15.00      85.00       0.00 |    100.00 
---------------------+-------------------------------------------------------+----------
      Not Applicable |         0          0          1          3          0 |         4 
                     |      0.00       0.00      25.00      75.00       0.00 |    100.00 
---------------------+-------------------------------------------------------+----------
               Total |         2          8         30         69          3 |       112 
                     |      1.79       7.14      26.79      61.61       2.68 |    100.00 


. signrank Pm17_2_2 m17_2_2, row nokey
options not allowed
r(101);

. signrank Pm17_2_2 m17_2_2,
options not allowed
r(101);

. signrank Pm17_2_2=m17_2_2,
options not allowed
r(101);

. signrank Pm17_2_2=m17_2_2

Wilcoxon signed-rank test

        sign |      obs   sum ranks    expected
-------------+---------------------------------
    positive |       71        5225        2916
    negative |       10         607        2916
        zero |       31         496         496
-------------+---------------------------------
         all |      112        6328        6328

unadjusted variance   118650.00
adjustment for ties    -3019.88
adjustment for zeros   -2604.00
                     ----------
adjusted variance     113026.13

Ho: Pm17_2_2 = m17_2_2
             z =   6.868
    Prob > |z| =   0.0000

. ttest Pm17_2_2=m17_2_2

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
Pm17_2_2 |     112      3.5625      .07037    .7447262    3.423057    3.701943
 m17_2_2 |     112    2.696429    .0956244    1.011994    2.506942    2.885915
---------+--------------------------------------------------------------------
    diff |     112    .8660714    .1018613    1.077999    .6642264    1.067916
------------------------------------------------------------------------------
     mean(diff) = mean(Pm17_2_2 - m17_2_2)                        t =   8.5025
 Ho: mean(diff) = 0                              degrees of freedom =      111

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. tab clinical_site

               Partner or Clinical Site |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                         Gweru Hospital |          9        8.04        8.04
                        Harare Hospital |         21       18.75       26.79
                        Howard Hospital |         11        9.82       36.61
                         Mpilo Hospital |          7        6.25       42.86
                  Parirenyatwa Hospital |         62       55.36       98.21
                                UNKNOWN |          2        1.79      100.00
----------------------------------------+-----------------------------------
                                  Total |        112      100.00

. exit, clear
